from bxarcpy.要素包 import 要素类, _输出路径生成_当采用内存临时时
from bxarcpy.游标包 import 游标类
from bxarcpy.几何包 import 几何类
from bxarcpy.环境包 import 输入输出类, 环境管理器类


def 要素联合(输入要素路径, 联合要素路径, 输出要素路径="内存临时"):
    输出要素路径 = _输出路径生成_当采用内存临时时([输入要素路径, 联合要素路径]) if 输出要素路径 == "内存临时" else 输出要素路径

    输入要素 = 要素类.要素创建_通过复制(输入要素路径)
    联合要素 = 要素类.要素创建_通过复制(联合要素路径)
    联合后要素 = 要素类.要素创建_通过联合并赋值字段(输入要素, 联合要素, 字段映射列表=None, 差异是否输出到要素类=True)
    输出要素 = 要素类.要素创建_通过复制并重命名重名要素(联合后要素, 输出要素路径)
    return 输出要素


def 要素空间连接(输入要素路径, 连接要素路径, 输出要素路径="内存临时"):
    输出要素路径 = _输出路径生成_当采用内存临时时([输入要素路径, 连接要素路径]) if 输出要素路径 == "内存临时" else 输出要素路径

    输入要素 = 要素类.要素创建_通过复制(输入要素路径)
    连接要素 = 要素类.要素创建_通过复制(连接要素路径)
    联合后要素 = 要素类.要素创建_通过空间连接(输入要素, 连接要素, "大部分在连接要素内")
    输出要素 = 要素类.要素创建_通过复制并重命名重名要素(联合后要素, 输出要素路径)
    return 输出要素


if __name__ == "__main__":
    # 工作空间 = r"C:\Users\common\project\F富阳受降控规\受降北_数据库.gdb"
    # 工作空间 = r"C:\Users\common\project\J江东区临江控规\临江控规_数据库.gdb"
    工作空间 = r"C:\Users\beixiao\Project\F富阳受降控规\0.资料\7.流程_24.06.13_质检\富阳区受降北单元入库数据.gdb"
    with 环境管理器类.环境管理器类创建(工作空间):
        # 曲转折(输入要素名称列表=["YD_CAD色块以外建设用地修改"])
        # 曲转折(输入要素路径列表=["JX_规划范围线", "JX_街坊范围线", "JX_街区范围线"])
        要素空间连接("XG_GHDK", "XG_YTFQ", "AA_test2")
        # 曲转折(输入要素名称列表=["YD_基期初转换", "YD_基期细化", "YD_农转用20年及以前", "YD_现状修改1", "YD_农转用21年及以后", "YD_审批信息已实施", "YD_地籍信息", "YD_现状修改2", "YD_审批信息已批未建", "YD_上位_粮食生产功能区", "YD_上位农用地落实_耕地质量提升", "YD_上位农用地落实_旱改水", "YD_上位农用地落实_垦造耕地", "YD_上位农用地落实_新增设施农用地", "YD_上位基本农田落实", "YD_GIS方案_农用地设计", "YD_CAD色块以外建设用地修改", "YD_CAD色块"])
