# -*- coding: utf-8 -*-

from typing import Literal
import bxarcpy.工具包 as 工具包
from bxarcpy.要素包 import 要素类
from bxpy.日志包 import 日志生成器
from bxarcpy.游标包 import 游标类
from bxarcpy.数据库包 import 数据库类
from bxarcpy.要素数据集包 import 要素数据集类
from bxarcpy.环境包 import 环境管理器类, 输入输出类
from bxgis.配置.配置包 import 配置类

基本信息 = 配置类.项目信息对象获取()


def 地类转换_旧版国空地类转新版国空地类(
    输入要素路径="XG_GHDK",
    地类编号字段名称=基本信息.地块要素字段映射.地类编号字段名称,
    输出要素路径="内存临时",
):
    日志生成器.临时关闭日志()
    # 需要提前完成编号、耕地面积计算
    输出要素路径 = 工具包.输出路径生成_当采用内存临时时(["旧版新地类转为新版新地类"]) if 输出要素路径 == "内存临时" else 输出要素路径

    输入要素 = 要素类.要素创建_通过复制(输入要素路径)

    操作字段名称列表 = [地类编号字段名称]
    替换记录字典 = {}
    with 游标类.游标创建("更新", 输入要素, 操作字段名称列表) as 游标:
        for 游标数据x in 游标类.属性获取_数据_字典形式(游标, 操作字段名称列表):
            if "0204" in 游标数据x[地类编号字段名称]:
                替换记录字典[游标数据x[地类编号字段名称]] = 游标数据x[地类编号字段名称].replace("0204", "0205")
                游标数据x[地类编号字段名称] = 游标数据x[地类编号字段名称].replace("0204", "0205")
            elif "060102" in 游标数据x[地类编号字段名称]:
                替换记录字典[游标数据x[地类编号字段名称]] = 游标数据x[地类编号字段名称].replace("060102", "1207v")
                游标数据x[地类编号字段名称] = 游标数据x[地类编号字段名称].replace("060102", "1207v")
            elif "2303" in 游标数据x[地类编号字段名称]:
                替换记录字典[游标数据x[地类编号字段名称]] = 游标数据x[地类编号字段名称].replace("2303", "060102")
                游标数据x[地类编号字段名称] = 游标数据x[地类编号字段名称].replace("2303", "060102")
            elif "0602" in 游标数据x[地类编号字段名称]:
                替换记录字典[游标数据x[地类编号字段名称]] = 游标数据x[地类编号字段名称].replace("0602", "060201")
                游标数据x[地类编号字段名称] = 游标数据x[地类编号字段名称].replace("0602", "060201")
            elif "0603" in 游标数据x[地类编号字段名称]:
                替换记录字典[游标数据x[地类编号字段名称]] = 游标数据x[地类编号字段名称].replace("0603", "060202")
                游标数据x[地类编号字段名称] = 游标数据x[地类编号字段名称].replace("0603", "060202")
            elif "0604" in 游标数据x[地类编号字段名称]:
                替换记录字典[游标数据x[地类编号字段名称]] = 游标数据x[地类编号字段名称].replace("0604", "060203")
                游标数据x[地类编号字段名称] = 游标数据x[地类编号字段名称].replace("0604", "060203")
            elif "1311" in 游标数据x[地类编号字段名称]:
                替换记录字典[游标数据x[地类编号字段名称]] = 游标数据x[地类编号字段名称].replace("1311", "1705")
                游标数据x[地类编号字段名称] = 游标数据x[地类编号字段名称].replace("1311", "1705")
            elif "1312" in 游标数据x[地类编号字段名称]:
                替换记录字典[游标数据x[地类编号字段名称]] = 游标数据x[地类编号字段名称].replace("1312", "1311")
                游标数据x[地类编号字段名称] = 游标数据x[地类编号字段名称].replace("1312", "1311")
            elif "1313" in 游标数据x[地类编号字段名称]:
                替换记录字典[游标数据x[地类编号字段名称]] = 游标数据x[地类编号字段名称].replace("1313", "1312")
                游标数据x[地类编号字段名称] = 游标数据x[地类编号字段名称].replace("1313", "1312")
            elif "2302" in 游标数据x[地类编号字段名称]:
                替换记录字典[游标数据x[地类编号字段名称]] = 游标数据x[地类编号字段名称].replace("2302", "2303")
                游标数据x[地类编号字段名称] = 游标数据x[地类编号字段名称].replace("2302", "2303")

            游标类.行更新_字典形式(游标, 游标数据x, 操作字段名称列表)
    for k, v in 替换记录字典.items():
        输入输出类.输出消息(f"{k} => {v}")
    输出要素 = 要素类.要素创建_通过复制并重命名重名要素(输入要素, 输出要素路径)
    return 输出要素


if __name__ == "__main__":
    日志生成器.开启()
    工作空间 = r"C:\Users\common\project\F富阳受降控规\受降北_数据库.gdb"
    # 工作空间 = r"C:\Users\common\project\J江东区临江控规\临江控规_数据库.gdb"
    with 环境管理器类.环境管理器类创建(工作空间):
        地类转换_旧版国空地类转新版国空地类(
            输入要素路径="YD_CAD色块",
            输出要素路径="YD_CAD色块1",
        )
