# *-* coding:utf8 *-*
import bxarcpy.工具包 as 工具包
from bxarcpy.要素包 import 要素类
from bxpy.路径包 import 路径类
from bxarcpy.游标包 import 游标类
from bxarcpy.数据库包 import 数据库类
from bxarcpy.要素数据集包 import 要素数据集类
from bxarcpy.环境包 import 环境管理器类, 输入输出类
from bxgis.配置 import 基本信息


def 用地_工具集_用地数据统计(
    用地要素路径,
    地类编号字段名称=基本信息.地块要素字段映射.地类编号字段名称,
    输出要素路径="内存临时",
):
    输出要素路径 = 工具包.输出路径生成_当采用内存临时时(["用地构成表生成"]) if 输出要素路径 == "内存临时" else 输出要素路径

    # from bxpandas.数据框架包 import 数据框架类

    # 配置文件路径 = 路径类.连接(基本信息.计算机信息.bxgis根目录, "配置", "地块_指标测算表.xlsx")
    # a = 数据框架类.转换_从excel文件(配置文件路径, 要读取的列=["性质名称", "地块性质", "地类标准"], 指定数据类型={"性质名称": str, "地块性质": str, "地类标准": str})
    # 基数转换映射表 = 数据框架类.转换_到字典(a)  # type: ignore
    用地统计表 = [
        {"统计名称": "总用地面积", "包含性质": ".*", "除外性质": "(?!)"},
        {"统计名称": "耕地", "包含性质": "^01.*", "除外性质": "(?!)"},
        {"统计名称": "园地", "包含性质": "^02.*", "除外性质": "(?!)"},
        {"统计名称": "林地", "包含性质": "^03.*", "除外性质": "(?!)"},
        {"统计名称": "草地", "包含性质": "^04.*", "除外性质": "(?!)"},
        {"统计名称": "湿地", "包含性质": "^05.*", "除外性质": "(?!)"},
        {"统计名称": "设施农用地", "包含性质": "^06.*", "除外性质": "(?!)"},
        {"统计名称": "居住用地", "包含性质": "^07.*", "除外性质": "(?!)"},
        {"统计名称": "公共管理与公共服务用地", "包含性质": "^08.*", "除外性质": "(?!)"},
        {"统计名称": "商业服务业用地", "包含性质": "^09.*", "除外性质": "(?!)"},
        {"统计名称": "工矿用地", "包含性质": "^10.*", "除外性质": "(?!)"},
        {"统计名称": "仓储用地", "包含性质": "^11.*", "除外性质": "(?!)"},
        {"统计名称": "交通运输用地", "包含性质": "^12.*", "除外性质": "(?!)"},
        {"统计名称": "公用设施用地", "包含性质": "^13.*", "除外性质": "(?!)"},
        {"统计名称": "绿地与开敞空间用地", "包含性质": "^14.*", "除外性质": "(?!)"},
        {"统计名称": "特殊用地", "包含性质": "^15.*", "除外性质": "(?!)"},
        {"统计名称": "留白用地", "包含性质": "^16.*", "除外性质": "(?!)"},
        {"统计名称": "陆地水域", "包含性质": "^17.*", "除外性质": "(?!)"},
        {"统计名称": "其他土地", "包含性质": "^23.*", "除外性质": "(?!)"},
        {"统计名称": "建设用地面积", "包含性质": "^(07.*|08.*|09.*|10.*|11.*|12.*|13.*|14.*|15.*|16.*|2301.*)", "除外性质": "(?!)"},
        {"统计名称": "居住用地_建设", "包含性质": "^07.*", "除外性质": "(?!)"},
        {"统计名称": "公共管理与公共服务用地_建设", "包含性质": "^08.*", "除外性质": "(?!)"},
        {"统计名称": "商业服务业用地_建设", "包含性质": "^09.*", "除外性质": "(?!)"},
        {"统计名称": "工矿用地_建设", "包含性质": "^10.*", "除外性质": "(?!)"},
        {"统计名称": "仓储用地_建设", "包含性质": "^11.*", "除外性质": "(?!)"},
        {"统计名称": "交通运输用地_建设", "包含性质": "^12.*", "除外性质": "(?!)"},
        {"统计名称": "公用设施用地_建设", "包含性质": "^13.*", "除外性质": "(?!)"},
        {"统计名称": "绿地与开敞空间用地_建设", "包含性质": "^14.*", "除外性质": "(?!)"},
        {"统计名称": "特殊用地_建设", "包含性质": "^15.*", "除外性质": "(?!)"},
        {"统计名称": "留白用地_建设", "包含性质": "^16.*", "除外性质": "(?!)"},
        {"统计名称": "其他土地_建设", "包含性质": "^2301.*", "除外性质": "(?!)"},
        {"统计名称": "城乡建设用地", "包含性质": "^(07.*|08.*|09.*|10.*|11.*|12.*|13.*|14.*|16.*|2301.*)", "除外性质": "^(1002.*|1003.*|1201.*|1202.*|1203.*|1204.*|1205.*|1206.*|1311.*)"},
        {"统计名称": "居住用地_城乡", "包含性质": "^07.*", "除外性质": "(?!)"},
        {"统计名称": "公共管理与公共服务用地_城乡", "包含性质": "^08.*", "除外性质": "(?!)"},
        {"统计名称": "商业服务业用地_城乡", "包含性质": "^09.*", "除外性质": "(?!)"},
        {"统计名称": "工矿用地_城乡", "包含性质": "^10.*", "除外性质": "^(1002.*|1003.*)"},
        {"统计名称": "仓储用地_城乡", "包含性质": "^11.*", "除外性质": "(?!)"},
        {"统计名称": "交通运输用地_城乡", "包含性质": "^(1207.*|1208.*|1209.*)", "除外性质": "(?!)"},
        {"统计名称": "公用设施用地_城乡", "包含性质": "^13.*", "除外性质": "^1311.*"},
        {"统计名称": "绿地与开敞空间用地_城乡", "包含性质": "^14.*", "除外性质": "(?!)"},
        {"统计名称": "留白用地_城乡", "包含性质": "^16.*", "除外性质": "(?!)"},
        {"统计名称": "其他土地_城乡", "包含性质": "^2301.*", "除外性质": "(?!)"},
        {"统计名称": "城镇建设用地", "包含性质": "^(07.*|08.*|09.*|10.*|11.*|12.*|13.*|14.*|16.*|2301.*)", "除外性质": "^(0703.*|0704.*|08.*v.*|09.*v.*|10.*v.*|1002.*|1003.*|11.*v.*|12.*v.*|1201.*|1202.*|1203.*|1204.*|1205.*|1206.*|13.*v.*|1311.*|14.*v.*|16.*v.*|2301.*v.*)"},
        {"统计名称": "居住用地_城镇", "包含性质": "^07.*", "除外性质": "^(0703.*|0704.*)"},
        {"统计名称": "公共管理与公共服务用地_城镇", "包含性质": "^08.*", "除外性质": "^08.*v.*"},
        {"统计名称": "商业服务业用地_城镇", "包含性质": "^09.*", "除外性质": "^09.*v.*"},
        {"统计名称": "工矿用地_城镇", "包含性质": "^10.*", "除外性质": "^(10.*v.*|1002.*|1003.*)"},
        {"统计名称": "仓储用地_城镇", "包含性质": "^11.*", "除外性质": "^11.*v.*"},
        {"统计名称": "交通运输用地_城镇", "包含性质": "^(1207.*|1208.*|1209.*)", "除外性质": "^(1207.*v.*|1208.*v.*|1209.*v.*)"},
        {"统计名称": "公用设施用地_城镇", "包含性质": "^13.*", "除外性质": "^(13.*v.*|1311.*)"},
        {"统计名称": "绿地与开敞空间用地_城镇", "包含性质": "^14.*", "除外性质": "^14.*v.*"},
        {"统计名称": "留白用地_城镇", "包含性质": "^16.*", "除外性质": "^16.*v.*"},
        {"统计名称": "其他土地_城镇", "包含性质": "^2301.*", "除外性质": "^2301.*v.*"},
        {"统计名称": "村庄建设用地", "包含性质": "^(0703.*|0704.*|08.*v.*|09.*v.*|10.*v.*|11.*v.*|1207.*v.*|1208.*v.*|1209.*v.*|13.*v.*|14.*v.*|16.*v.*|2301.*v.*)", "除外性质": "^(1002.*|1003.*|1311.*)"},
        {"统计名称": "居住用地_村庄", "包含性质": "^(0703.*|0704.*)", "除外性质": "(?!)"},
        {"统计名称": "公共管理与公共服务用地_村庄", "包含性质": "^08.*v.*", "除外性质": "(?!)"},
        {"统计名称": "商业服务业用地_村庄", "包含性质": "^09.*v.*", "除外性质": "(?!)"},
        {"统计名称": "工矿用地_村庄", "包含性质": "^10.*v.*", "除外性质": "^(1002.*|1003.*)"},
        {"统计名称": "仓储用地_村庄", "包含性质": "^11.*v.*", "除外性质": "(?!)"},
        {"统计名称": "交通运输用地_村庄", "包含性质": "^(1207.*v.*|1208.*v.*|1209.*v.*)", "除外性质": "(?!)"},
        {"统计名称": "公用设施用地_村庄", "包含性质": "^13.*v.*", "除外性质": "^1311.*"},
        {"统计名称": "绿地与开敞空间用地_村庄", "包含性质": "^14.*v.*", "除外性质": "(?!)"},
        {"统计名称": "留白用地_村庄", "包含性质": "^16.*v.*", "除外性质": "(?!)"},
        {"统计名称": "其他土地_村庄", "包含性质": "^2301.*v.*", "除外性质": "(?!)"},
        {"统计名称": "区域基础设施用地", "包含性质": "^(12.*|1311.*)", "除外性质": "^(1207.*|1208.*|1209.*)"},
        {"统计名称": "交通运输用地_区域", "包含性质": "^12.*", "除外性质": "^(1207.*|1208.*|1209.*)"},
        {"统计名称": "公用设施用地_区域", "包含性质": "^1311.*", "除外性质": "^(?!)"},
        {"统计名称": "其他建设用地", "包含性质": "^(15.*|1002.*|1003.*)", "除外性质": "(?!)"},
        {"统计名称": "特殊用地_其他", "包含性质": "^15.*", "除外性质": "(?!)"},
        {"统计名称": "工矿用地_其他", "包含性质": "^(1002.*|1003.*)", "除外性质": "(?!)"},
        {"统计名称": "非建设用地面积", "包含性质": ".*", "除外性质": "^(07.*|08.*|09.*|10.*|11.*|12.*|13.*|14.*|15.*|16.*|2301.*)"},
        {"统计名称": "耕地_非建设", "包含性质": "^01.*", "除外性质": "(?!)"},
        {"统计名称": "园地_非建设", "包含性质": "^02.*", "除外性质": "(?!)"},
        {"统计名称": "林地_非建设", "包含性质": "^03.*", "除外性质": "(?!)"},
        {"统计名称": "草地_非建设", "包含性质": "^04.*", "除外性质": "(?!)"},
        {"统计名称": "湿地_非建设", "包含性质": "^05.*", "除外性质": "(?!)"},
        {"统计名称": "设施农用地_非建设", "包含性质": "^06.*", "除外性质": "(?!)"},
        {"统计名称": "陆地水域_非建设", "包含性质": "^17.*", "除外性质": "(?!)"},
        {"统计名称": "其他土地_非建设", "包含性质": "^23.*", "除外性质": "^2301.*"},
    ]

    from collections import OrderedDict

    用地要素 = 要素类.要素创建_通过复制(用地要素路径)

    用地汇总字典 = OrderedDict()
    总居住人数 = 0.00
    需操作的字段名称列表 = [地类编号字段名称, "_面积"]
    with 游标类.游标创建("查询", 用地要素, 需操作的字段名称列表) as 游标:
        for x in 游标类.属性获取_数据_字典形式(游标, 需操作的字段名称列表):
            用地汇总字典.setdefault(x[地类编号字段名称], 0.00)
            用地汇总字典[x[地类编号字段名称]] += x["_面积"]

    from bxpy.基本对象包 import 表类, 字类, 字典类
    from bxpy.路径包 import 路径类

    统计数据 = OrderedDict()
    for 统计项x in 用地统计表:
        统计数据.setdefault(统计项x["统计名称"], 0.00)
        for k, v in 用地汇总字典.items():
            if 字类.匹配正则(k, 统计项x["包含性质"]) and not 字类.匹配正则(k, 统计项x["除外性质"]):
                统计数据[统计项x["统计名称"]] += v

    统计数据比例 = OrderedDict()
    统计数据比例["建设用地面积_比例_占总"] = 统计数据["建设用地面积"] / 统计数据["总用地面积"] * 100
    统计数据比例["城乡建设用地_比例_占总"] = 统计数据["城乡建设用地"] / 统计数据["总用地面积"] * 100
    统计数据比例["城镇建设用地_比例_占总"] = 统计数据["城镇建设用地"] / 统计数据["总用地面积"] * 100
    统计数据比例["村庄建设用地_比例_占总"] = 统计数据["村庄建设用地"] / 统计数据["总用地面积"] * 100
    统计数据比例["区域基础设施用地_比例_占总"] = 统计数据["区域基础设施用地"] / 统计数据["总用地面积"] * 100
    统计数据比例["其他建设用地_比例_占总"] = 统计数据["其他建设用地"] / 统计数据["总用地面积"] * 100
    统计数据比例["非建设用地面积_比例_占总"] = 统计数据["非建设用地面积"] / 统计数据["总用地面积"] * 100

    统计数据比例["耕地_比例_占总"] = 统计数据["耕地"] / 统计数据["总用地面积"] * 100
    统计数据比例["园地_比例_占总"] = 统计数据["园地"] / 统计数据["总用地面积"] * 100
    统计数据比例["林地_比例_占总"] = 统计数据["林地"] / 统计数据["总用地面积"] * 100
    统计数据比例["草地_比例_占总"] = 统计数据["草地"] / 统计数据["总用地面积"] * 100
    统计数据比例["湿地_比例_占总"] = 统计数据["湿地"] / 统计数据["总用地面积"] * 100
    统计数据比例["设施农用地_比例_占总"] = 统计数据["设施农用地"] / 统计数据["总用地面积"] * 100
    统计数据比例["居住用地_比例_占总"] = 统计数据["居住用地"] / 统计数据["总用地面积"] * 100
    统计数据比例["公共管理与公共服务用地_比例_占总"] = 统计数据["公共管理与公共服务用地"] / 统计数据["总用地面积"] * 100
    统计数据比例["商业服务业用地_比例_占总"] = 统计数据["商业服务业用地"] / 统计数据["总用地面积"] * 100
    统计数据比例["工矿用地_比例_占总"] = 统计数据["工矿用地"] / 统计数据["总用地面积"] * 100
    统计数据比例["仓储用地_比例_占总"] = 统计数据["仓储用地"] / 统计数据["总用地面积"] * 100
    统计数据比例["交通运输用地_比例_占总"] = 统计数据["交通运输用地"] / 统计数据["总用地面积"] * 100
    统计数据比例["公用设施用地_比例_占总"] = 统计数据["公用设施用地"] / 统计数据["总用地面积"] * 100
    统计数据比例["绿地与开敞空间用地_比例_占总"] = 统计数据["绿地与开敞空间用地"] / 统计数据["总用地面积"] * 100
    统计数据比例["特殊用地_比例_占总"] = 统计数据["特殊用地"] / 统计数据["总用地面积"] * 100
    统计数据比例["留白用地_比例_占总"] = 统计数据["留白用地"] / 统计数据["总用地面积"] * 100
    统计数据比例["陆地水域_比例_占总"] = 统计数据["陆地水域"] / 统计数据["总用地面积"] * 100
    统计数据比例["其他土地_比例_占总"] = 统计数据["其他土地"] / 统计数据["总用地面积"] * 100

    统计数据比例["居住用地_城镇_比例_占城镇建设用地"] = 统计数据["居住用地_城镇"] / 统计数据["城镇建设用地"] * 100
    统计数据比例["公共管理与公共服务用地_城镇_比例_占城镇建设用地"] = 统计数据["公共管理与公共服务用地_城镇"] / 统计数据["城镇建设用地"] * 100
    统计数据比例["商业服务业用地_城镇_比例_占城镇建设用地"] = 统计数据["商业服务业用地_城镇"] / 统计数据["城镇建设用地"] * 100
    统计数据比例["工矿用地_城镇_比例_占城镇建设用地"] = 统计数据["工矿用地_城镇"] / 统计数据["城镇建设用地"] * 100
    统计数据比例["仓储用地_城镇_比例_占城镇建设用地"] = 统计数据["仓储用地_城镇"] / 统计数据["城镇建设用地"] * 100
    统计数据比例["交通运输用地_城镇_比例_占城镇建设用地"] = 统计数据["交通运输用地_城镇"] / 统计数据["城镇建设用地"] * 100
    统计数据比例["公用设施用地_城镇_比例_占城镇建设用地"] = 统计数据["公用设施用地_城镇"] / 统计数据["城镇建设用地"] * 100
    统计数据比例["绿地与开敞空间用地_城镇_比例_占城镇建设用地"] = 统计数据["绿地与开敞空间用地_城镇"] / 统计数据["城镇建设用地"] * 100
    统计数据比例["留白用地_城镇_比例_占城镇建设用地"] = 统计数据["留白用地_城镇"] / 统计数据["城镇建设用地"] * 100
    统计数据比例["其他土地_城镇_比例_占城镇建设用地"] = 统计数据["其他土地_城镇"] / 统计数据["城镇建设用地"] * 100

    信息文件路径 = r"C:\Users\common\Project\D德清洛舍杨树湾单元控规\03过程文件\24.11.27报批稿\D德清洛舍杨树湾单元控规_信息.json"
    if not 路径类.是否存在(信息文件路径):
        路径类.新增文件(信息文件路径)
    信息json = 字典类.转换_从文件(信息文件路径)
    信息json.setdefault("技术指标", {})
    信息json["技术指标"].setdefault("统计数据", {})
    信息json["技术指标"]["统计数据"] = 统计数据
    信息json["技术指标"].setdefault("统计数据比例", {})
    信息json["技术指标"]["统计数据比例"] = 统计数据比例

    信息json["技术指标"].setdefault("用地数据", {})
    用地汇总字典 = OrderedDict(表类.排序(None, 用地汇总字典.items()))
    信息json["技术指标"]["用地数据"] = 用地汇总字典

    字典类.转换_到文件(信息json, 信息文件路径)
    字典类.转换_到文件(信息json, 信息文件路径[0:-5] + ".toml")
    return None


if __name__ == "__main__":
    # 工作空间 = r"C:\Users\common\project\F富阳受降控规\受降北_数据库.gdb"
    工作空间 = r"C:\Users\common\project\J江东区临江控规\临江控规_数据库.gdb"
    工作空间 = r"C:\Users\common\Project\D德清洛舍杨树湾单元控规\03过程文件\24.11.27报批稿\D德清洛舍杨树湾单元控规_数据库.gdb"
    with 环境管理器类.环境管理器类创建(工作空间):
        用地_工具集_用地数据统计("DIST_用地规划图")
        # print("银湖村")
        # 用地_工具集_用地构成表生成("AA_用地规划图_银湖村")
        # print("东坞山村")
        # 用地_工具集_用地构成表生成("AA_用地规划图_东坞山村")
        # print("大庄村")
        # 用地_工具集_用地构成表生成("AA_用地规划图_大庄村")
