# -*- coding: utf-8 -*-

import bxarcpy
from typing import Literal


def 入库_街区街坊分村(区域要素名称="JX_街区范围线", 单元名称="临江单元", 层级: Literal["街区", "街坊", "分村"] = "街区", 输出要素名称="XG_JQJF_JQ", 区域编号字段名称="区域编号", 区域主导属性字段名称="区域主导属性", 总居住人数字段名称="总居住人数", 总建筑面积字段名称="总建筑面积", 总住宅建筑面积字段名称="总住宅建筑面积", 总工业建筑面积字段名称="总工业建筑面积", 总商服建筑面积字段名称="总商服建筑面积", 总户籍人口字段名称="总户籍人口", 总常住人口字段名称="总常住人口", 耕地保有量字段名称="耕地保有量面积", 永久基本农田面积字段名称="永久基本农田面积", 生态保护红线面积字段名称="生态保护红线面积", 村庄建设边界面积字段名称="村庄建设边界面积", 城乡建设用地面积字段名称="城乡建设用地面积", 村庄建设用地面积字段名称="村庄建设用地面积"):
    # print(f"当前层级是：{层级}")
    区域要素 = bxarcpy.要素类.要素读取_通过名称(区域要素名称).要素创建_通过复制()

    区域要素.字段添加("DYMC", "字符串", 50, "规划编制单元名称").字段计算("DYMC", f"'{单元名称}'")
    区域要素.字段添加("CJ", "字符串", 10, "层级").字段计算("CJ", f"'{层级}'")
    区域要素.字段添加("BM", "字符串", 10, "编码").字段计算("BM", f"!{区域编号字段名称}!")

    # 街区、街坊类型在“生态型、创新型、综合型、产业型、居住型、其他型”6 种类型中进行选择填写；分村类型在“集聚建设类、整治提升类、城郊融合类、特色保护类、精明收缩类”5 种类型中进行选择填写
    区域要素.字段添加("LX", "字符串", 10, "类型").字段计算("LX", f"!{区域主导属性字段名称}!")

    区域要素.字段添加("MJ", "双精度", 50, "面积").字段计算("MJ", "round(!Shape_Area!/10000, 4)")

    区域要素.字段添加("RK", "双精度", 50, f"城镇人口规模").字段计算("RK", f"round(float(!{总居住人数字段名称}!)/10000,4)")
    区域要素.字段添加("JZZL", "双精度", 50, f"{层级}建筑总量").字段计算("JZZL", f"round(float(!{总建筑面积字段名称}!)/10000,4)")
    区域要素.字段添加("ZZZL", "双精度", 50, f"{层级}住宅总量").字段计算("ZZZL", f"round(float(!{总住宅建筑面积字段名称}!)/10000,4)")
    区域要素.字段添加("GYZL", "双精度", 50, f"{层级}工业总量").字段计算("GYZL", f"round(float(!{总工业建筑面积字段名称}!)/10000,4)")
    区域要素.字段添加("SYZL", "双精度", 50, f"{层级}商业商务总量").字段计算("SYZL", f"round(float(!{总商服建筑面积字段名称}!)/10000,4)")

    区域要素.字段添加("HJRK", "双精度", 50, f"分村户籍人口").字段计算("HJRK", f"round(float(!{总户籍人口字段名称}!)/10000,4)")
    区域要素.字段添加("CZRK", "双精度", 50, f"分村常住人口").字段计算("CZRK", f"round(float(!{总常住人口字段名称}!)/10000,4)")
    区域要素.字段添加("GD", "双精度", 50, f"耕地保有量").字段计算("GD", f"round(float(!{耕地保有量字段名称}!)/10000,4)")
    区域要素.字段添加("YN", "双精度", 50, f"永久基本农田面积").字段计算("YN", f"round(float(!{永久基本农田面积字段名称}!)/10000,4)")
    区域要素.字段添加("ST", "双精度", 50, f"生态保护红线面积").字段计算("ST", f"round(float(!{生态保护红线面积字段名称}!)/10000,4)")
    区域要素.字段添加("CZBJ", "双精度", 50, f"村庄建设边界面积").字段计算("CZBJ", f"round(float(!{村庄建设边界面积字段名称}!)/10000,4)")
    区域要素.字段添加("CXMJ", "双精度", 50, f"城乡建设用地面积").字段计算("CXMJ", f"round(float(!{城乡建设用地面积字段名称}!)/10000,4)")
    区域要素.字段添加("CZMJ", "双精度", 50, f"村庄建设用地面积").字段计算("CZMJ", f"round(float(!{村庄建设用地面积字段名称}!)/10000,4)")
    区域要素.字段添加("BZ", "字符串", 255, "备注")

    区域要素.字段删除(保留字段名称列表=["DYMC", "CJ", "BM", "LX", "MJ", "RK", "JZZL", "ZZZL", "GYZL", "SYZL", "HJRK", "CZRK", "GD", "YN", "ST", "CZBJ", "CXMJ", "CZMJ", "BZ"])

    区域要素.要素创建_通过复制并重命名重名要素(输出要素名称)


if __name__ == "__main__":
    # 工作空间 = r"C:\Users\common\project\F富阳受降控规\受降北_数据库.gdb"
    工作空间 = r"C:\Users\common\project\J江东区临江控规\临江控规_数据库.gdb"
    with bxarcpy.环境.环境管理器(工作空间):
        入库_街区街坊分村(区域要素名称="JX_街区范围线", 单元名称="临江单元", 层级="街区", 输出要素名称="XG_JQJF_JQ")
