import bxarcpy


def 入库_局调入库(工作空间=r"C:\Users\common\project\J江东区临江控规\临江控规_数据库.gdb", 输入要素="\\AA_规划工业用地"):  # 用地_格式化_修改为入库格式
    with bxarcpy.环境.环境管理器(临时工作空间=工作空间, 工作空间=工作空间):
        # To allow overwriting outputs change overwriteOutput option to True.
        bxarcpy.配置.是否覆盖输出要素 = True
        # arcpy.env.overwriteOutput = False

        删除字段 = ["Entity", "Color", "Linetype", "Elevation", "LineWt", "RefName", "mj", "FID_YJJBNTBHTB", "BSM", "YSDM", "XZQDM", "XZQMC", "YJJBNTTBBH", "TBBH", "DLBM", "DLMC", "QSXZ", "QSDWDM", "QSDWMC", "ZLDWDM", "ZLDWMC", "YJJBNTTBMJ", "KCDLBM", "KCXS", "KCMJ", "YJJBNTMJ", "GDLX", "GDPDJB", "GGBZL", "TBXHDM", "TBXHMC", "ZZSXDM", "ZZSXMC", "GDDB", "GDDJ", "ZLFLDM", "FRDBS", "SJNF", "CFZR", "ZMC", "ZZRR", "ZRRZJHM", "ZRRMC", "LXDH", "JZDZ", "BHKSSJ", "BHJSSJ", "SJBH", "SJMC", "ZRSYX", "BZ", "WDGD", "SFWYYJJBNT", "FWDGDHRLY", "FID_规划范围线_2303070850", "序号", "组名", "村名称", "街道", "二调耕", "三调耕", "三调恢", "二调永", "三调稳", "Shape_Leng", "FID_4去除", "名称", "镇街名称", "a", "ORIG_FID", "三调地类编号", "三调地类名称", "CZCSXM", "Layer", "地块性质", "实体类型", "GKXZ", "FID_DLTB", "TBYBH", "单元名", "地块性", "dkbmgk"]

        地类转换路径 = "C:\\Users\\common\\AppConfig\\ArcGIS\\020.地类转换\\地类转换_国空与城乡地类转换.xls\\Sheet1$"

        # Process: 添加字段 (4) (添加字段) (management)
        输出要素 = bxarcpy.数据管理.字段添加(输入要素=输入要素, 字段名称="GHDY", 字段类型="字符串", 字段长度=50, 字段别称="规划编制单元名称")

        # Process: 计算字段 (4) (计算字段) (management)
        输出要素 = bxarcpy.数据管理.字段计算(输入要素=输出要素, 字段名称="GHDY", 表达式="'临江单元'", 字段类型="字符串")

        # Process: 添加字段 (2) (添加字段) (management)
        输出要素 = bxarcpy.数据管理.字段添加(输入要素=输出要素, 字段名称="PFSJ", 字段类型="日期", 字段长度=100, 字段别称="批复时间")

        # Process: 添加字段 (5) (添加字段) (management)
        输出要素 = bxarcpy.数据管理.字段添加(输入要素=输出要素, 字段名称="YDXZMC", 字段类型="字符串", 字段长度=50, 字段别称="用地性质名称")

        # Process: 计算字段 (5) (计算字段) (management)
        输出要素 = bxarcpy.数据管理.字段计算(输入要素=输出要素, 字段名称="YDXZMC", 表达式="!性质名称!", 字段类型="字符串")

        # Process: 添加字段 (7) (添加字段) (management)
        输出要素 = bxarcpy.数据管理.字段添加(输入要素=输出要素, 字段名称="PFWH", 字段类型="字符串", 字段长度=50, 字段别称="批复文号")

        # Process: 添加字段 (8) (添加字段) (management)
        输出要素 = bxarcpy.数据管理.字段添加(输入要素=输出要素, 字段名称="DKBH", 字段类型="字符串", 字段长度=50, 字段别称="地块编号")

        # Process: 计算字段 (2) (计算字段) (management)
        输出要素 = bxarcpy.数据管理.字段计算(输入要素=输出要素, 字段名称="DKBH", 表达式="!地块编号!", 字段类型="字符串")

        # Process: 添加字段 (9) (添加字段) (management)
        输出要素 = bxarcpy.数据管理.字段添加(输入要素=输出要素, 字段名称="MJ", 字段类型="双精度", 字段长度=10, 字段别称="面积")

        # Process: 计算字段 (7) (计算字段) (management)
        输出要素 = bxarcpy.数据管理.字段计算(输入要素=输出要素, 字段名称="MJ", 表达式="!面积公顷!", 字段类型="字符串")

        # Process: 添加字段 (10) (添加字段) (management)
        输出要素 = bxarcpy.数据管理.字段添加(输入要素=输出要素, 字段名称="RJL", 字段类型="单精度", 字段长度=10, 字段别称="容积率")

        # Process: 计算字段 (8) (计算字段) (management)
        容积率计算 = """
        def test(x):
            if x:
                return float(x)
        """
        输出要素 = bxarcpy.数据管理.字段计算(输入要素=输出要素, 字段名称="RJL", 表达式="test(!容积率!)", 字段类型="字符串", 代码块=容积率计算)

        # Process: 添加字段 (11) (添加字段) (management)
        输出要素 = bxarcpy.数据管理.字段添加(输入要素=输出要素, 字段名称="RJL_XX", 字段类型="单精度", 字段长度=10, 字段别称="容积率下限")

        # Process: 添加字段 (12) (添加字段) (management)
        输出要素 = bxarcpy.数据管理.字段添加(输入要素=输出要素, 字段名称="LDL", 字段类型="单精度", 字段长度=10, 字段别称="绿地率")

        # Process: 计算字段 (9) (计算字段) (management)
        绿地率计算 = """
        def test(x):
            if x:
                return float(x)
        """
        输出要素 = bxarcpy.数据管理.字段计算(输入要素=输出要素, 字段名称="LDL", 表达式="test(!绿地率!)", 字段类型="字符串", 代码块=绿地率计算)

        # Process: 添加字段 (13) (添加字段) (management)
        输出要素 = bxarcpy.数据管理.字段添加(输入要素=输出要素, 字段名称="LDL_SX", 字段类型="单精度", 字段长度=10, 字段别称="绿地率上限")

        # Process: 添加字段 (14) (添加字段) (management)
        输出要素 = bxarcpy.数据管理.字段添加(输入要素=输出要素, 字段名称="JZMD", 字段类型="单精度", 字段长度=10, 字段别称="建筑密度")

        # Process: 计算字段 (10) (计算字段) (management)
        建筑密度计算 = """
        def test(x):
            if x and x != "方案阶段名称":
                return float(x)
        """
        输出要素 = bxarcpy.数据管理.字段计算(输入要素=输出要素, 字段名称="JZMD", 表达式="test(!建筑密度!)", 字段类型="字符串", 代码块=建筑密度计算)

        # Process: 添加字段 (15) (添加字段) (management)
        输出要素 = bxarcpy.数据管理.字段添加(输入要素=输出要素, 字段名称="JZMD_XX", 字段类型="单精度", 字段长度=10, 字段别称="建筑密度下限")

        # Process: 添加字段 (16) (添加字段) (management)
        输出要素 = bxarcpy.数据管理.字段添加(输入要素=输出要素, 字段名称="JZXG", 字段类型="单精度", 字段长度=10, 字段别称="建筑限高")

        # Process: 计算字段 (11) (计算字段) (management)
        建筑限高计算 = """
        def test(x):
            x = x.split('-')[0]
            if x:
                return float(x)
        """
        输出要素 = bxarcpy.数据管理.字段计算(输入要素=输出要素, 字段名称="JZXG", 表达式="test(!建筑限高!)", 字段类型="字符串", 代码块=建筑限高计算)

        # Process: 添加字段 (17) (添加字段) (management)
        输出要素 = bxarcpy.数据管理.字段添加(输入要素=输出要素, 字段名称="JZXG_XX", 字段类型="单精度", 字段长度=10, 字段别称="建筑限高下限")

        # Process: 添加字段 (18) (添加字段) (management)
        输出要素 = bxarcpy.数据管理.字段添加(输入要素=输出要素, 字段名称="JDCW", 字段类型="短整型", 字段长度=10, 字段别称="机动车位")

        # Process: 添加字段 (19) (添加字段) (management)
        输出要素 = bxarcpy.数据管理.字段添加(输入要素=输出要素, 字段名称="JDCW_SX", 字段类型="短整型", 字段长度=10, 字段别称="机动车位上限")

        # Process: 添加字段 (20) (添加字段) (management)
        输出要素 = bxarcpy.数据管理.字段添加(输入要素=输出要素, 字段名称="FJDCW", 字段类型="短整型", 字段长度=10, 字段别称="非机动车位")

        # Process: 添加字段 (21) (添加字段) (management)
        输出要素 = bxarcpy.数据管理.字段添加(输入要素=输出要素, 字段名称="FJDCW_SX", 字段类型="短整型", 字段长度=10, 字段别称="非机动车位上限")

        # Process: 添加字段 (22) (添加字段) (management)
        输出要素 = bxarcpy.数据管理.字段添加(输入要素=输出要素, 字段名称="TDM", 字段类型="字符串", 字段长度=50, 字段别称="土地码")

        # Process: 添加字段 (23) (添加字段) (management)
        输出要素 = bxarcpy.数据管理.字段添加(输入要素=输出要素, 字段名称="BZ", 字段类型="字符串", 字段长度=255, 字段别称="备注")

        # Process: 计算字段 (12) (计算字段) (management)
        输出要素 = bxarcpy.数据管理.字段计算(输入要素=输出要素, 字段名称="BZ", 表达式="!备注说明!", 字段类型="字符串")

        # Process: 添加字段 (3) (添加字段) (management)
        输出要素 = bxarcpy.数据管理.字段添加(输入要素=输出要素, 字段名称="YDXZ_N", 字段类型="字符串", 字段长度=50, 字段别称="用地性质代码_新地类")

        # Process: 计算字段 (3) (计算字段) (management)
        输出要素 = bxarcpy.数据管理.字段计算(输入要素=输出要素, 字段名称="YDXZ_N", 表达式="!地类编号!", 字段类型="字符串")

        # Process: 添加字段 (24) (添加字段) (management)
        输出要素 = bxarcpy.数据管理.字段添加(输入要素=输出要素, 字段名称="YDXZ", 字段类型="字符串", 字段长度=50, 字段别称="用地性质代码")

        # Process: 添加连接 (添加连接) (management)
        输出要素 = bxarcpy.数据管理.连接创建(输入要素=输出要素, 输入要素连接字段="YDXZ_N", 连接要素=地类转换路径, 连接要素连接字段="新地类编号")

        # Process: 计算字段 (14) (计算字段) (management)
        输出要素 = bxarcpy.数据管理.字段计算(输入要素=输出要素, 字段名称="YDXZ", 表达式="!Sheet1$.旧地类编号!", 字段类型="字符串")

        # Process: 移除连接 (移除连接) (management)
        bxarcpy.数据管理.连接取消(输入要素=输出要素, 连接要素=地类转换路径)

        # Process: 添加字段 (6) (添加字段) (management)
        输出要素 = bxarcpy.数据管理.字段添加(输入要素=输出要素, 字段名称="ZYDXZ_N", 字段类型="字符串", 字段长度=10, 字段别称="主用地性质代码_新地类")

        # Process: 计算字段 (6) (计算字段) (management)
        输出要素 = bxarcpy.数据管理.字段计算(输入要素=输出要素, 字段名称="ZYDXZ_N", 表达式='!地类编号!.split("(")[0].split("/")[0]', 字段类型="字符串")

        # Process: 添加字段 (25) (添加字段) (management)
        输出要素 = bxarcpy.数据管理.字段添加(输入要素=输出要素, 字段名称="ZYDXZ", 字段类型="字符串", 字段长度=10, 字段别称="主用地性质代码")

        # Process: 添加连接 (添加连接) (management)
        输出要素 = bxarcpy.数据管理.连接创建(输入要素=输出要素, 输入要素连接字段="ZYDXZ_N", 连接要素=地类转换路径, 连接要素连接字段="新地类编号")

        # Process: 计算字段 (14) (计算字段) (management)
        输出要素 = bxarcpy.数据管理.字段计算(输入要素=输出要素, 字段名称="ZYDXZ", 表达式="!Sheet1$.旧地类编号!", 字段类型="字符串")

        # Process: 移除连接 (移除连接) (management)
        bxarcpy.数据管理.连接取消(输入要素=输出要素, 连接要素=地类转换路径)

        # Process: 添加字段 (26) (添加字段) (management)
        输出要素 = bxarcpy.数据管理.字段添加(输入要素=输出要素, 字段名称="TDLX", 字段类型="字符串", 字段长度=255, 字段别称="土地类型")

        # Process: 添加连接 (3) (添加连接) (management)
        输出要素 = bxarcpy.数据管理.连接创建(输入要素=输出要素, 输入要素连接字段="YDXZ_N", 连接要素=地类转换路径, 连接要素连接字段="新地类编号")

        # Process: 计算字段 (16) (计算字段) (management)
        输出要素 = bxarcpy.数据管理.字段计算(输入要素=输出要素, 字段名称="TDLX", 表达式="!Sheet1$.地类大类!", 字段类型="字符串")

        # Process: 移除连接 (3) (移除连接) (management)
        bxarcpy.数据管理.连接取消(输入要素=输出要素, 连接要素=地类转换路径)


def 入库_控制线(工作空间=r"C:\Users\common\project\J江东区临江控规\临江控规_数据库.gdb", 单元名称="临江单元", 批复时间="", 批复文号="", 道路中线要素名称="DL_道路中线", 道路边线要素名称="DL_道路边线", 高架桥要素名称="GZW_高架桥", 高架桥中心线要素名称="GZW_高架桥中心线", 隧道要素名称=None, 隧道中心线要素名称=None, 河道边线要素名称="DL_河道边线", 河道中线要素名称="DL_河道中线", 地块要素名称="DIST_用地规划图", 铁路线要素名称="GZW_铁路线", 输油管要素名称=None, 高压线要素名称="GZW_高压线", 天然气要素名称="GZW_天然气", 虚位控制河道要素名称="GZW_虚位控制河道", 虚位控制道路要素名称="GZW_虚位控制道路", 绿化控制线要素名称="GZW_绿化控制线"):
    with bxarcpy.环境.环境管理器(临时工作空间=工作空间, 工作空间=工作空间):
        bxarcpy.配置.是否覆盖输出要素 = True
        控制线要素 = bxarcpy.要素类.要素读取_通过名称("XG_KZX")
        控制线要素 = 控制线要素.要素创建_通过复制()
        # 控制线要素 = bxarcpy.要素类.要素创建_通过名称("XG_KZX", "线", 数据库路径=工作空间)
        # 控制线要素 = 控制线要素.要素创建_通过复制()

        控制线要素.字段添加("DYMC", "字符串", 50, "规划编制单元名称").字段计算("DYMC", f"'{单元名称}'")
        控制线要素.字段添加("PFSJ", "日期", None, "批复时间").字段计算("PFSJ", f"'{批复时间}'")
        控制线要素.字段添加("PFWH", "字符串", 50, "批复文号").字段计算("PFWH", f"'{批复文号}'")
        控制线要素.字段添加("LXDM", "字符串", 20, "控制线类型代码")
        控制线要素.字段添加("LXMC", "字符串", 50, "控制线类型名称")
        控制线要素.字段添加("MC", "字符串", 50, "对象名称")

        with bxarcpy.游标类.游标创建_通过名称("插入", 控制线要素.名称, ["_形状", "LXDM", "LXMC", "MC"]) as 游标1:
            道路中线要素 = bxarcpy.要素类.要素读取_通过名称(道路中线要素名称)
            with bxarcpy.游标类.游标创建_通过名称("查询", 道路中线要素.名称, ["_形状", "道路名称", "道路等级"]) as 游标2:
                for x in 游标2:
                    y = {}
                    if x["道路等级"] in ["城市快速路"]:
                        y["LXDM"] = "DLZX-KS"
                        y["LXMC"] = "道路中心线-快速路"
                    elif x["道路等级"] in ["一级城市主干路", "普通城市主干路", "城市主干路"]:
                        y["LXDM"] = "DLZX-ZG"
                        y["LXMC"] = "道路中心线-主干路"
                    elif x["道路等级"] in ["城市次干路"]:
                        y["LXDM"] = "DLZX-CG"
                        y["LXMC"] = "道路中心线-次干路"
                    elif x["道路等级"] in ["城市支路"]:
                        y["LXDM"] = "DLZX-ZL"
                        y["LXMC"] = "道路中心线-支路"
                    else:
                        print("未识别到对应的道路等级")
                    y["MC"] = x["道路名称"]
                    y["_形状"] = x["_形状"]
                    游标1.行插入(y)

            道路边线要素 = bxarcpy.要素类.要素读取_通过名称(道路边线要素名称)
            with bxarcpy.游标类.游标创建_通过名称("查询", 道路边线要素.名称, ["_形状", "道路名称", "道路等级"]) as 游标2:
                for x in 游标2:
                    y = {}
                    if x["道路等级"] in ["城市快速路"]:
                        y["LXDM"] = "DLBX-KS"
                        y["LXMC"] = "道路边线-快速路"
                    elif x["道路等级"] in ["一级城市主干路", "普通城市主干路", "城市主干路"]:
                        y["LXDM"] = "DLBX-ZG"
                        y["LXMC"] = "道路边线-主干路"
                    elif x["道路等级"] in ["城市次干路"]:
                        y["LXDM"] = "DLBX-CG"
                        y["LXMC"] = "道路边线-次干路"
                    elif x["道路等级"] in ["城市支路"]:
                        y["LXDM"] = "DLBX-ZL"
                        y["LXMC"] = "道路边线-支路"
                    else:
                        print("未识别到对应的道路等级")
                    y["MC"] = x["道路名称"]
                    y["_形状"] = x["_形状"]
                    游标1.行插入(y)

            if 高架桥要素名称:
                高架桥要素 = bxarcpy.要素类.要素读取_通过名称(高架桥要素名称)
                高架桥中心线要素 = bxarcpy.要素类.要素读取_通过名称(高架桥中心线要素名称)
                with bxarcpy.游标类.游标创建_通过名称("查询", 高架桥要素.名称, ["_形状", "道路名称"]) as 游标2:
                    for x in 游标2:
                        y = {}
                        y["LXDM"] = "DLBX-GJ"
                        y["LXMC"] = "道路边线-高架"
                        y["MC"] = x["道路名称"]
                        y["_形状"] = x["_形状"]
                        游标1.行插入(y)
                with bxarcpy.游标类.游标创建_通过名称("查询", 高架桥中心线要素.名称, ["_形状", "道路名称"]) as 游标2:
                    for x in 游标2:
                        y = {}
                        y["LXDM"] = "DLZX-GJ"
                        y["LXMC"] = "道路中心线-高架"
                        y["MC"] = x["道路名称"]
                        y["_形状"] = x["_形状"]
                        游标1.行插入(y)

            if 隧道要素名称:
                隧道要素 = bxarcpy.要素类.要素读取_通过名称(隧道要素名称)
                隧道中心线要素 = bxarcpy.要素类.要素读取_通过名称(隧道中心线要素名称)
                with bxarcpy.游标类.游标创建_通过名称("查询", 隧道要素.名称, ["_形状", "道路名称"]) as 游标2:
                    for x in 游标2:
                        y = {}
                        y["LXDM"] = "DLBX-SD"
                        y["LXMC"] = "道路边线-隧道"
                        y["MC"] = x["道路名称"]
                        y["_形状"] = x["_形状"]
                        游标1.行插入(y)
                with bxarcpy.游标类.游标创建_通过名称("查询", 隧道中心线要素.名称, ["_形状", "道路名称"]) as 游标2:
                    for x in 游标2:
                        y = {}
                        y["LXDM"] = "DLZX-SD"
                        y["LXMC"] = "道路中心线-隧道"
                        y["MC"] = x["道路名称"]
                        y["_形状"] = x["_形状"]
                        游标1.行插入(y)

            if 河道中线要素名称:
                河道中线要素 = bxarcpy.要素类.要素读取_通过名称(河道中线要素名称)
                with bxarcpy.游标类.游标创建_通过名称("查询", 河道中线要素.名称, ["_形状", "河道名称"]) as 游标2:
                    for x in 游标2:
                        y = {}
                        y["LXDM"] = "HDZX"
                        y["LXMC"] = "河道中心线"
                        y["MC"] = x["河道名称"]
                        y["_形状"] = x["_形状"]
                        游标1.行插入(y)

                河道边线要素 = bxarcpy.要素类.要素读取_通过名称(河道边线要素名称)
                with bxarcpy.游标类.游标创建_通过名称("查询", 河道边线要素.名称, ["_形状", "河道名称"]) as 游标2:
                    for x in 游标2:
                        y = {}
                        y["LXDM"] = "HDBX"
                        y["LXMC"] = "河道边线"
                        y["MC"] = x["河道名称"]
                        y["_形状"] = x["_形状"]
                        游标1.行插入(y)

            地块要素 = bxarcpy.要素类.要素读取_通过名称(地块要素名称)
            地块要素 = 地块要素.要素创建_通过面转线(是否识别并存储面邻域信息=False)
            with bxarcpy.游标类.游标创建_通过名称("查询", 地块要素.名称, ["_形状", "地类编号"]) as 游标2:
                from bxpy import bxstr

                for x in 游标2:
                    y = {}
                    if bxstr(x["地类编号"]).匹配正则(r".*(1401|1402).*"):
                        y["LXDM"] = "LHX"
                        y["LXMC"] = "绿化线"
                        y["MC"] = ""
                        y["_形状"] = x["_形状"]
                        游标1.行插入(y)

            if 铁路线要素名称:
                铁路线要素 = bxarcpy.要素类.要素读取_通过名称(铁路线要素名称)
                with bxarcpy.游标类.游标创建_通过名称("查询", 铁路线要素.名称, ["_形状", "铁路名称"]) as 游标2:
                    for x in 游标2:
                        y = {}
                        y["LXDM"] = "TL"
                        y["LXMC"] = "铁路"
                        y["MC"] = x["铁路名称"]
                        y["_形状"] = x["_形状"]
                        游标1.行插入(y)

            if 输油管要素名称:
                输油管要素 = bxarcpy.要素类.要素读取_通过名称(输油管要素名称)
                with bxarcpy.游标类.游标创建_通过名称("查询", 输油管要素.名称, ["_形状", "备注"]) as 游标2:
                    for x in 游标2:
                        y = {}
                        y["LXDM"] = "SYG"
                        y["LXMC"] = "输油管"
                        y["MC"] = x["备注"]
                        y["_形状"] = x["_形状"]
                        游标1.行插入(y)

            if 高压线要素名称:
                高压线要素 = bxarcpy.要素类.要素读取_通过名称(高压线要素名称)
                with bxarcpy.游标类.游标创建_通过名称("查询", 高压线要素.名称, ["_形状", "电压等级", "备注"]) as 游标2:
                    for x in 游标2:
                        y = {}
                        y["LXDM"] = "GYX"
                        y["LXMC"] = "高压线"
                        y["MC"] = x["备注"] + x["电压等级"]
                        y["_形状"] = x["_形状"]
                        游标1.行插入(y)

            if 天然气要素名称:
                天然气要素 = bxarcpy.要素类.要素读取_通过名称(天然气要素名称)
                with bxarcpy.游标类.游标创建_通过名称("查询", 天然气要素.名称, ["_形状", "备注"]) as 游标2:
                    for x in 游标2:
                        y = {}
                        y["LXDM"] = "GYX"
                        y["LXMC"] = "高压线"
                        y["MC"] = x["备注"]
                        y["_形状"] = x["_形状"]
                        游标1.行插入(y)

            if 虚位控制河道要素名称:
                虚位控制河道要素 = bxarcpy.要素类.要素读取_通过名称(虚位控制河道要素名称)
                with bxarcpy.游标类.游标创建_通过名称("查询", 虚位控制河道要素.名称, ["_形状"]) as 游标2:
                    for x in 游标2:
                        y = {}
                        y["LXDM"] = "XWKZHD"
                        y["LXMC"] = "虚位控制河道"
                        y["MC"] = ""
                        y["_形状"] = x["_形状"]
                        游标1.行插入(y)

            if 绿化控制线要素名称:
                绿化控制线要素 = bxarcpy.要素类.要素读取_通过名称(绿化控制线要素名称)
                with bxarcpy.游标类.游标创建_通过名称("查询", 绿化控制线要素.名称, ["_形状"]) as 游标2:
                    for x in 游标2:
                        y = {}
                        y["LXDM"] = "KZLHX"
                        y["LXMC"] = "控制绿化线"
                        y["MC"] = ""
                        y["_形状"] = x["_形状"]
                        游标1.行插入(y)

            if 虚位控制道路要素名称:
                虚位控制道路要素 = bxarcpy.要素类.要素读取_通过名称(虚位控制道路要素名称)
                with bxarcpy.游标类.游标创建_通过名称("查询", 虚位控制道路要素.名称, ["_形状"]) as 游标2:
                    for x in 游标2:
                        y = {}
                        y["LXDM"] = "XWKZDL"
                        y["LXMC"] = "虚位控制道路"
                        y["MC"] = ""
                        y["_形状"] = x["_形状"]
                        游标1.行插入(y)

        控制线要素.字段删除(保留字段名称列表=["DYMC", "PFSJ", "PFWH", "LXDM", "LXMC", "MC"])
        控制线要素.要素创建_通过复制并重命名重名要素("XG_KZX")


def 入库_设施(工作空间=r"C:\Users\common\project\J江东区临江控规\临江控规_数据库.gdb", 设施要素名称="SS_配套设施", 单元名称="临江单元", 批复时间="", 批复文号=""):
    with bxarcpy.类.环境.环境管理器(临时工作空间=工作空间, 工作空间=工作空间):
        bxarcpy.类.配置.是否覆盖输出要素 = True

        设施要素 = bxarcpy.要素类.要素读取_通过名称(设施要素名称)
        设施要素 = 设施要素.要素创建_通过复制()

        设施要素 = 设施要素.要素创建_通过复制并重命名重名要素("XG_PTSS")
        设施要素.字段添加("DYMC", "字符串", 50, "规划编制单元名称").字段计算("DYMC", f"'{单元名称}'")
        设施要素.字段添加("PFSJ", "日期", None, "批复时间").字段计算("PFSJ", f"'{批复时间}'")
        设施要素.字段添加("PFWH", "字符串", 50, "批复文号").字段计算("PFWH", f"'{批复文号}'")
        设施要素.字段添加("SSDM", "字符串", 10, "配套设施代码").字段计算("SSDM", "!设施代码!")
        设施要素.字段添加("SSMC", "字符串", 50, "配套设施名称").字段计算("SSMC", "!设施名称!")
        设施要素.字段添加("DKBH", "字符串", 50, "地块编号").字段计算("DKBH", "!设施所在地块编号!")
        设施要素.字段添加("WZJD", "字符串", 10, "位置精确度").字段计算("WZJD", "'地块级'")
        设施要素.字段添加("YQYL", "字符串", 2, "远期预留").字段计算("YQYL", "!远期预留!")
        设施要素.字段添加("BZ", "字符串", 255, "备注").字段计算("BZ", "!备注说明!")

        设施要素.字段删除(保留字段名称列表=["DYMC", "PFSJ", "PFWH", "SSDM", "SSMC", "DKBH", "WZJD", "YQYL", "BZ"])


if __name__ == "__main__":
    # main(工作空间=r"C:\Users\common\project\J江东区临江控规\临江控规_数据库.gdb", 规划范围要素名称="JX_规划范围线", 单元编号="QT12", 单元名称="临江单元", 批复时间="", 批复文号="", 编制单位="浙江大学建筑设计研究院有限公司", 单元功能="以打造中国先进制造业的重要窗口为使命，以新材料产业为主导，生物医药和装备制造产业为特色，融高端智造、产业服务、现代物流于一体的一流示范产业园区。", 人口规模=3.18)
    入库_单元(工作空间=r"C:\Users\common\project\F富阳受降控规\受降北_数据库.gdb", 规划范围要素名称="JX_规划范围线", 单元编号="FY07", 单元名称="受降北单元", 批复时间="", 批复文号="", 编制单位="浙江大学建筑设计研究院有限公司", 单元功能="依托数字经济时代背景、银湖科技城产业平台、受降区位优势，打造以高品质生态居住区与创新产业联动平台为主导的“个性化、生态化、创新化”富阳未来宜居宜业新组团，“生态品质居住+创新智慧生产”的产城人融合活力新单元。", 人口规模=6.86)

    # main(工作空间=r"C:\Users\common\project\J江东区临江控规\临江控规_数据库.gdb", 区域要素名称="JX_工业片区范围线", 单元名称="临江单元", 地块要素名称="DIST_用地规划图", 设施要素名称="SS_配套设施")
    入库_工业片区(工作空间=r"C:\Users\common\project\F富阳受降控规\受降北_数据库.gdb", 区域要素名称="JX_工业片区范围线", 单元名称="受降北单元", 地块要素名称="DIST_用地规划图", 设施要素名称="SS_配套设施")

    # main(工作空间=r"C:\Users\common\project\J江东区临江控规\临江控规_数据库.gdb", 街区要素名称="JX_街区范围线", 单元名称="临江单元", 用地规划图要素名称="DIST_用地规划图", 层级="街区")
    # main(工作空间=r"C:\Users\common\project\J江东区临江控规\临江控规_数据库.gdb", 区域要素名称="JX_街坊范围线", 单元名称="临江单元", 层级="街坊", 输出要素名称="XG_JQJF_JF")
    入库_街区街坊(工作空间=r"C:\Users\common\project\F富阳受降控规\受降北_数据库.gdb", 区域要素名称="JX_街坊范围线", 单元名称="受降北单元", 层级="街坊", 输出要素名称="XG_JQJF_JF")

    入库_局调入库(工作空间=r"C:\Users\common\project\J江东区临江控规\临江控规_数据库.gdb", 输入要素="\\AA_规划工业用地")
    # import arcpy

    # bxarcpy.配置.设置当前工作空间(工作空间路径=r"C:\Users\common\project\J江东区临江控规\临江控规_数据库.gdb")

    # fcs = arcpy.ListFeatureClasses()
    # fcCount11 = len(fcs)
    # for fc11 in fcs:
    #     print(fc11)
    # print(fcCount11)

    # main(工作空间=r"C:\Users\common\project\J江东区临江控规\临江控规_数据库.gdb", 单元名称="临江单元", 批复时间="", 批复文号="", 道路中线要素名称="DL_道路中线", 道路边线要素名称="DL_道路边线", 高架桥要素名称="GZW_高架桥", 高架桥中心线要素名称="GZW_高架桥中心线", 隧道要素名称=None, 隧道中心线要素名称=None, 河道边线要素名称="DL_河道边线", 河道中线要素名称="DL_河道中线", 地块要素名称="DIST_用地规划图", 铁路线要素名称="GZW_铁路线", 输油管要素名称=None, 高压线要素名称="GZW_高压线", 天然气要素名称="GZW_天然气", 虚位控制河道要素名称="GZW_虚位控制河道", 虚位控制道路要素名称="GZW_虚位控制道路", 绿化控制线要素名称="GZW_绿化控制线")
    入库_控制线(工作空间=r"C:\Users\common\project\F富阳受降控规\受降北_数据库.gdb", 单元名称="受降北单元", 批复时间="", 批复文号="", 道路中线要素名称="DL_道路中线", 道路边线要素名称="DL_道路边线", 高架桥要素名称=None, 高架桥中心线要素名称=None, 隧道要素名称=None, 隧道中心线要素名称=None, 河道边线要素名称=None, 河道中线要素名称=None, 地块要素名称="DIST_用地规划图", 铁路线要素名称=None, 输油管要素名称=None, 高压线要素名称=None, 天然气要素名称=None, 虚位控制河道要素名称=None, 虚位控制道路要素名称=None, 绿化控制线要素名称=None)

    入库_设施(工作空间=r"C:\Users\common\project\J江东区临江控规\临江控规_数据库.gdb", 设施要素名称="SS_配套设施", 单元名称="临江单元", 批复时间="", 批复文号="")

    # main(工作空间=r"C:\Users\common\project\J江东区临江控规\临江控规_数据库.gdb", 地块要素名称="DIST_用地规划图", 单元名称="临江单元", 批复时间="", 批复文号="")
    入库_生成土地码(工作空间=r"C:\Users\common\project\F富阳受降控规\受降北_数据库.gdb", 地块要素名称="XG_GHDK")

    入库_用途分区(工作空间=r"C:\Users\common\project\J江东区临江控规\临江控规_数据库.gdb", 用途分区要素名称="DIST_用途分区图", 单元名称="临江单元", 批复时间="", 批复文号="")
