import bxarcpy
from bxpy import 日志


def 转换_导出到CAD(输入要素名称, 范围要素名称="JX_规划范围线", 需融合地类编号列表=None, 切分阈值=None, 输出CAD路径=r"C:\Users\beixiao\Desktop\01.dwg"):
    # {"折点数量": 1500, "孔洞数量": 3, "面积": 1500000}
    输入要素 = bxarcpy.要素类.要素读取_通过名称(输入要素名称).要素创建_通过复制()
    输入要素.字段删除(保留字段名称列表=["地类编号"])

    if 范围要素名称:
        裁剪后要素 = 输入要素.要素创建_通过裁剪(范围要素名称)
        日志.输出调试(f"裁剪要素成功")
    else:
        裁剪后要素 = 输入要素

    if 需融合地类编号列表:
        for x in 需融合地类编号列表:
            SQL语句 = f"地类编号 = '{x}'"
            日志.输出调试(f"SQL语句是：{SQL语句}")
            选择集 = 裁剪后要素.选择集创建_通过属性(SQL语句=SQL语句)
            融合后要素 = 选择集.要素创建_通过融合(融合字段列表=["地类编号"])
            裁剪后要素 = 裁剪后要素.要素创建_通过更新(融合后要素.名称)
        融合后要素 = 裁剪后要素
    else:
        融合后要素 = 裁剪后要素

    if 切分阈值:
        # {"折点数量": 1500, "孔洞数量": 3, "面积": 1500000}
        融合后要素.字段添加("是否切分")
        with bxarcpy.游标类.游标创建_通过名称("更新", 融合后要素.名称, ["_形状", "是否切分", "_ID"]) as 游标:
            for x in 游标:
                图形: "bxarcpy.游标类.形状类" = x["_形状"]
                # print(行.数据_列表格式[0])
                # print(type(行.数据_列表格式[0]))
                if 图形.孔洞数量 > 切分阈值["孔洞数量"] and 图形.折点数量 > 切分阈值["折点数量"] and 图形.面积 > 切分阈值["面积"]:
                    x["是否切分"] = "1"
                    游标.行更新(x)
                    日志.输出调试(f"ID：{str(x['_ID'])}，孔洞数量：{str(图形.孔洞数量)}, 折点数量：{str(图形.折点数量)}，面积：{str(图形.面积)}")
        选择集 = 融合后要素.选择集创建_通过属性(SQL语句=f"是否切分 = '1'")
        切分后要素 = 选择集.要素创建_通过切分()
        更新后要素 = 融合后要素.要素创建_通过更新(更新要素名称=切分后要素.名称)
    else:
        更新后要素 = 融合后要素

    转单部件后要素 = 更新后要素.要素创建_通过多部件至单部件().要素几何修复()

    转单部件后要素.字段添加("Layer").字段计算("Layer", "\"YDGIS-\" + !地类编号!.replace('/','／')")
    转单部件后要素.字段添加("地块性质").字段计算("地块性质", "!地类编号!.replace('／','/')")
    转单部件后要素.字段添加("实体类型").字段计算("实体类型", '"控规地块"')
    转单部件后要素.字段删除(["ORIG_FID", "地类编号", "是否切分"])

    转单部件后要素.导出到CAD(输出CAD路径)


if __name__ == "__main__":
    # 工作空间 = r"C:\Users\common\project\F富阳受降控规\受降北_数据库.gdb"
    工作空间 = r"C:\Users\common\project\J江东区临江控规\临江控规_数据库.gdb"
    with bxarcpy.环境.环境管理器(工作空间):
        转换_导出到CAD("DIST_用地规划图", 范围要素名称="JX_规划范围线", 需融合地类编号列表=None, 切分阈值=None, 输出CAD路径=r"C:\Users\beixiao\Desktop\01.dwg")
