import bxarcpy
from bxpy import 字


def 计算土地码(输入要素名称, 地籍要素名称="CZ_三调筛选_坐落单位名称", 输出要素名称="in_memory\\AA_计算土地码"):
    # 需要保证该编号的地块都已经编号
    if 输出要素名称 == "in_memory\\AA_计算土地码":
        输出要素名称 = 输出要素名称 + "_" + bxarcpy.工具集.生成短GUID()

    地块要素 = bxarcpy.要素类.要素读取_通过名称(输入要素名称).要素创建_通过复制()
    地籍要素 = bxarcpy.要素类.要素读取_通过名称(地籍要素名称).要素创建_通过复制()

    地块要素.字段添加("土地码")
    地籍要素.字段删除(保留字段名称列表=["坐落单位代码"])

    有地籍地块要素 = 地块要素.要素创建_通过空间连接(地籍要素.名称, "内点在连接要素内")

    需操作的字段名称列表 = ["地块编号", "地类编号", "土地码", "坐落单位代码"]
    with bxarcpy.游标类.游标创建_通过名称("更新", 有地籍地块要素.名称, 需操作的字段名称列表) as 游标_地块:
        for x in 游标_地块:
            地籍代码 = "H00000000"
            主地类编号 = "00000000"
            兼容性质数量 = 1
            街区编号 = "00"
            街坊编号 = "00"
            地块编号 = "000"

            # print(x["地块编号"])
            # print(len(x["地块编号"].split("-")))
            # print(x["地类编号"][0:2])

            if x["地块编号"] not in ["", " ", None] and len(x["地块编号"].split("-")) == 2 and x["地类编号"][0:2] not in ["01", "02", "03", "04", "05", "06", "17"]:
                地籍代码 = "H" + x["坐落单位代码"][4:12]
                主地类编号 = x["地类编号"].split("(")[0].split("/")[0].replace("v", "")
                兼容性质数量 = len(x["地类编号"].split("(")[0].split("/"))
                街区编号 = x["地块编号"][4:6]
                街坊编号 = x["地块编号"][6:8]
                地块编号 = 字.补零(x["地块编号"].split("-")[-1], 3)
                # print(地籍代码 + 主地类编号.ljust(8, "0") + f"X{兼容性质数量}" + 街区编号 + 街坊编号 + 地块编号 + "0")

                土地码 = 地籍代码 + 字.补零(主地类编号, 8, "后方") + f"X{兼容性质数量}" + 街区编号 + 街坊编号 + 地块编号 + "0"
                x["土地码"] = 土地码

            游标_地块.行更新(x)

    有地籍地块要素.字段删除(["坐落单位代码"]).要素创建_通过复制并重命名重名要素(输出要素名称)


if __name__ == "__main__":
    # 工作空间 = r"C:\Users\common\project\F富阳受降控规\受降北_数据库.gdb"
    工作空间 = r"C:\Users\common\project\J江东区临江控规\临江控规_数据库.gdb"
    with bxarcpy.环境.环境管理器(工作空间):
        计算土地码(输入要素名称="DIST_用地规划图_街坊街区_编号_耕保_构成", 输出要素名称="DIST_用地规划图_街坊街区_编号_耕保_构成_土地码")
