import bxarcpy
from typing import Literal


def 用地创建_通过计算所属区域(输入要素名称, 区域要素名称="JX_街区范围线", 字段映射列表=[["所属街区", "街区编号"]], 计算方式: Literal["分割输入要素", "按输入要素内点"] = "分割输入要素", 输出要素名称="in_memory\\AA_计算所属区域"):
    if 输出要素名称 == "in_memory\\AA_计算所属区域":
        输出要素名称 = 输出要素名称 + "_" + bxarcpy.工具集.生成短GUID()

    输入要素 = bxarcpy.要素类.要素读取_通过名称(输入要素名称).要素创建_通过复制()
    区域要素 = bxarcpy.要素类.要素读取_通过名称(区域要素名称).要素创建_通过复制()

    需要添加的字段列表 = [x[0] for x in 字段映射列表]
    for x in 需要添加的字段列表:
        输入要素.字段添加(x)

    if 计算方式 == "分割输入要素":
        赋值后要素 = 输入要素.要素创建_通过联合并赋值字段(区域要素.名称, 字段映射列表)

        输出要素 = 赋值后要素.要素创建_通过复制并重命名重名要素(输出要素名称, 重名要素后缀="计算所属区域前")

    elif 计算方式 == "按输入要素内点":
        区域要素保留字段列表 = [x[1] for x in 字段映射列表]
        区域要素.字段删除(保留字段名称列表=区域要素保留字段列表)

        赋值后要素 = 输入要素.要素创建_通过空间连接(区域要素.名称, "内点在连接要素内")
        for x in 字段映射列表:
            赋值后要素.字段计算(x[0], f"!{x[1]}!")

        赋值后要素.字段删除([x[1] for x in 字段映射列表])

        输出要素 = 赋值后要素.要素创建_通过复制并重命名重名要素(输出要素名称)

    return 输出要素


def 用地_根据所属街坊生成所属街区(输入要素名称, 所属街坊字段名称="所属街坊", 所属街区字段名称="所属街区", 输出要素名称="in_memory\\AA_根据所属街坊生成所属街区"):
    if 输出要素名称 == "in_memory\\AA_根据所属街坊生成所属街区":
        输出要素名称 = 输出要素名称 + "_" + bxarcpy.工具集.生成短GUID()

    输入要素 = bxarcpy.要素类.要素读取_通过名称(输入要素名称).要素创建_通过复制()
    输入要素.字段添加("所属街区")
    with bxarcpy.游标类.游标创建_通过名称("更新", 输入要素.名称, ["所属街坊", "所属街区"]) as 游标:
        for x in 游标:
            x["所属街区"] = x["所属街坊"][0:-2]
            游标.行更新(x)

    输出要素 = 输入要素.要素创建_通过复制并重命名重名要素(输出要素名称)
    return 输出要素


if __name__ == "__main__":
    # 工作空间 = r"C:\Users\common\project\F富阳受降控规\受降北_数据库.gdb"
    工作空间 = r"C:\Users\common\project\J江东区临江控规\临江控规_数据库.gdb"
    with bxarcpy.环境.环境管理器(工作空间):
        用地创建_通过计算所属区域("DIST_用地规划图", 区域要素名称="JX_街坊范围线", 字段映射列表=[["所属街坊", "区域编号"]], 计算方式="分割输入要素", 输出要素名称="DIST_用地规划图_街坊")
        用地_根据所属街坊生成所属街区("DIST_用地规划图_街坊", 输出要素名称="DIST_用地规划图_街坊街区")
