import bxarcpy


def 用地创建_通过计算两可用地(输入要素名称, 有种植属性的要素名称="CZ_三调筛选_种植属性名称", 输出要素名称="in_memory\\AA_计算两可用地"):
    if 输出要素名称 == "in_memory\\AA_计算两可用地":
        输出要素名称 = 输出要素名称 + "_" + bxarcpy.工具集.生成短GUID()
    用地要素 = bxarcpy.要素类.要素读取_通过名称(输入要素名称)
    用地要素.字段删除(["种植属性名称"])

    筛选后要素 = 用地要素.要素创建_通过筛选("地类编号 LIKE '02%' OR 地类编号 LIKE '03%' OR 地类编号 LIKE '04%' OR 地类编号 LIKE '1704%'")
    筛选后要素.字段删除(保留字段名称列表=["地类编号"])

    有种植属性并且是两可用地的要素 = 筛选后要素.要素创建_通过相交([有种植属性的要素名称])
    有种植属性并且是两可用地的要素.字段删除(保留字段名称列表=["种植属性名称"])

    更新两可后的用地要素 = 用地要素.要素创建_通过联合([有种植属性并且是两可用地的要素.名称])

    更新两可后的用地要素.字段删除(["Shape_Length_1", "Shape_Area_1"])

    输出要素 = 更新两可后的用地要素.要素创建_通过复制并重命名重名要素(输出要素名称)
    return 输出要素


if __name__ == "__main__":
    # 工作空间 = r"C:\Users\common\project\F富阳受降控规\受降北_数据库.gdb"
    工作空间 = r"C:\Users\common\project\J江东区临江控规\临江控规_数据库.gdb"
    with bxarcpy.环境.环境管理器(工作空间):
        用地创建_通过计算两可用地("DIST_用地规划图", 有种植属性的要素名称="CZ_三调筛选_种植属性名称", 输出要素名称="in_memory\\AA_计算两可用地")
