import bxarcpy


def 用地创建_生成用地调整图(调整前要素名称="DIST_用地现状图", 调整后要素名称="DIST_用地规划图", 输出要素名称="in_memory\\AA_用地调整图"):
    if 输出要素名称 == "in_memory\\AA_用地调整图":
        输出要素名称 = 输出要素名称 + "_" + bxarcpy.工具集.生成短GUID()

    调整前要素 = bxarcpy.要素类.要素读取_通过名称(调整前要素名称).要素创建_通过复制()
    调整后要素 = bxarcpy.要素类.要素读取_通过名称(调整后要素名称).要素创建_通过复制()
    联合后要素 = 调整前要素.要素创建_通过联合([调整后要素.名称])
    联合后要素.字段修改("地类编号", "地类编号_现状").字段修改("地类编号_1", "地类编号_规划").字段添加("调整类型").字段添加("地类差异")
    with bxarcpy.游标类.游标创建_通过名称("更新", 联合后要素.名称, ["地类编号_现状", "地类编号_规划", "地类差异", "调整类型", "所属三区三线", "开发动态"]) as 游标:
        for x in 游标:
            if x["地类编号_现状"] != x["地类编号_规划"]:
                x["地类差异"] = f'{x["地类编号_现状"]} -> {x["地类编号_规划"]}'
            游标.行更新(x)
    输出要素 = 联合后要素.要素创建_通过复制并重命名重名要素(输出要素名称)
    return 输出要素


if __name__ == "__main__":
    # 工作空间 = r"C:\Users\common\project\F富阳受降控规\受降北_数据库.gdb"
    工作空间 = r"C:\Users\common\project\J江东区临江控规\临江控规_数据库.gdb"
    with bxarcpy.环境.环境管理器(工作空间):
        用地创建_生成用地调整图(调整前要素名称="DIST_用地现状图", 调整后要素名称="DIST_用地规划图", 输出要素名称="in_memory\\AA_用地调整图")
