# -*- coding: utf-8 -*-

import bxarcpy
from bxpy import 时间

# from sys import argv


def main(
    工作空间="C:\\Users\\common\\project\\J江东区临江控规\\临江控规_数据库.gdb",
    输出要素名称="DIST_用地规划图",
    SQL_CAD地块中空隙的地类="'00'",
    SQL_以CAD为准的地类="地类编号 LIKE '060102%' OR 地类编号 LIKE '07%' OR 地类编号 LIKE '08%' OR 地类编号 LIKE '09%' OR 地类编号 LIKE '10%' OR 地类编号 LIKE '11%'  OR 地类编号 LIKE '12%'  OR 地类编号 LIKE '13%'  OR 地类编号 LIKE '14%'  OR 地类编号 LIKE '15%'  OR 地类编号 LIKE '16%'  OR ( 地类编号 LIKE '17%' AND 地类编号 NOT LIKE '1704%' AND 地类编号 NOT LIKE '1705%' )  OR 地类编号 LIKE '23%'",
    范围要素名称="JX_规划范围线",
    CAD导出色块要素名称="YD_CAD色块",
    GIS中更改以CAD为准地类色块的要素名称="YD_CAD色块以外建设用地修改",
    需合并的要素名称列表=["YD_基期细化", "YD_农转用20年及以前", "YD_现状修改1", "YD_农转用21年及以后", "YD_审批信息已实施", "YD_地籍信息", "YD_现状修改2", "YD_审批信息已批未建", "YD_上位_粮食生产功能区", "YD_上位农用地落实_耕地质量提升", "YD_上位农用地落实_旱改水", "YD_上位农用地落实_垦造耕地", "YD_上位农用地落实_新增设施农用地", "YD_上位基本农田落实", "YD_GIS方案_农用地设计", "YD_CAD色块"],
    是否拓扑检查=True,
    是否范围检查=False,
):
    # 用地_生成用地规划图
    with bxarcpy.环境.环境管理器(临时工作空间=工作空间, 工作空间=工作空间):
        bxarcpy.配置.是否覆盖输出要素 = True

        CAD色块要素 = bxarcpy.要素类.要素读取_通过名称(CAD导出色块要素名称)
        填充空隙后要素 = CAD色块要素.要素创建_通过填充空隙(范围要素名称, SQL_CAD地块中空隙的地类)
        # 填充空隙后要素 = bxarcpy.分析.填充空隙(YD_CAD色块, JX_规划范围线, SQL_CAD地块中空隙的地类)

        YD_CAD色块_仅包含CAD中为准的色块 = 填充空隙后要素.要素创建_通过筛选(SQL_以CAD为准的地类)
        # YD_CAD色块_仅包含CAD中为准的色块 = bxarcpy.分析.筛选(输入要素=填充空隙后要素, SQL语句=SQL_以CAD为准的地类)

        # Process: 常用_合并用地图层 (常用_合并用地图层) ()
        底层要素 = bxarcpy.要素类.要素读取_通过名称(需合并的要素名称列表[0]).字段删除(保留字段名称列表=["地类编号"])
        for x in 需合并的要素名称列表[1:]:
            底层要素 = 底层要素.要素创建_通过更新并合并字段(x).字段删除(保留字段名称列表=["地类编号"])
            # 底层要素 = bxarcpy.分析.更新并合并字段(输入要素=底层要素, 更新要素=x)
            # time.sleep(1.0)
            时间.等待(1)
            print(f"完成了 {x} 的合并")

        DIST_用地规划图1 = 底层要素.要素创建_通过更新并合并字段(YD_CAD色块_仅包含CAD中为准的色块.名称)
        # DIST_用地规划图1 = bxarcpy.分析.更新并合并字段(输入要素=底层要素, 更新要素=YD_CAD色块_仅包含CAD中为准的色块, 输出要素=DIST_用地规划图)

        # 删除字段 = ["dkbmgk", "地块性", "单元名", "TBYBH", "FID_DLTB", "GKXZ", "Layer", "CZCSXM", "三调地类名称", "三调地类编号", "ORIG_FID", "a", "镇街名称", "名称", "FID_4去除", "Shape_Leng", "三调稳", "二调永", "三调恢", "三调耕", "二调耕", "街道", "村名称", "组名", "序号", "FID_规划范围线_2303070850", "FWDGDHRLY", "SFWYYJJBNT", "WDGD", "BZ", "ZRSYX", "SJMC", "SJBH", "BHJSSJ", "BHKSSJ", "JZDZ", "LXDH", "ZRRMC", "ZRRZJHM", "ZZRR", "ZMC", "CFZR", "SJNF", "FRDBS", "ZLFLDM", "GDDJ", "GDDB", "ZZSXMC", "ZZSXDM", "TBXHMC", "TBXHDM", "GGBZL", "GDPDJB", "GDLX", "YJJBNTMJ", "KCMJ", "KCXS", "KCDLBM", "YJJBNTTBMJ", "ZLDWMC", "ZLDWDM", "QSDWMC", "QSDWDM", "QSXZ", "DLMC", "DLBM", "TBBH", "YJJBNTTBBH", "XZQMC", "XZQDM", "YSDM", "BSM", "FID_YJJBNTBHTB", "mj", "RefName", "LineWt", "Elevation", "Linetype", "Color", "Entity", "地块性质", "实体类型", "基数转换关系", "用途管制分区", "综合耕地N", "面积", "处理方向", "综合净面积"]
        # DIST_用地规划图1.字段删除(删除字段)
        # DIST_用地规划图1 = bxarcpy.数据管理.字段删除(输入要素=DIST_用地规划图1, 删除字段列表=删除字段)

        # Process: 常用-擦除 (常用_擦除) ()
        非CAD中的色块 = DIST_用地规划图1.要素创建_通过擦除并几何修复(YD_CAD色块_仅包含CAD中为准的色块.名称)
        # 非CAD中的色块 = bxarcpy.分析.擦除并几何修复(输入要素=DIST_用地规划图1, 擦除要素=YD_CAD色块_仅包含CAD中为准的色块)

        # Process: 筛选 (2) (选择) (analysis)
        筛选后非CAD中的色块 = 非CAD中的色块.要素创建_通过筛选(SQL_以CAD为准的地类)
        # 筛选后非CAD中的色块.要素创建_通过复制并重命名重名要素("AA_应在CAD中填色实际没填色")
        # AA_应在CAD中填色实际没填色 = bxarcpy.分析.筛选(输入要素=非CAD中的色块, SQL语句=SQL_以CAD为准的地类, 输出要素=AA_应在CAD中填色实际没填色)

        现有的CAD色块外建设用地修改元素 = bxarcpy.类.要素类.要素读取_通过名称(GIS中更改以CAD为准地类色块的要素名称)

        # 还没有改成非建设用地的元素 = 筛选后非CAD中的色块.要素创建_通过擦除(YD_CAD色块以外建设用地修改)
        # 还没有改成非建设用地的元素.要素创建_通过复制并重命名重名要素("AA_应改成非建设用地但没改")

        相交后元素 = 现有的CAD色块外建设用地修改元素.要素创建_通过相交([筛选后非CAD中的色块.名称]).字段删除(保留字段名称列表=["地类编号"])

        更新后要素 = 筛选后非CAD中的色块.要素创建_通过更新并合并字段(相交后元素.名称).字段删除(保留字段名称列表=["地类编号"])
        更新后要素.要素创建_通过复制并重命名重名要素(GIS中更改以CAD为准地类色块的要素名称)

        DIST_用地规划图1 = DIST_用地规划图1.要素创建_通过更新并合并字段(GIS中更改以CAD为准地类色块的要素名称)
        DIST_用地规划图1.要素创建_通过多部件至单部件().要素几何修复().要素创建_通过复制并重命名重名要素(输出要素名称).字段删除(["综合耕地N", "处理方向", "综合净面积", "综合耕地N_1", "处理方向_1", "综合净面积_1", "ORIG_FID"])
        if 是否拓扑检查:
            import 拓扑_创建重叠检查拓扑

            需要拓扑的要素名称列表 = [x for x in 需合并的要素名称列表]
            需要拓扑的要素名称列表.append(GIS中更改以CAD为准地类色块的要素名称)
            需要拓扑的要素名称列表.append(CAD导出色块要素名称)
            需要拓扑的要素名称列表.append(输出要素名称)
            拓扑_创建重叠检查拓扑.main(工作空间=工作空间, 输入要素名称列表=需要拓扑的要素名称列表, 输出CAD路径=r"C:\Users\beixiao\Desktop\拓扑检查.dwg")
        if 是否范围检查:
            范围要素 = bxarcpy.要素类.要素读取_通过名称(范围要素名称)
            已填色要素 = bxarcpy.要素类.要素读取_通过名称(输出要素名称)
            范围要素.要素创建_通过擦除并几何修复(已填色要素.名称).要素创建_通过多部件至单部件().要素创建_通过复制并重命名重名要素("AA_需要填但是没填的区域")
            已填色要素.要素创建_通过擦除并几何修复(范围要素.名称).要素创建_通过多部件至单部件().要素创建_通过复制并重命名重名要素("AA_不需要填但是被填的区域")


if __name__ == "__main__":
    # Global Environment settings
    # AB1132(*argv[1:])
    main(
        工作空间="C:\\Users\\common\\project\\J江东区临江控规\\临江控规_数据库.gdb",
        范围要素名称="JX_规划范围线",
        输出要素名称="DIST_用地规划图",
        CAD导出色块要素名称="YD_CAD色块",
        GIS中更改以CAD为准地类色块的要素名称="YD_CAD色块以外建设用地修改",
        SQL_CAD地块中空隙的地类="'00'",
        SQL_以CAD为准的地类="地类编号 LIKE '060102%' OR 地类编号 LIKE '07%' OR 地类编号 LIKE '08%' OR 地类编号 LIKE '09%' OR 地类编号 LIKE '10%' OR 地类编号 LIKE '11%'  OR 地类编号 LIKE '12%'  OR 地类编号 LIKE '13%'  OR 地类编号 LIKE '14%'  OR 地类编号 LIKE '15%'  OR 地类编号 LIKE '16%'  OR ( 地类编号 LIKE '17%' AND 地类编号 NOT LIKE '1704%' AND 地类编号 NOT LIKE '1705%' )  OR 地类编号 LIKE '23%'",
        需合并的要素名称列表=["YD_基期细化", "YD_农转用20年及以前", "YD_现状修改1", "YD_农转用21年及以后", "YD_审批信息已实施", "YD_地籍信息", "YD_现状修改2", "YD_审批信息已批未建", "YD_上位_粮食生产功能区", "YD_上位农用地落实_耕地质量提升", "YD_上位农用地落实_旱改水", "YD_上位农用地落实_垦造耕地", "YD_上位农用地落实_新增设施农用地", "YD_上位基本农田落实", "YD_GIS方案_农用地设计"],
        是否拓扑检查=False,
        是否范围检查=True,
    )
