import bxarcpy


def 设施_清理规划范围外设施(输入要素名称):
    设施要素 = bxarcpy.要素类.要素读取_通过名称(输入要素名称).要素创建_通过复制()

    需操作的字段名称列表 = ["设施所在街坊"]
    with bxarcpy.游标类.游标创建_通过名称("更新", 设施要素.名称, 需操作的字段名称列表) as 游标:
        for x in 游标:
            if x["设施所在街坊"] in ["", " ", None]:
                游标.行删除()
    设施要素 = 设施要素.要素创建_通过复制并重命名重名要素(输入要素名称)
    return 设施要素


if __name__ == "__main__":
    # 工作空间 = r"C:\Users\common\project\F富阳受降控规\受降北_数据库.gdb"
    工作空间 = r"C:\Users\common\project\J江东区临江控规\临江控规_数据库.gdb"
    with bxarcpy.环境.环境管理器(工作空间):
        设施_清理规划范围外设施("SS_配套设施")
