import bxarcpy
from 设施_设施更新_计算所属区域 import 设施_计算所属区域


def 设施_计算远期预留(输入要素名称, 区域要素名称="CZ_控制线_三线_城镇开发边界", 字段映射列表=[["设施所在用途分区", "GHFQMC"]]):
    设施要素 = bxarcpy.要素类.要素读取_通过名称(输入要素名称).要素创建_通过复制()
    设施要素 = 设施_计算所属区域(设施要素.名称_无路径, 区域要素名称, 字段映射列表)
    设施要素.字段添加("远期预留")

    需操作的字段名称列表 = ["远期预留", "设施所在用途分区", "开发动态"]
    with bxarcpy.游标类.游标创建_通过名称("更新", 设施要素.名称, 需操作的字段名称列表) as 游标:
        for x in 游标:
            if x["设施所在用途分区"] in ["", " ", None] and x["开发动态"] not in ["现状", "现状已实施", "现状保留"]:
                x["远期预留"] = "是"
            else:
                x["远期预留"] = "否"
            游标.行更新(x)

    设施要素 = 设施要素.要素创建_通过复制并重命名重名要素(输入要素名称)
    return 设施要素


if __name__ == "__main__":
    # 工作空间 = r"C:\Users\common\project\F富阳受降控规\受降北_数据库.gdb"
    工作空间 = r"C:\Users\common\project\J江东区临江控规\临江控规_数据库.gdb"
    with bxarcpy.环境.环境管理器(工作空间):
        设施_计算远期预留("SS_配套设施", 区域要素名称="CZ_控制线_三线_城镇开发边界", 字段映射列表=[["设施所在用途分区", "GHFQMC"]])
