# -*- coding: utf-8 -*-

# import arcpy
# from sys import argv
import bxarcpy.工具包 as 工具包
from bxarcpy.环境包 import 环境管理器类
from bxarcpy.要素包 import 要素类
from bxarcpy.游标包 import 游标类
from bxarcpy.几何包 import 几何类


def 河道边线生成(河道中线要素名称="DL_河道中线", 用地要素名称="DIST_用地规划图", 规划范围线要素名称="JX_规划范围线", 输出要素名称="内存临时"):
    if 输出要素名称 == "内存临时":
        输出要素名称 = "in_memory\\AA_河道边线" + "_" + 工具包.生成短GUID()
    河道中线要素_复制后 = 要素类.要素创建_通过复制(河道中线要素名称)
    要素类.字段添加(河道中线要素_复制后, "河道半宽", "单精度")
    with 游标类.游标创建("更新", 河道中线要素_复制后, ["河道宽度", "河道半宽"]) as 游标:
        for x in 游标类.游标迭代器转换_字典形式(游标, ["河道宽度", "河道半宽"]):
            河道宽度 = x["河道宽度"].split("-")[-1]
            x["河道半宽"] = float(河道宽度) * 0.7
            游标类.行更新_字典形式(游标, x)

    河道中线缓冲要素 = 要素类.要素创建_通过缓冲(河道中线要素_复制后, "河道半宽", 融合类型="融合按字段", 融合字段名称列表=["河道名称"], 末端类型="方形")
    要素类.字段删除(河道中线要素_复制后, ["河道半宽"])
    要素类.字段删除(河道中线缓冲要素, ["河道半宽"])

    with 游标类.游标创建("更新", 河道中线缓冲要素, ["_ID", "_形状", "河道名称"]) as 游标1:
        with 游标类.游标创建("查询", 河道中线缓冲要素, ["_ID", "_形状", "河道名称"]) as 游标2:
            # 游标1运行次数 = 0
            for x in 游标类.游标迭代器转换_字典形式(游标1, ["_ID", "_形状", "河道名称"]):
                # 游标1运行次数 += 1
                # 游标2运行次数 = 0
                for y in 游标类.游标迭代器转换_字典形式(游标2, ["_ID", "_形状", "河道名称"]):
                    # 游标2运行次数 += 1
                    # print(f"游标1次数{游标1运行次数}，游标2次数{游标2运行次数}")
                    # print(f"x：{x}")
                    # print(f"y：{y}")
                    if x["_ID"] != y["_ID"] and 几何类.集合_交集(x["_形状"], y["_形状"]):
                        # print(f'ID{x["OID@"]}和ID{y["OID@"]}有交集')
                        x["_形状"] = 几何类.集合_差集(x["_形状"], y["_形状"])
                        游标类.行更新_字典形式(游标1, x)
                游标类.重置(游标2)

    地块要素 = 要素类.要素创建_通过复制(用地要素名称)

    河道边线要素 = 要素类.要素创建_通过筛选(地块要素, "地类编号 LIKE '1701%'")
    河道边线要素 = 要素类.要素创建_通过融合(河道边线要素, ["地类编号"])
    河道边线要素 = 要素类.要素几何修复(河道边线要素)
    河道边线要素 = 要素类.要素创建_通过转线(河道边线要素)

    带有属性的河道边线要素 = 要素类.要素创建_通过相交([河道边线要素, 河道中线缓冲要素])
    带有属性的河道边线要素 = 要素类.要素创建_通过多部件至单部件(带有属性的河道边线要素)
    带有属性的河道边线要素 = 要素类.要素几何修复(带有属性的河道边线要素)

    还没有属性的河道边线要素 = 要素类.要素创建_通过擦除(河道边线要素, 河道中线缓冲要素)
    还没有属性的河道边线要素 = 要素类.要素创建_通过多部件至单部件(还没有属性的河道边线要素)
    还没有属性的河道边线要素 = 要素类.要素几何修复(还没有属性的河道边线要素)
    要素类.字段添加(还没有属性的河道边线要素, "河道名称")

    with 游标类.游标创建("更新", 还没有属性的河道边线要素.名称, ["_形状", "河道名称"]) as 游标1:
        with 游标类.游标创建("查询", 带有属性的河道边线要素.名称, ["_形状", "河道名称"]) as 游标2:
            for x in 游标类.游标迭代器转换_字典形式(游标1, ["_形状", "河道名称"]):
                for y in 游标类.游标迭代器转换_字典形式(游标2, ["_形状", "河道名称"]):
                    if 几何类.集合_交集(x["_形状"], y["_形状"], 类型="点"):
                        x["河道名称"] = y["河道名称"]
                        游标类.行更新_字典形式(游标1, x)
                游标类.重置(游标2)
    合并后要素 = 要素类.要素创建_通过合并([带有属性的河道边线要素, 还没有属性的河道边线要素])

    范围要素 = 规划范围线要素名称

    范围转线后要素 = 要素类.要素创建_通过转线(范围要素)

    合并后要素 = 要素类.要素创建_通过擦除(合并后要素, 范围转线后要素)

    要素类.字段删除(合并后要素, 保留字段名称列表=["河道名称"])
    输出要素 = 要素类.要素创建_通过复制并重命名重名要素(合并后要素, 输出要素名称)
    return 输出要素


if __name__ == "__main__":
    工作空间 = r"C:\Users\common\project\J江东区临江控规\临江控规_数据库.gdb"
    # 河道中线要素名称 = bxarcpy.环境.输入参数获取_以字符串形式(0, "DL_河道中线", True)
    with 环境管理器类.环境管理器类创建(工作空间):
        河道边线生成("DL_河道中线", "DIST_用地规划图", "JX_规划范围线", "DL_河道边线")
