# -*- coding: utf-8 -*-

# import arcpy
# from sys import argv
import bxarcpy


def 河道边线生成(河道中线要素名称="DL_河道中线", 用地要素名称="DIST_用地规划图", 规划范围线要素名称="JX_规划范围线", 输出要素名称="内存临时"):
    if 输出要素名称 == "内存临时":
        输出要素名称 = "in_memory\\AA_河道边线" + "_" + bxarcpy.工具集.生成短GUID()
    河道中线要素 = bxarcpy.要素类.要素读取_通过名称(河道中线要素名称).要素创建_通过复制()
    河道中线要素.字段添加("河道半宽", "单精度")
    with bxarcpy.游标类.游标创建_通过名称("更新", 河道中线要素.名称, ["河道宽度", "河道半宽"]) as 游标:
        for x in 游标:
            河道宽度 = x["河道宽度"].split("-")[-1]
            x["河道半宽"] = float(河道宽度) * 0.7
            游标.行更新(x)

    河道中线缓冲要素 = 河道中线要素.要素创建_通过缓冲("河道半宽", 融合类型="融合按字段", 融合字段名称列表=["河道名称"], 末端类型="方形")
    河道中线要素.字段删除(["河道半宽"])
    河道中线缓冲要素.字段删除(["河道半宽"])

    with bxarcpy.游标类.游标创建_通过名称("更新", 河道中线缓冲要素.名称, ["_ID", "_形状", "河道名称"]) as 游标1:
        with bxarcpy.游标类.游标创建_通过名称("查询", 河道中线缓冲要素.名称, ["_ID", "_形状", "河道名称"]) as 游标2:
            # 游标1运行次数 = 0
            for x in 游标1:
                # 游标1运行次数 += 1
                # 游标2运行次数 = 0
                for y in 游标2:
                    # 游标2运行次数 += 1
                    # print(f"游标1次数{游标1运行次数}，游标2次数{游标2运行次数}")
                    # print(f"x：{x}")
                    # print(f"y：{y}")
                    if x["_ID"] != y["_ID"] and bxarcpy.几何对象类.集合_交集(x["_形状"], y["_形状"]):
                        # print(f'ID{x["OID@"]}和ID{y["OID@"]}有交集')
                        x["_形状"] = bxarcpy.几何对象类.集合_差集(x["_形状"], y["_形状"])
                        游标1.行更新(x)
                游标2.重置()

    地块要素 = bxarcpy.要素类.要素读取_通过名称(用地要素名称).要素创建_通过复制()

    河道边线要素 = 地块要素.要素创建_通过筛选("地类编号 LIKE '1701%'")
    河道边线要素 = 河道边线要素.要素创建_通过融合(["地类编号"]).要素几何修复()
    河道边线要素 = 河道边线要素.要素创建_通过转线()

    带有属性的河道边线要素 = 河道边线要素.要素创建_通过相交([河道中线缓冲要素.名称]).要素创建_通过多部件至单部件().要素几何修复()

    还没有属性的河道边线要素 = 河道边线要素.要素创建_通过擦除(河道中线缓冲要素.名称).要素创建_通过多部件至单部件().要素几何修复().字段添加("河道名称")

    with bxarcpy.游标类.游标创建_通过名称("更新", 还没有属性的河道边线要素.名称, ["_形状", "河道名称"]) as 游标1:
        with bxarcpy.游标类.游标创建_通过名称("查询", 带有属性的河道边线要素.名称, ["_形状", "河道名称"]) as 游标2:
            for x in 游标1:
                for y in 游标2:
                    if bxarcpy.几何对象类.集合_交集(x["_形状"], y["_形状"], 类型="点"):
                        x["河道名称"] = y["河道名称"]
                        游标1.行更新(x)
                游标2.重置()
    合并后要素 = 带有属性的河道边线要素.要素创建_通过合并([还没有属性的河道边线要素.名称])

    范围要素 = bxarcpy.要素类.要素读取_通过名称(规划范围线要素名称)
    范围转线后要素 = 范围要素.要素创建_通过转线()
    合并后要素 = 合并后要素.要素创建_通过擦除(范围转线后要素.名称)

    合并后要素.字段删除(保留字段名称列表=["河道名称"])
    输出要素 = 合并后要素.要素创建_通过复制并重命名重名要素(输出要素名称)
    return 输出要素


if __name__ == "__main__":
    工作空间 = r"C:\Users\common\project\J江东区临江控规\临江控规_数据库.gdb"
    # 河道中线要素名称 = bxarcpy.环境.输入参数获取_以字符串形式(0, "DL_河道中线", True)
    with bxarcpy.环境.环境管理器(工作空间):
        河道边线生成("DL_河道中线", "DIST_用地规划图", "JX_规划范围线", "DL_河道边线")
