# -*- coding: utf-8 -*-

import bxarcpy
from typing import Literal
import bxarcpy.工具包 as 工具包
from bxarcpy.要素包 import 要素类
from bxpy.日志包 import 日志生成器
from bxarcpy.游标包 import 游标类
from bxarcpy.数据库包 import 数据库类
from bxarcpy.要素数据集包 import 要素数据集类
from bxarcpy.环境包 import 环境管理器类, 输入输出类
from bxgis.配置 import 基本信息


def 入库_规划地块(
    地块要素路径="DIST_用地规划图",
    入库要素模板="AC_RK_控规地块",
    输出要素路径="AC_RK_控规地块1",
):
    from bxpy.基本对象包 import 浮类, 字类, 整类

    地块要素 = 要素类.要素创建_通过复制(地块要素路径)
    入库要素 = 要素类.要素创建_通过复制(入库要素模板)

    with 游标类.游标创建("更新", 入库要素, ["_形状"]) as 游标:
        for 游标x in 游标类.属性获取_数据_字典形式(游标, ["_形状"]):
            游标类.行删除(游标)

    地块要素需操作的字段名称列表 = ["_形状", "*"]
    入库要素需操作的字段名称列表 = ["_形状", "JZMJ", "ZZJZMJ", "GJJZMJ", "XZQDM", "XZQMC", "DYMC", "DKBH", "YDDM", "YDXZ", "PFWH", "PFSJ", "QTGKYQ", "YDMJ", "BZ", "HS", "RK", "TCW", "ZYYDDM", "RJLSX", "RJLXX", "JZMDSX", "JZMDXX", "JZGDSX", "JZGDXX", "LDLSX", "LDLXX", "RKSJ", "PS", "SZDM", "EJDM"]
    with 游标类.游标创建("查询", 地块要素, 地块要素需操作的字段名称列表) as 游标_地块, 游标类.游标创建("插入", 入库要素, 入库要素需操作的字段名称列表) as 游标_入库:
        for 地块x in 游标类.属性获取_数据_字典形式(游标_地块, 地块要素需操作的字段名称列表):
            构造数据 = {}
            构造数据["_形状"] = 地块x["_形状"]

            构造数据["JZMJ"] = 浮类.转换_到浮(地块x["地块建筑面积"])
            构造数据["ZZJZMJ"] = 浮类.转换_到浮(地块x["住宅建筑面积"])
            构造数据["GJJZMJ"] = 浮类.转换_到浮(地块x["公服建筑面积"])
            构造数据["XZQDM"] = "330521"
            构造数据["XZQMC"] = "德清县"
            构造数据["DYMC"] = "德清县洛舍镇杨树湾单元（ZX-40）详细规划"
            构造数据["DKBH"] = 地块x["地块编号"]
            构造数据["YDDM"] = 地块x["地块性质别称"]
            构造数据["YDXZ"] = 地块x["性质名称"]
            构造数据["PFWH"] = "德政函〔2024〕113号"
            构造数据["PFSJ"] = "2024/12/11"
            构造数据["QTGKYQ"] = 地块x["开口方位"]
            构造数据["YDMJ"] = 浮类.转换_到浮(字类.转换_到字(浮类.转换_到浮(地块x["面积"]), 0))
            构造数据["BZ"] = 地块x["开发动态"]
            构造数据["HS"] = 整类.转换_到整(地块x["居住户数"])
            构造数据["RK"] = 整类.转换_到整(地块x["居住人数"])
            构造数据["TCW"] = 整类.转换_到整(地块x["机动车位量"])
            构造数据["ZYYDDM"] = 地块x["地块性质别称"].split("/")[0]

            if "＜" in 地块x["容积率"] or "≤" in 地块x["容积率"]:
                构造数据["RJLSX"] = 浮类.转换_到浮(地块x["容积率"].replace("＜", "").replace("≤", ""))
                构造数据["RJLXX"] = 浮类.转换_到浮(0.0)
            elif "＞" in 地块x["容积率"] or "≥" in 地块x["容积率"]:
                构造数据["RJLSX"] = 浮类.转换_到浮(9999)
                构造数据["RJLXX"] = 浮类.转换_到浮(地块x["容积率"].replace("＞", "").replace("≥", ""))
            elif "-" in 地块x["容积率"]:
                构造数据["RJLSX"] = 浮类.转换_到浮(地块x["容积率"].split("-")[1])
                构造数据["RJLXX"] = 浮类.转换_到浮(地块x["容积率"].split("-")[0])
            elif 地块x["容积率"] in ["", None, " "]:
                构造数据["RJLSX"] = 浮类.转换_到浮(9999)
                构造数据["RJLXX"] = 浮类.转换_到浮(0.0)
            else:
                构造数据["RJLSX"] = 浮类.转换_到浮(地块x["容积率"])
                构造数据["RJLXX"] = 浮类.转换_到浮(0.0)

            if "＜" in 地块x["建筑密度"] or "≤" in 地块x["建筑密度"]:
                构造数据["JZMDSX"] = 浮类.转换_到浮(地块x["建筑密度"].replace("＜", "").replace("≤", ""))
                构造数据["JZMDXX"] = 浮类.转换_到浮(0.0)
            elif "＞" in 地块x["建筑密度"] or "≥" in 地块x["建筑密度"]:
                构造数据["JZMDSX"] = 浮类.转换_到浮(9999)
                构造数据["JZMDXX"] = 浮类.转换_到浮(地块x["建筑密度"].replace("＞", "").replace("≥", ""))
            elif "-" in 地块x["建筑密度"]:
                构造数据["JZMDSX"] = 浮类.转换_到浮(地块x["建筑密度"].split("-")[1])
                构造数据["JZMDXX"] = 浮类.转换_到浮(地块x["建筑密度"].split("-")[0])
            elif 地块x["建筑密度"] in ["", None, " "]:
                构造数据["JZMDSX"] = 浮类.转换_到浮(9999)
                构造数据["JZMDXX"] = 浮类.转换_到浮(0.0)
            else:
                构造数据["JZMDSX"] = 浮类.转换_到浮(地块x["建筑密度"])
                构造数据["JZMDXX"] = 浮类.转换_到浮(0.0)

            if "＜" in 地块x["建筑限高"] or "≤" in 地块x["建筑限高"]:
                构造数据["JZGDSX"] = 浮类.转换_到浮(地块x["建筑限高"].replace("＜", "").replace("≤", ""))
                构造数据["JZGDXX"] = 浮类.转换_到浮(0.0)
            elif "＞" in 地块x["建筑限高"] or "≥" in 地块x["建筑限高"]:
                构造数据["JZGDSX"] = 浮类.转换_到浮(9999)
                构造数据["JZGDXX"] = 浮类.转换_到浮(地块x["建筑限高"].replace("＞", "").replace("≥", ""))
            elif "-" in 地块x["建筑限高"]:
                构造数据["JZGDSX"] = 浮类.转换_到浮(地块x["建筑限高"].split("-")[1])
                构造数据["JZGDXX"] = 浮类.转换_到浮(地块x["建筑限高"].split("-")[0])
            elif 地块x["建筑限高"] in ["", None, " "]:
                构造数据["JZGDSX"] = 浮类.转换_到浮(9999)
                构造数据["JZGDXX"] = 浮类.转换_到浮(0.0)
            else:
                构造数据["JZGDSX"] = 浮类.转换_到浮(地块x["建筑限高"])
                构造数据["JZGDXX"] = 浮类.转换_到浮(0.0)

            if "＜" in 地块x["绿地率"] or "≤" in 地块x["绿地率"]:
                构造数据["LDLSX"] = 浮类.转换_到浮(地块x["绿地率"].replace("＜", "").replace("≤", ""))
                构造数据["LDLXX"] = 浮类.转换_到浮(0.0)
            elif "＞" in 地块x["绿地率"] or "≥" in 地块x["绿地率"]:
                构造数据["LDLSX"] = 浮类.转换_到浮(9999)
                构造数据["LDLXX"] = 浮类.转换_到浮(地块x["绿地率"].replace("＞", "").replace("≥", ""))
            elif "-" in 地块x["绿地率"]:
                构造数据["LDLSX"] = 浮类.转换_到浮(地块x["绿地率"].split("-")[1])
                构造数据["LDLXX"] = 浮类.转换_到浮(地块x["绿地率"].split("-")[0])
            elif 地块x["绿地率"] in ["", None, " "]:
                构造数据["LDLSX"] = 浮类.转换_到浮(9999)
                构造数据["LDLXX"] = 浮类.转换_到浮(0.0)
            else:
                构造数据["LDLSX"] = 浮类.转换_到浮(9999)
                构造数据["LDLXX"] = 浮类.转换_到浮(地块x["绿地率"])

            构造数据["RKSJ"] = None  # 入库时间
            构造数据["PS"] = 地块x["地块性质别称"].split("/")[0]  # 配色
            构造数据["SZDM"] = 地块x["地块性质"].replace("v", "")  # 数字代码

            templist = []
            for x in 地块x["地块性质"].split("/"):
                temp = x[0:4].replace("v", "") if len(x) > 4 else x.replace("v", "")
                templist.append(temp)
            构造数据["EJDM"] = "/".join(templist)  # 二级代码

            游标类.行插入_字典形式(游标_入库, 构造数据, 入库要素需操作的字段名称列表)

    输出要素路径 = 工具包.输出路径生成_当采用内存临时时([地块要素路径]) if 输出要素路径 == "内存临时" else 输出要素路径
    输出要素 = 要素类.要素创建_通过复制并重命名重名要素(入库要素, 输出要素路径)
    return 输出要素


if __name__ == "__main__":
    日志生成器.开启()
    # 工作空间 = r"C:\Users\common\project\F富阳受降控规\受降北_数据库.gdb"
    工作空间 = r"C:\Users\common\project\J江东区临江控规\临江控规_数据库.gdb"
    工作空间 = r"C:\Users\common\Project\D德清洛舍杨树湾单元控规\03过程文件\24.11.27报批稿\D德清洛舍杨树湾单元控规_数据库.gdb"
    with 环境管理器类.环境管理器类创建(工作空间):
        入库_规划地块(
            地块要素路径="DIST_用地规划图",
            入库要素模板="AC_RK_控规地块",
            输出要素路径="AC_RK_控规地块1",
        )
