# -*- coding: utf-8 -*-

from bxarcpy.要素包 import 要素类, 字段类
from bxarcpy.游标包 import 游标类
from bxpy.日志包 import 日志类
from bxpy.基本对象包 import 整类
from bxarcpy.环境包 import 环境管理器类, 输入输出类
from bxarcpy.几何包 import 几何类
from bxgis.配置 import 基本信息
import bxarcpy.工具包 as 工具包


def 根据街坊生成街区(
    街坊要素路径="XG_JQJF",
    字段名称映射={
        "区域规划编制单元名称字段名称": "dymc",
        "区域层级字段名称": "cj",
        "区域编码字段名称": "bm",
        "区域类型字段名称": "lx",
        "区域面积字段名称": "mj",
        "区域城镇人口规模字段名称": "rk",
        "区域街坊建筑总量字段名称": "jzzl",
        "区域街坊住宅总量字段名称": "zzzl",
        "区域街坊工业总量字段名称": "gyzl",
        "区域街坊商业商务总量字段名称": "syzl",
        "区域分村户籍人口字段名称": "hjrk",
        "区域分村常住人口字段名称": "czrk",
        "区域耕地保有量字段名称": "gd",
        "区域永久基本农田面积字段名称": "yn",
        "区域生态保护红线面积字段名称": "st",
        "区域村庄建设边界面积字段名称": "czbj",
        "区域城乡建设用地面积字段名称": "cxmj",
        "区域村庄建设用地面积字段名称": "czmj",
        "区域备注字段名称": "bz",
    },
    输出要素名称="内存临时",
):
    if 输出要素名称 == "内存临时":
        输出要素名称 = "in_memory\\AA_街区" + "_" + 工具包.生成短GUID()
    街坊要素路径 = 要素类.要素创建_通过复制(街坊要素路径)

    街区要素 = 要素类.要素创建_通过名称("AA_街区" + "_" + 工具包.生成短GUID(), 模板=街坊要素路径)
    操作字段 = list(字段名称映射.values())
    操作字段.append("_形状")
    街区字典 = {}
    with 游标类.游标创建("查询", 街坊要素路径, 操作字段) as 游标_街坊:
        for 街坊数据x in 游标类.属性获取_数据_字典形式(游标_街坊, 操作字段):
            规划编制单元名称 = 街坊数据x[字段名称映射["区域规划编制单元名称字段名称"]]
            层级 = 街坊数据x[字段名称映射["区域层级字段名称"]]
            编码 = 街坊数据x[字段名称映射["区域编码字段名称"]]
            类型 = 街坊数据x[字段名称映射["区域类型字段名称"]]
            面积 = 街坊数据x[字段名称映射["区域面积字段名称"]]
            城镇人口规模 = 街坊数据x[字段名称映射["区域城镇人口规模字段名称"]]
            街坊建筑总量 = 街坊数据x[字段名称映射["区域街坊建筑总量字段名称"]]
            街坊住宅总量 = 街坊数据x[字段名称映射["区域街坊住宅总量字段名称"]]
            街坊工业总量 = 街坊数据x[字段名称映射["区域街坊工业总量字段名称"]]
            街坊商业商务总量 = 街坊数据x[字段名称映射["区域街坊商业商务总量字段名称"]]
            分村户籍人口 = 街坊数据x[字段名称映射["区域分村户籍人口字段名称"]]
            分村常住人口 = 街坊数据x[字段名称映射["区域分村常住人口字段名称"]]
            耕地保有量 = 街坊数据x[字段名称映射["区域耕地保有量字段名称"]]
            永久基本农田面积 = 街坊数据x[字段名称映射["区域永久基本农田面积字段名称"]]
            生态保护红线面积 = 街坊数据x[字段名称映射["区域生态保护红线面积字段名称"]]
            村庄建设边界面积 = 街坊数据x[字段名称映射["区域村庄建设边界面积字段名称"]]
            城乡建设用地面积 = 街坊数据x[字段名称映射["区域城乡建设用地面积字段名称"]]
            村庄建设用地面积 = 街坊数据x[字段名称映射["区域村庄建设用地面积字段名称"]]
            备注 = 街坊数据x[字段名称映射["区域备注字段名称"]]
            if 层级 != "街坊":
                continue
            街区编码 = 编码[0:6]
            街区字典.setdefault(街区编码, {})
            街区字典[街区编码][字段名称映射["区域规划编制单元名称字段名称"]] = 规划编制单元名称
            街区字典[街区编码][字段名称映射["区域层级字段名称"]] = '街区'
            街区字典[街区编码][字段名称映射["区域编码字段名称"]] = 街区编码

            街区字典[街区编码].setdefault(字段名称映射["区域类型字段名称"], "")
            街区字典[街区编码][字段名称映射["区域类型字段名称"]] = f", {类型}" if 街区字典[街区编码][字段名称映射["区域类型字段名称"]] not in ["", " "] else 类型

            街区字典[街区编码].setdefault(字段名称映射["区域面积字段名称"], 0)
            街区字典[街区编码][字段名称映射["区域面积字段名称"]] += 面积
            街区字典[街区编码][字段名称映射["区域面积字段名称"]] = round(街区字典[街区编码][字段名称映射["区域面积字段名称"]], 4)

            街区字典[街区编码].setdefault(字段名称映射["区域城镇人口规模字段名称"], 0)
            街区字典[街区编码][字段名称映射["区域城镇人口规模字段名称"]] += 城镇人口规模
            街区字典[街区编码][字段名称映射["区域城镇人口规模字段名称"]] = round(街区字典[街区编码][字段名称映射["区域城镇人口规模字段名称"]], 4)

            街区字典[街区编码].setdefault(字段名称映射["区域街坊建筑总量字段名称"], 0)
            街区字典[街区编码][字段名称映射["区域街坊建筑总量字段名称"]] += 街坊建筑总量
            街区字典[街区编码][字段名称映射["区域街坊建筑总量字段名称"]] = round(街区字典[街区编码][字段名称映射["区域街坊建筑总量字段名称"]], 4)

            街区字典[街区编码].setdefault(字段名称映射["区域街坊住宅总量字段名称"], 0)
            街区字典[街区编码][字段名称映射["区域街坊住宅总量字段名称"]] += 街坊住宅总量
            街区字典[街区编码][字段名称映射["区域街坊住宅总量字段名称"]] = round(街区字典[街区编码][字段名称映射["区域街坊住宅总量字段名称"]], 4)

            街区字典[街区编码].setdefault(字段名称映射["区域街坊工业总量字段名称"], 0)
            街区字典[街区编码][字段名称映射["区域街坊工业总量字段名称"]] += 街坊工业总量
            街区字典[街区编码][字段名称映射["区域街坊工业总量字段名称"]] = round(街区字典[街区编码][字段名称映射["区域街坊工业总量字段名称"]], 4)

            街区字典[街区编码].setdefault(字段名称映射["区域街坊商业商务总量字段名称"], 0)
            街区字典[街区编码][字段名称映射["区域街坊商业商务总量字段名称"]] += 街坊商业商务总量
            街区字典[街区编码][字段名称映射["区域街坊商业商务总量字段名称"]] = round(街区字典[街区编码][字段名称映射["区域街坊商业商务总量字段名称"]], 4)

            街区字典[街区编码].setdefault(字段名称映射["区域分村户籍人口字段名称"], 0)
            街区字典[街区编码][字段名称映射["区域分村户籍人口字段名称"]] += 分村户籍人口
            街区字典[街区编码][字段名称映射["区域分村户籍人口字段名称"]] = round(街区字典[街区编码][字段名称映射["区域分村户籍人口字段名称"]], 4)

            街区字典[街区编码].setdefault(字段名称映射["区域分村常住人口字段名称"], 0)
            街区字典[街区编码][字段名称映射["区域分村常住人口字段名称"]] += 分村常住人口
            街区字典[街区编码][字段名称映射["区域分村常住人口字段名称"]] = round(街区字典[街区编码][字段名称映射["区域分村常住人口字段名称"]], 4)

            街区字典[街区编码].setdefault(字段名称映射["区域耕地保有量字段名称"], 0)
            街区字典[街区编码][字段名称映射["区域耕地保有量字段名称"]] += 耕地保有量
            街区字典[街区编码][字段名称映射["区域耕地保有量字段名称"]] = round(街区字典[街区编码][字段名称映射["区域耕地保有量字段名称"]], 4)

            街区字典[街区编码].setdefault(字段名称映射["区域永久基本农田面积字段名称"], 0)
            街区字典[街区编码][字段名称映射["区域永久基本农田面积字段名称"]] += 永久基本农田面积
            街区字典[街区编码][字段名称映射["区域永久基本农田面积字段名称"]] = round(街区字典[街区编码][字段名称映射["区域永久基本农田面积字段名称"]], 4)

            街区字典[街区编码].setdefault(字段名称映射["区域生态保护红线面积字段名称"], 0)
            街区字典[街区编码][字段名称映射["区域生态保护红线面积字段名称"]] += 生态保护红线面积
            街区字典[街区编码][字段名称映射["区域生态保护红线面积字段名称"]] = round(街区字典[街区编码][字段名称映射["区域生态保护红线面积字段名称"]], 4)

            街区字典[街区编码].setdefault(字段名称映射["区域村庄建设边界面积字段名称"], 0)
            街区字典[街区编码][字段名称映射["区域村庄建设边界面积字段名称"]] += 村庄建设边界面积
            街区字典[街区编码][字段名称映射["区域村庄建设边界面积字段名称"]] = round(街区字典[街区编码][字段名称映射["区域村庄建设边界面积字段名称"]], 4)

            街区字典[街区编码].setdefault(字段名称映射["区域城乡建设用地面积字段名称"], 0)
            街区字典[街区编码][字段名称映射["区域城乡建设用地面积字段名称"]] += 城乡建设用地面积
            街区字典[街区编码][字段名称映射["区域城乡建设用地面积字段名称"]] = round(街区字典[街区编码][字段名称映射["区域城乡建设用地面积字段名称"]], 4)

            街区字典[街区编码].setdefault(字段名称映射["区域村庄建设用地面积字段名称"], 0)
            街区字典[街区编码][字段名称映射["区域村庄建设用地面积字段名称"]] += 村庄建设用地面积
            街区字典[街区编码][字段名称映射["区域村庄建设用地面积字段名称"]] = round(街区字典[街区编码][字段名称映射["区域村庄建设用地面积字段名称"]], 4)

            街区字典[街区编码].setdefault(字段名称映射["区域备注字段名称"], "")
            街区字典[街区编码][字段名称映射["区域备注字段名称"]] += f", {备注}" if 街区字典[街区编码][字段名称映射["区域备注字段名称"]] not in ["", " ", "  "] else 备注

            街区字典[街区编码].setdefault("_形状", [])
            街区字典[街区编码]["_形状"].append(街坊数据x["_形状"])
    日志类.输出调试(f"街区字典为：{街区字典}")
    with 游标类.游标创建("插入", 街区要素, 操作字段) as 游标_街区:
        for v in 街区字典.values():
            几何对象 = v["_形状"][-1]
            日志类.输出调试(f"几何对象：{几何对象}")
            v["_形状"].pop()
            for 几何x in v["_形状"]:
                日志类.输出调试(f"几何对象x：{几何x}")
                几何对象 = 几何类.集合_并集(几何对象, 几何x)
            v["_形状"] = 几何对象
            日志类.输出调试(f"形状面积：{几何类.属性获取_面积(几何对象)}")
            日志类.输出调试(f"准备插入的街区数据：{v}")
            游标类.行插入_字典形式(游标_街区, v, 操作字段)

    输出要素 = 要素类.要素创建_通过复制并重命名重名要素(街区要素, 输出要素名称)
    return 输出要素


if __name__ == "__main__":
    日志类.开启(级别列表过滤=["调试", "信息", "警告", "错误", "危险"])
    工作空间 = r"C:\Users\beixiao\Project\F富阳受降控规\0.资料\7.流程_24.06.13_质检\富阳区受降北单元入库数据.gdb"
    with 环境管理器类.环境管理器类创建(工作空间):
        根据街坊生成街区(
            街坊要素路径="XG_JQJF",
            输出要素名称="XG_JQJF1",
        )
