# -*- coding: utf-8 -*-

import bxarcpy
from bxpy import 时间
import time
from bxpy import 日志


class 用地要素类(bxarcpy.要素类):
    def __init__(self, 内嵌对象=None, 名称=None):
        super().__init__(内嵌对象, 名称)

    @staticmethod
    def 用地读取_通过名称(名称):
        return 用地要素类(名称=名称)

    def 用地创建_通过计算调整类型(self, 输出要素名称="in_memory\\AA_计算调整类型"):
        if 输出要素名称 == "in_memory\\AA_计算调整类型":
            输出要素名称 = 输出要素名称 + "_" + bxarcpy.常量.当前时间()
        输入要素 = bxarcpy.要素类.要素读取_通过名称(self.名称).要素创建_通过复制()
        with bxarcpy.游标类.游标创建_通过名称("更新", 输入要素.名称, ["地类编号_现状", "地类编号_规划", "地类差异", "调整类型", "所属三区三线", "开发动态", "Shape_Area"]) as 游标:
            from bxpy import bxstr

            开发边界内_未建设空间_住宅 = 0
            开发边界内_未建设空间_工业 = 0
            开发边界内_未建设空间_商服 = 0
            开发边界内_未建设空间_其他 = 0
            开发边界内_未建设空间_道路河道绿地 = 0
            开发边界内_已建设空间_改住宅 = 0
            开发边界内_已建设空间_改工业 = 0
            开发边界内_已建设空间_改商服 = 0
            for x in 游标:
                x["调整类型"] = ""
                if x["所属三区三线"] in ["城镇集中建设区", "城镇弹性发展区"]:
                    x["调整类型"] = x["调整类型"] + "-开发边界内"
                else:
                    x["调整类型"] = x["调整类型"] + "-开发边界外"

                if (((x["地类编号_现状"][0:2] in ["01", "02", "03", "04", "05", "06", "17"] and x["地类编号_现状"][0:6] not in ["060102"]) or x["地类编号_规划"][0:9] in ["120802/07", "120802/08", "120802/14"]) and (x["地类编号_规划"][0:2] in ["07", "08", "09", "10", "11", "12", "13", "14", "15", "16"] or x["地类编号_规划"][0:6] in ["060102"]) and x["开发动态"] not in ["现状已实施", "拟建", "已批未建"]) or x["开发动态"] in ["规划未实施"]:
                    x["调整类型"] = x["调整类型"] + "-未建设空间"
                else:
                    x["调整类型"] = x["调整类型"] + "-已建设空间"

                # if x["地类编号_现状"][0:4] != x["地类编号_规划"][0:4] and x["开发动态"] not in ["现状已实施"]:
                #     x["调整类型"] = x["调整类型"] + "-未建设空间"
                # else:
                #     x["调整类型"] = x["调整类型"] + "-已建设空间"

                if x["地类编号_规划"][0:4] in ["0701", "0702"] or x["地类编号_规划"][0:9] in ["120802/07"]:
                    x["调整类型"] = x["调整类型"] + "-住宅"
                elif x["地类编号_规划"][0:4] in ["1001", "1101"]:
                    x["调整类型"] = x["调整类型"] + "-工业"
                elif x["地类编号_规划"][0:2] in ["09"]:
                    x["调整类型"] = x["调整类型"] + "-商服"
                elif x["地类编号_规划"][0:2] in ["08", "13"] or x["地类编号_规划"] in ["120802", "120802/120803", "120803", "120803v"] or x["地类编号_规划"][0:9] in ["120802/08"]:
                    x["调整类型"] = x["调整类型"] + "-公服"
                elif x["地类编号_规划"][0:4] in ["1202", "1207"] or x["地类编号_规划"][0:2] in ["17", "14"] or x["地类编号_规划"][0:6] in ["060102"] or x["地类编号_规划"][0:9] in ["120802/14"]:
                    x["调整类型"] = x["调整类型"] + "-道路河道绿地"
                else:
                    x["调整类型"] = x["调整类型"] + "-其他"

                if x["地类编号_现状"][0:4] not in ["0701", "0702"] and x["地类编号_现状"][0:9] not in ["120802/07"] and (x["地类编号_规划"][0:4] in ["0701", "0702"] or x["地类编号_规划"][0:9] in ["120802/07"]):
                    x["调整类型"] = x["调整类型"] + "-其他用地更新为住宅用地"
                if x["地类编号_现状"][0:2] not in ["09"] and x["地类编号_规划"][0:2] in ["09"]:
                    x["调整类型"] = x["调整类型"] + "-其他用地更新为商服用地"
                if x["地类编号_现状"][0:4] in ["1001", "1101"] and x["地类编号_规划"][0:4] in ["1001", "1101"] and x["开发动态"] not in ["现状已实施", "拟建", "已批未建"]:
                    x["调整类型"] = x["调整类型"] + "-工业用地更新为工业用地"

                if "-开发边界内" in x["调整类型"] and "-未建设空间" in x["调整类型"] and "-住宅" in x["调整类型"]:
                    开发边界内_未建设空间_住宅 += x["Shape_Area"]
                if "-开发边界内" in x["调整类型"] and "-未建设空间" in x["调整类型"] and "-工业" in x["调整类型"]:
                    开发边界内_未建设空间_工业 += x["Shape_Area"]
                if "-开发边界内" in x["调整类型"] and "-未建设空间" in x["调整类型"] and "-商服" in x["调整类型"]:
                    开发边界内_未建设空间_商服 += x["Shape_Area"]
                if "-开发边界内" in x["调整类型"] and "-未建设空间" in x["调整类型"] and ("-公服" in x["调整类型"] or "-其他" in x["调整类型"]):
                    开发边界内_未建设空间_其他 += x["Shape_Area"]
                if "-开发边界内" in x["调整类型"] and "-未建设空间" in x["调整类型"] and "-道路河道绿地" in x["调整类型"]:
                    开发边界内_未建设空间_道路河道绿地 += x["Shape_Area"]
                if "-开发边界内" in x["调整类型"] and "-已建设空间" in x["调整类型"] and "-其他用地更新为住宅用地" in x["调整类型"]:
                    开发边界内_已建设空间_改住宅 += x["Shape_Area"]
                if "-开发边界内" in x["调整类型"] and "-已建设空间" in x["调整类型"] and "-工业用地更新为工业用地" in x["调整类型"]:
                    开发边界内_已建设空间_改工业 += x["Shape_Area"]
                if "-开发边界内" in x["调整类型"] and "-已建设空间" in x["调整类型"] and "-其他用地更新为商服用地" in x["调整类型"]:
                    开发边界内_已建设空间_改商服 += x["Shape_Area"]

                # if x["地类编号_现状"][0:2] in ["01", "02", "03", "04", "05", "06", "17"] and x["地类编号_现状"][0:6] not in ["060102"] and x["地类编号_规划"][0:2] in ["07", "08", "09", "10", "11", "12", "13", "14", "15", "16"] and x["开发动态"] not in ["现状已实施"]:
                #     x["调整类型"] = "新增建设用地"

                #     if x["地类编号_规划"][0:4] in ["0703"]:
                #         x["调整类型"] = x["调整类型"] + "-宅基地"
                #     elif x["地类编号_规划"][0:2] in ["09", "10", "11"] or x["地类编号_规划"][0:4] in ["0701"] or x["地类编号_规划"][0:9] in ["120802/07", "120802/09"]:
                #         x["调整类型"] = x["调整类型"] + "-经营性用地"
                #     elif x["地类编号_规划"][0:2] in ["08", "13", "15", "16"] or x["地类编号_规划"][0:4] in ["0702", "0704"] or x["地类编号_规划"][0:6] in ["120801", "120802", "120803"]:
                #         x["调整类型"] = x["调整类型"] + "-公益性用地"
                #     elif x["地类编号_规划"][0:2] in ["14"]:
                #         x["调整类型"] = ""
                #     elif x["地类编号_规划"][0:4] in ["1201", "1202", "1203", "1204", "1205", "1206", "1207", "1209"]:
                #         x["调整类型"] = ""

                # if (x["地类编号_现状"][0:2] in ["07", "08", "09", "10", "11", "12", "13", "14", "15", "16"] or x["地类编号_现状"][0:4] in ["2301"] or x["地类编号_现状"][0:6] in ["060102"]) and x["地类编号_规划"][0:2] in ["07", "08", "09", "10", "11", "12", "13", "14", "15", "16"] and x["地类编号_现状"][0:2] != x["地类编号_规划"][0:2] and x["开发动态"] not in ["现状已实施"]:
                #     x["调整类型"] = "更新改造用地"

                #     if x["所属三区三线"] not in ["城镇集中建设区", "城镇弹性发展区"]:
                #         x["调整类型"] = x["调整类型"] + "-开发边界外"
                #     elif x["所属三区三线"] in ["城镇集中建设区", "城镇弹性发展区"]:
                #         x["调整类型"] = x["调整类型"] + "-开发边界内"

                #     if x["地类编号_规划"][0:4] in ["0703"]:
                #         x["调整类型"] = x["调整类型"] + "-宅基地"
                #     elif x["地类编号_规划"][0:2] in ["09", "10", "11"] or x["地类编号_规划"][0:4] in ["0701"] or x["地类编号_规划"][0:9] in ["120802/07", "120802/09"]:
                #         x["调整类型"] = x["调整类型"] + "-经营性用地"
                #     elif x["地类编号_规划"][0:2] in ["08", "13", "15", "16"] or x["地类编号_规划"][0:4] in ["0702", "0704"] or x["地类编号_规划"][0:6] in ["120801", "120802", "120803"]:
                #         x["调整类型"] = x["调整类型"] + "-公益性用地"
                #     elif x["地类编号_规划"][0:2] in ["14"]:
                #         x["调整类型"] = ""
                #     elif x["地类编号_规划"][0:4] in ["1201", "1202", "1203", "1204", "1205", "1206", "1207", "1209"]:
                #         x["调整类型"] = ""
                # elif x["地类编号_规划"][0:2] in ["14"]:
                #     x["调整类型"] = x["调整类型"] + "-绿地"
                # elif x["地类编号_规划"][0:4] in ["1201", "1202", "1203", "1204", "1205", "1206", "1207", "1209"]:
                #     x["调整类型"] = x["调整类型"] + "-道路交通"

                游标.行更新(x)
        输出要素 = 输入要素.要素创建_通过复制并重命名重名要素(输出要素名称)
        print(f"开发边界内_未建设空间_住宅：{开发边界内_未建设空间_住宅}")
        print(f"开发边界内_未建设空间_工业：{开发边界内_未建设空间_工业}")
        print(f"开发边界内_未建设空间_商服：{开发边界内_未建设空间_商服}")
        print(f"开发边界内_未建设空间_其他：{开发边界内_未建设空间_其他}")
        print(f"开发边界内_未建设空间_道路河道绿地：{开发边界内_未建设空间_道路河道绿地}")
        print(f"开发边界内_已建设空间_改住宅：{开发边界内_已建设空间_改住宅}")
        print(f"开发边界内_已建设空间_改工业：{开发边界内_已建设空间_改工业}")
        print(f"开发边界内_已建设空间_改商服：{开发边界内_已建设空间_改商服}")
        return 输出要素


if __name__ == "__main__":
    # 工作空间 = r"C:\Users\common\project\F富阳受降控规\受降北_数据库.gdb"
    # 日志.开启()
    工作空间 = r"C:\Users\common\project\J江东区临江控规\临江控规_数据库.gdb"
    with bxarcpy.环境.环境管理器(工作空间):
        用地要素 = 用地要素类.用地读取_通过名称("DIST_用地规划图")
        用地要素 = 用地要素.用地创建_通过计算所属区域("KZX_城镇开发边界", [["所属三区三线", "控制线名称"]])
        用地要素 = 用地要素.用地创建_通过计算所属区域("JX_街坊范围线", [["所属街坊", "区域编号"]])
        用地要素 = 用地要素.用地创建_通过计算所属区域("JX_街区范围线", [["所属街区", "区域编号"]])
        用地要素 = 用地要素.用地创建_通过计算所属区域("JX_工业片区范围线", [["所属工业片区", "区域编号"]])
        用地要素 = 用地要素.用地创建_通过计算用地构成()
        用地要素 = 用地要素.用地创建_通过计算耕保量("CZ_三调筛选_扣除地类系数")
        用地要素 = 用地要素.用地创建_通过计算两可用地("CZ_三调筛选_种植属性名称")

        用地要素.要素创建_通过复制并重命名重名要素("DIST_用地规划图_计算后")

        # main(工作空间="C:\\Users\\common\\project\\F富阳受降控规\\受降北_数据库.gdb", 输出要素名称="DIST_用地现状图", 规划范围="JX_规划范围线", 需要合并的要素名称列表=["YD_基期", "YD_现状修改1", "YD_审批信息", "YD_审批信息_另一个", "YD_不动产登记", "YD_现状修改2"])
        用地调整图要素 = 用地要素类.用地读取_通过名称("DIST_用地调整图")
        用地调整图要素.用地创建_通过计算调整类型("AA_用地调整图_计算调整类型")
