# *-* coding:utf8 *-*
import bxarcpy
from bxpy.日志包 import 日志生成器
import bxarcpy.工具包 as 工具包
from bxarcpy.工具包 import 输出路径生成_当采用内存临时时
from bxarcpy.要素包 import 要素类
from bxarcpy.游标包 import 游标类
from bxarcpy.数据库包 import 数据库类
from bxarcpy.要素数据集包 import 要素数据集类
from bxarcpy.环境包 import 环境管理器类, 输入输出类
from bxgis.配置.配置包 import 配置类

基本信息 = 配置类.项目信息对象获取()


def 字段处理并生成分项_二调(输入要素路径="CZ_二调", 输出要素路径="内存临时"):
    输出要素路径 = 输出路径生成_当采用内存临时时([输入要素路径]) if 输出要素路径 == "内存临时" else 输出要素路径
    替换字典 = [
        {"字段名称": "BSM", "修改后名称": "标识码", "类型": "长整型", "长度": 4},
        {"字段名称": "YSDM", "修改后名称": "要素代码", "类型": "字符串", "长度": 10},
        {"字段名称": "TBYBH", "修改后名称": "图斑预编号", "类型": "字符串", "长度": 8},
        {"字段名称": "TBBH", "修改后名称": "图斑编号", "类型": "字符串", "长度": 8},
        {"字段名称": "DLBM", "修改后名称": "地类编号_二调", "类型": "字符串", "长度": 4},
        {"字段名称": "DLMC", "修改后名称": "地类名称_二调", "类型": "字符串", "长度": 60},
        {"字段名称": "QSXZ", "修改后名称": "权属性质", "类型": "字符串", "长度": 3},
        {"字段名称": "QSDWDM", "修改后名称": "权属单位代码", "类型": "字符串", "长度": 19},
        {"字段名称": "QSDWMC", "修改后名称": "权属单位名称", "类型": "字符串", "长度": 60},
        {"字段名称": "ZLDWDM", "修改后名称": "坐落单位代码", "类型": "字符串", "长度": 19},
        {"字段名称": "ZLDWMC", "修改后名称": "坐落单位名称", "类型": "字符串", "长度": 60},
        {"字段名称": "GDLX", "修改后名称": "耕地类型", "类型": "字符串", "长度": 2},
        {"字段名称": "KCLX", "修改后名称": "扣除类型", "类型": "字符串", "长度": 2},
        {"字段名称": "GDPDJ", "修改后名称": "耕地坡度级", "类型": "字符串", "长度": 2},
        {"字段名称": "KCDLBM", "修改后名称": "扣除地类编码", "类型": "字符串", "长度": 4},
        {"字段名称": "TKXS", "修改后名称": "扣除地类系数", "类型": "双精度", "长度": 8},
        {"字段名称": "TBMJ", "修改后名称": "图斑面积", "类型": "双精度", "长度": 8},
        {"字段名称": "XZDWMJ", "修改后名称": "线状地物面积", "类型": "双精度", "长度": 8},
        {"字段名称": "LXDWMJ", "修改后名称": "零星地物面积", "类型": "双精度", "长度": 8},
        {"字段名称": "TKMJ", "修改后名称": "扣除地类面积", "类型": "双精度", "长度": 8},
        {"字段名称": "TBDLMJ", "修改后名称": "图斑地类面积", "类型": "双精度", "长度": 8},
        {"字段名称": "PZWH", "修改后名称": "批准文号", "类型": "字符串", "长度": 50},
        {"字段名称": "BGJLH", "修改后名称": "变更记录号", "类型": "字符串", "长度": 20},
        {"字段名称": "BGRQ", "修改后名称": "变更日期", "类型": "日期", "长度": 2},
        {"字段名称": "DLBZ", "修改后名称": "地类备注", "类型": "字符串", "长度": 2},
    ]

    输入要素 = 要素类.要素创建_通过复制(输入要素路径)

    输入要素字段名称列表 = 要素类.字段名称列表获取(输入要素)
    for x in 替换字典:
        if x["字段名称"] in 输入要素字段名称列表:
            要素类.字段修改(输入要素, x["字段名称"], x["修改后名称"], x["修改后名称"], x["类型"], x["长度"], 清除字段别称=False)
            # print(x["字段名称"] + " 已被修改为 " + x["修改后名称"])

    输出要素 = 要素类.要素创建_通过复制并重命名重名要素(输入要素, 输出要素路径)
    return 输出要素


if __name__ == "__main__":
    工作空间 = r"C:\Users\common\project\J江东区临江控规\临江控规_数据库.gdb"
    with 环境管理器类.环境管理器类创建(工作空间):
        字段处理并生成分项_二调("CZ_二调", 输出要素路径="CZ_二调_字段汉化")
