# *-* coding:utf8 *-*
import bxarcpy
from bxpy.日志包 import 日志生成器
from bxpy.基本对象包 import 字类
import bxarcpy.工具包 as 工具包
from bxarcpy.要素包 import 要素类, 字段类
from bxarcpy.游标包 import 游标类
from bxarcpy.数据库包 import 数据库类
from bxarcpy.要素数据集包 import 要素数据集类
from bxarcpy.环境包 import 环境管理器类, 输入输出类
from bxgis.配置 import 基本信息
from bxarcpy.工具包 import 输出路径生成_当采用内存临时时
from typing import Union, Literal, Any, List, Dict, Optional, TypedDict

# from pydantic import BaseModel


def 字段处理并生成分项_三调(
    输入要素路径="CZ_三调",
    扣除地类系数要素路径: Optional[str] = 基本信息.项目信息.CZ_三调_扣除地类系数,
    种植属性名称要素路径: Optional[str] = 基本信息.项目信息.CZ_三调_种植属性名称,
    城镇村属性码要素路径: Optional[str] = 基本信息.项目信息.CZ_三调_城镇村属性码,
    坐落单位名称要素路径: Optional[str] = 基本信息.项目信息.CZ_三调_坐落单位名称,
    输出要素路径="内存临时",
):
    输出要素路径 = 输出路径生成_当采用内存临时时([输入要素路径]) if 输出要素路径 == "内存临时" else 输出要素路径
    # 输入路径 = 工作空间 + 输入路径
    # Process: 更改字段 (更改字段) (management)
    替换字典 = [
        {"字段名称": "BSM", "修改后名称": "标识码", "类型": "字符串", "长度": 18},
        {"字段名称": "YSDM", "修改后名称": "要素代码", "类型": "字符串", "长度": 10},
        {"字段名称": "TBYBH", "修改后名称": "图斑预编号", "类型": "字符串", "长度": 18},
        {"字段名称": "TBBH", "修改后名称": "图斑编号", "类型": "字符串", "长度": 8},
        {"字段名称": "DLBM", "修改后名称": "地类编号_三调", "类型": "字符串", "长度": 5},
        {"字段名称": "DLMC", "修改后名称": "地类名称_三调", "类型": "字符串", "长度": 60},
        {"字段名称": "QSXZ", "修改后名称": "权属性质", "类型": "字符串", "长度": 2},
        {"字段名称": "QSDWDM", "修改后名称": "权属单位代码", "类型": "字符串", "长度": 19},
        {"字段名称": "QSDWMC", "修改后名称": "权属单位名称", "类型": "字符串", "长度": 254},
        {"字段名称": "ZLDWDM", "修改后名称": "坐落单位代码", "类型": "字符串", "长度": 19},
        {"字段名称": "ZLDWMC", "修改后名称": "坐落单位名称", "类型": "字符串", "长度": 254},
        {"字段名称": "TBMJ", "修改后名称": "图斑面积", "类型": "双精度", "长度": 8},
        {"字段名称": "KCDLBM", "修改后名称": "扣除地类编码", "类型": "字符串", "长度": 5},
        {"字段名称": "KCXS", "修改后名称": "扣除地类系数", "类型": "双精度", "长度": 8},
        {"字段名称": "KCMJ", "修改后名称": "扣除地类面积", "类型": "双精度", "长度": 8},
        {"字段名称": "TBDLMJ", "修改后名称": "图斑地类面积", "类型": "双精度", "长度": 8},
        {"字段名称": "GDLX", "修改后名称": "耕地类型", "类型": "字符串", "长度": 2},
        {"字段名称": "GDPDJB", "修改后名称": "耕地坡度级别", "类型": "字符串", "长度": 2},
        {"字段名称": "XZDWKD", "修改后名称": "线状地物宽度", "类型": "双精度", "长度": 8},
        {"字段名称": "TBXHDM", "修改后名称": "图斑细化代码", "类型": "字符串", "长度": 6},
        {"字段名称": "TBXHMC", "修改后名称": "图斑细化名称", "类型": "字符串", "长度": 20},
        {"字段名称": "ZZSXDM", "修改后名称": "种植属性代码", "类型": "字符串", "长度": 6},
        {"字段名称": "ZZSXMC", "修改后名称": "种植属性名称", "类型": "字符串", "长度": 20},
        {"字段名称": "GDDB", "修改后名称": "耕地等比", "类型": "长整型", "长度": 2},
        {"字段名称": "FRDBS", "修改后名称": "飞入地标识", "类型": "字符串", "长度": 1},
        {"字段名称": "CZCSXM", "修改后名称": "城镇村属性码", "类型": "字符串", "长度": 4},
        {"字段名称": "SJNF", "修改后名称": "数据年份", "类型": "长整型", "长度": 4},
        {"字段名称": "MSSM", "修改后名称": "描述说明", "类型": "字符串", "长度": 2},
        {"字段名称": "HDMC", "修改后名称": "海岛名称", "类型": "字符串", "长度": 100},
        {"字段名称": "BZ", "修改后名称": "备注", "类型": "字符串", "长度": 254},
    ]

    输入要素 = 要素类.要素创建_通过复制(输入要素路径)

    输入要素字段列表 = 要素类.字段列表获取(输入要素)
    for x in 输入要素字段列表:
        try:
            要素类.字段修改(
                输入要素,
                字段类.属性获取_名称(x),
                字段类.属性获取_名称(x).upper() + "_temp",
                字段类.属性获取_名称(x).upper() + "_temp",
                字段类.属性获取_类型(x),
                字段类.属性获取_长度(x),
                清除字段别称=False,
            )
            要素类.字段修改(
                输入要素,
                字段类.属性获取_名称(x).upper() + "_temp",
                字段类.属性获取_名称(x).upper(),
                字段类.属性获取_名称(x).upper(),
                字段类.属性获取_类型(x),
                字段类.属性获取_长度(x),
                清除字段别称=False,
            )
        except Exception as e:
            输入输出类.输出消息(f"修改字段失败：{字段类.属性获取_名称(x)},{字段类.属性获取_类型(x)},{字段类.属性获取_长度(x)}\n{str(e)}")

    输入要素字段名称列表 = 要素类.字段名称列表获取(输入要素)
    for x in 替换字典:
        if x["字段名称"] in 输入要素字段名称列表:
            try:
                要素类.字段修改(输入要素, x["字段名称"], x["修改后名称"], x["修改后名称"], x["类型"], x["长度"], 清除字段别称=False)
            except Exception as e:
                输入输出类.输出消息(f'修改字段错误：{x["字段名称"]}\n{str(e)}')
            # print(x["字段名称"] + " 已被修改为 " + x["修改后名称"])

    if 扣除地类系数要素路径:
        SQL语句 = r"扣除地类系数 <> 0"
        筛选后要素 = 要素类.要素创建_通过筛选(输入要素, SQL语句=SQL语句)
        要素类.字段删除(筛选后要素, 保留字段名称列表=["扣除地类系数"])
        # 日志类.输出调试(f"筛选后要素是：" + str(筛选后要素))
        筛选后要素 = 要素类.要素创建_通过复制并重命名重名要素(筛选后要素, 扣除地类系数要素路径)

    if 种植属性名称要素路径:
        SQL语句 = r"种植属性名称 = '工程恢复' Or 种植属性名称 = '即可恢复'"
        筛选后要素 = 要素类.要素创建_通过筛选(输入要素, SQL语句=SQL语句)
        筛选后要素 = 要素类.字段删除(筛选后要素, 保留字段名称列表=["种植属性名称"])
        # 日志类.输出调试(f"筛选后要素是：" + str(筛选后要素))
        筛选后要素 = 要素类.要素创建_通过复制并重命名重名要素(筛选后要素, 种植属性名称要素路径)

    if 城镇村属性码要素路径:
        SQL语句 = r"城镇村属性码 <> ' ' AND 城镇村属性码 <> '' AND 城镇村属性码 IS NOT NULL"
        筛选后要素 = 要素类.要素创建_通过筛选(输入要素, SQL语句=SQL语句)
        筛选后要素 = 要素类.字段删除(筛选后要素, 保留字段名称列表=["城镇村属性码"])
        # 日志类.输出调试(f"筛选后要素是：" + str(筛选后要素))
        筛选后要素 = 要素类.要素创建_通过复制并重命名重名要素(筛选后要素, 城镇村属性码要素路径)

    if 坐落单位名称要素路径:
        筛选后要素 = 要素类.要素创建_通过复制(输入要素)
        筛选后要素 = 要素类.字段删除(筛选后要素, 保留字段名称列表=["坐落单位代码", "坐落单位名称"])
        筛选后要素 = 要素类.要素创建_通过融合(筛选后要素, 融合字段列表=["坐落单位代码", "坐落单位名称"])
        # 日志类.输出调试(f"筛选后要素是：" + str(筛选后要素))
        筛选后要素 = 要素类.要素创建_通过复制并重命名重名要素(筛选后要素, 坐落单位名称要素路径)

    输出要素路径 = 要素类.要素创建_通过复制并重命名重名要素(输入要素, 输出要素路径)
    return 输出要素路径


if __name__ == "__main__":
    # 工作空间 = r"C:\Users\beixiao\Project\F富阳受降控规\受降北_数据库.gdb"
    工作空间 = r"C:\Users\common\project\J江东区临江控规\临江控规_数据库.gdb"
    工作空间 = r"C:\Users\common\Project\D德清洛舍杨树湾单元控规\03过程文件\24.11.27报批稿\D德清洛舍杨树湾单元控规_数据库.gdb"
    with 环境管理器类.环境管理器类创建(工作空间):
        字段处理并生成分项_三调(
            "CZ_三调",
            输出要素路径="CZ_三调_字段汉化",
        )
