# -*- coding: utf-8 -*-

from typing import Literal
import bxarcpy.工具包 as 工具包
from bxarcpy.要素包 import 要素类
from bxarcpy.游标包 import 游标类
from bxarcpy.几何包 import 几何类
from bxarcpy.数据库包 import 数据库类
from bxarcpy.要素数据集包 import 要素数据集类
from bxarcpy.环境包 import 环境管理器类, 输入输出类
from bxgis.配置 import 基本信息


def 入库_单元(
    规划范围线要素名称,
    单元编号,
    单元名称,
    单元类型: Literal["城镇单元", "乡村单元"],
    批复时间,
    批复文号,
    编制单位,
    单元功能,
    人口规模,
    跨单元平衡情况="",
    输出要素名称="XG_GHFW",
):
    规划范围要素 = 要素类.要素创建_通过复制(规划范围线要素名称)
    with 游标类.游标创建("查询", 规划范围要素, ["_形状"]) as 游标:
        for x in 游标类.属性获取_数据_字典形式(游标, ["_形状"]):
            if 几何类.是否包含曲线(x["_形状"]):
                print(f"要素包括曲线，请转换成折线")
                break
    要素类.字段添加(规划范围要素, "DYBH", "字符串", 20, "规划编制单元编号")
    要素类.字段计算(规划范围要素, "DYBH", f"'{单元编号}'")

    要素类.字段添加(规划范围要素, "DYMC", "字符串", 50, "规划编制单元名称")
    要素类.字段计算(规划范围要素, "DYMC", f"'{单元名称}'")

    要素类.字段添加(规划范围要素, "LX", "字符串", 10, "单元类型")
    要素类.字段计算(规划范围要素, "LX", f"'{单元类型}'")

    要素类.字段添加(规划范围要素, "PFSJ", "日期", None, "批复时间")
    要素类.字段计算(规划范围要素, "PFSJ", f"'{批复时间}'")

    要素类.字段添加(规划范围要素, "PFWH", "字符串", 50, "批复文号")
    要素类.字段计算(规划范围要素, "PFWH", f"'{批复文号}'")

    要素类.字段添加(规划范围要素, "BZDW", "字符串", 255, "编制单位")
    要素类.字段计算(规划范围要素, "BZDW", f"'{编制单位}'")

    要素类.字段添加(规划范围要素, "DYMJ", "双精度", 50, "单元面积")
    要素类.字段计算(规划范围要素, "DYMJ", "round(!Shape_Area!/10000, 4)")

    要素类.字段添加(规划范围要素, "DYGN", "字符串", 255, "单元功能")
    要素类.字段计算(规划范围要素, "DYGN", f"'{单元功能}'")

    要素类.字段添加(规划范围要素, "RK", "双精度", 50, "人口规模")
    要素类.字段计算(规划范围要素, "RK", f"float({人口规模})")

    要素类.字段添加(规划范围要素, "KDYPH", "字符串", 255, "跨单元平衡情况")
    要素类.字段计算(规划范围要素, "KDYPH", f"'{跨单元平衡情况}'")

    要素类.字段添加(规划范围要素, "BZ", "字符串", 255, "备注")
    要素类.字段删除(规划范围要素, 保留字段名称列表=["DYBH", "DYMC", "LX", "PFSJ", "PFWH", "BZDW", "DYMJ", "DYGN", "RK", "KDYPH", "BZ"])

    数据库 = 基本信息.项目信息.工作空间
    if "XG" not in 数据库类.属性获取_要素数据集名称列表(数据库):
        要素数据集 = 要素数据集类.要素数据集创建("XG")
    输出要素 = 要素类.要素创建_通过复制并重命名重名要素(规划范围要素, "XG" + "/" + 输出要素名称)
    return 输出要素


if __name__ == "__main__":
    # 工作空间 = r"C:\Users\common\project\F富阳受降控规\受降北_数据库.gdb"
    工作空间 = r"C:\Users\common\project\J江东区临江控规\临江控规_数据库.gdb"
    with 环境管理器类.环境管理器类创建(工作空间):
        入库_单元(
            规划范围线要素名称="JX_规划范围线",
            单元编号=基本信息.项目信息.单元编号,
            单元名称=基本信息.项目信息.单元名称,
            单元类型=基本信息.项目信息.单元类型,
            批复时间=基本信息.项目信息.批复时间,
            批复文号=基本信息.项目信息.批复文号,
            编制单位=基本信息.项目信息.编制单位,
            单元功能=基本信息.项目信息.单元功能,
            人口规模=基本信息.项目信息.人口规模,
            跨单元平衡情况=基本信息.项目信息.跨单元平衡情况,
        )
