# -*- coding: utf-8 -*-

import bxarcpy
from typing import Literal
import bxarcpy.工具包 as 工具包
from bxarcpy.要素包 import 要素类
from bxpy.日志包 import 日志类
from bxarcpy.游标包 import 游标类
from bxarcpy.数据库包 import 数据库类
from bxarcpy.要素数据集包 import 要素数据集类
from bxarcpy.环境包 import 环境管理器类, 输入输出类
from bxgis.配置 import 基本信息


def 入库_规划地块(
    地块要素名称="DIST_用地规划图",
    单元名称="临江单元",
    批复时间="",
    批复文号="",
    输出要素名称="XG_GHDK",
    不入库设施名称列表=基本信息.项目信息.不入库设施名称列表,
):
    # 需要提前完成编号、耕地面积计算
    地块编号字段名称 = 基本信息.地块要素字段映射.地块编号字段名称
    地类编号字段名称 = 基本信息.地块要素字段映射.地类编号字段名称
    性质名称字段名称 = 基本信息.地块要素字段映射.性质名称字段名称
    地块性质别称字段名称 = 基本信息.地块要素字段映射.地块性质别称字段名称
    兼容比例字段名称 = 基本信息.地块要素字段映射.兼容比例字段名称
    配套设施规模字段名称 = 基本信息.地块要素字段映射.配套设施规模字段名称
    地块要素 = 要素类.要素创建_通过复制(地块要素名称)

    with 游标类.游标创建("更新", 地块要素, [配套设施规模字段名称]) as 游标:
        for 游标x in 游标类.属性获取_数据_字典形式(游标, [配套设施规模字段名称]):
            if 游标x[配套设施规模字段名称] in [None, ""]:
                continue
            地块设施列表: list = 游标x[配套设施规模字段名称].split("/")
            修改后设施列表 = []
            for 设施x in 地块设施列表:
                if 设施x.split("-")[0] not in 不入库设施名称列表:
                    修改后设施列表.append(设施x)
            游标x[配套设施规模字段名称] = "/".join(修改后设施列表)
            游标类.行更新_字典形式(游标, 游标x)

    要素类.字段添加(地块要素, "DYMC", "字符串", 50, "规划编制单元名称")
    要素类.字段计算(地块要素, "DYMC", f"'{单元名称}'")
    要素类.字段添加(地块要素, "PFSJ", "日期", None, "批复时间")
    要素类.字段计算(地块要素, "PFSJ", f"'{批复时间}'")
    要素类.字段添加(地块要素, "PFWH", "字符串", 50, "批复文号")
    要素类.字段计算(地块要素, "PFWH", f"'{批复文号}'")
    要素类.字段添加(地块要素, "DKBH", "字符串", 50, "地块编号")
    要素类.字段计算(地块要素, "DKBH", f"!{地块编号字段名称}!")
    要素类.字段添加(地块要素, "DLDM", "字符串", 255, "地类代码")
    要素类.字段计算(地块要素, "DLDM", f"!{地类编号字段名称}!.replace('v','')")
    要素类.字段添加(地块要素, "DLMC", "字符串", 255, "地类名称")
    要素类.字段计算(地块要素, "DLMC", f"!{性质名称字段名称}!")
    要素类.字段添加(地块要素, "DLBM", "字符串", 100, "地类编码")
    要素类.字段计算(地块要素, "DLBM", f"!{地块性质别称字段名称}!")
    要素类.字段添加(地块要素, "ZDLDM", "字符串", 10, "主地类代码")
    要素类.字段计算(地块要素, "ZDLDM", f'!{地类编号字段名称}!.split("(")[0].split("/")[0].replace("v","")')
    要素类.字段添加(地块要素, "JRBL", "字符串", 10, "用地兼容比例")
    要素类.字段添加(地块要素, "MJ", "双精度", 50, "用地面积")
    要素类.字段计算(地块要素, "MJ", "round(!Shape_Area!/10000, 4)")
    要素类.字段添加(地块要素, "RJL", "单精度", 50, "容积率")
    要素类.字段添加(地块要素, "LDL", "单精度", 50, "绿地率")
    要素类.字段添加(地块要素, "JZMD", "单精度", 50, "建筑密度")
    要素类.字段添加(地块要素, "JZGD", "单精度", 50, "建筑高度")
    要素类.字段添加(地块要素, "XGLX", "字符串", 20, "限高类型")
    要素类.字段添加(地块要素, "FJSS1", "字符串", 255, "附建设施1")
    要素类.字段添加(地块要素, "FJSS2", "字符串", 255, "附建设施2")
    要素类.字段添加(地块要素, "GXYQ", "字符串", 255, "城市设计刚性要求")
    要素类.字段添加(地块要素, "TXYQ", "字符串", 255, "城市设计弹性要求")
    # 保留、改/扩建、新建 保留、盘活、新增
    要素类.字段添加(地块要素, "GHDT", "字符串", 10, "规划动态")
    要素类.字段添加(地块要素, "XZYD", "字符串", 255, "选择用地")
    要素类.字段添加(地块要素, "GDMJ", "双精度", 50, "耕地净面积")
    要素类.字段计算(地块要素, "GDMJ", "round(!耕地保有量!, 2)")
    # 非建设用地、城镇建设用地、村庄建设用地、区域建设用地、其他建设用地
    要素类.字段添加(地块要素, "FL", "字符串", 20, "用地分类")
    要素类.字段添加(地块要素, "TDM", "字符串", 50, "土地码")
    要素类.字段计算(地块要素, "TDM", "!土地码!")
    要素类.字段添加(地块要素, "BZ", "字符串", 255, "备注")

    需操作的字段名称列表 = ["XGLX", "绝对高度", "配套设施规模", "FJSS1", "FJSS2", "开发动态", "GHDT", "地块编号", "TDM", "地类编号", "所属街区", "所属街坊", "BZ", "备注说明", "兼容比例", "JRBL", "RJL", "容积率", "LDL", "绿地率", "JZMD", "建筑密度", "JZGD", "建筑限高", "FL", "用地构成"]

    with 游标类.游标创建("更新", 地块要素, 需操作的字段名称列表) as 游标:
        for x in 游标类.属性获取_数据_字典形式(游标, 需操作的字段名称列表):
            if x["绝对高度"] in ["51.7", "65", "156.7"]:
                x["XGLX"] = "机场限高"
                if x["备注说明"] in ["", " ", None]:
                    x["BZ"] = f'限高{x["绝对高度"]}米（1985国家高程基准）'
                else:
                    x["BZ"] = x["备注说明"] + f'，限高{x["绝对高度"]}米（1985国家高程基准）'
            if x["配套设施规模"] is None:
                x["配套设施规模"] = ""
            if len(x["配套设施规模"]) > 510:
                输入输出类.输出消息("有地块配套栏字符大于510")
            elif len(x["配套设施规模"]) > 255:
                x["FJSS1"] = x["配套设施规模"][0:255]
                x["FJSS2"] = x["配套设施规模"][255:]
            else:
                x["FJSS1"] = x["配套设施规模"]

            x["GHDT"] = x["开发动态"]

            if x[兼容比例字段名称] not in ["", " ", None]:
                x["JRBL"] = x[兼容比例字段名称].replace("/", ":")

            if x["容积率"] not in ["", " ", None]:
                x["RJL"] = float(x["容积率"])
            else:
                x["RJL"] = 0.0

            if x["绿地率"] not in ["", " ", None]:
                x["LDL"] = float(x["绿地率"])
            else:
                x["LDL"] = 0.0

            if x["建筑密度"] not in ["", " ", None]:
                x["JZMD"] = float(x["建筑密度"])
            else:
                x["JZMD"] = 0.0

            if x["建筑限高"] not in ["", " ", None]:
                x["JZGD"] = float(x["建筑限高"])
            else:
                x["JZGD"] = 0.0

            if x["用地构成"] in ["农园地", "林草地", "农业设施建设用地", "水域"]:
                x["FL"] = "非建设用地"
            elif x["用地构成"] in ["城镇建设用地"]:
                x["FL"] = "城镇建设用地"
            elif x["用地构成"] in ["村庄建设用地"]:
                x["FL"] = "村庄建设用地"
            elif x["用地构成"] in ["区域基础设施用地"]:
                x["FL"] = "区域建设用地"
            elif x["用地构成"] in ["其他建设用地"]:
                x["FL"] = "其他建设用地"

            游标类.行更新_字典形式(游标, x)

    要素类.字段删除(地块要素, 保留字段名称列表=["DYMC", "PFSJ", "PFWH", "DKBH", "DLDM", "DLMC", "DLBM", "ZDLDM", "JRBL", "MJ", "RJL", "LDL", "JZMD", "JZGD", "XGLX", "FJSS1", "FJSS2", "GXYQ", "TXYQ", "GHDT", "XZYD", "GDMJ", "FL", "TDM", "BZ"])

    数据库 = 基本信息.项目信息.工作空间
    if "入库材料" not in 数据库类.属性获取_要素数据集名称列表(数据库):
        要素数据集 = 要素数据集类.要素数据集创建("入库材料")
    输出要素 = 要素类.要素创建_通过复制并重命名重名要素(地块要素, "入库材料" + "/" + 输出要素名称)
    return 输出要素


# def FindLabel ( [DKBH], [DLBM], [RJL], [JZMD], [JZGD], [LDL], [MJ], [FJSS1], [FJSS2] ):
#     dkbh = "" if [DKBH] is None else [DKBH]
#     dlbm = "" if [DLBM] is None else [DLBM]
#     rjl = "" if [RJL] is None else [RJL]
#     jzmd = "" if [JZMD] is None else [JZMD]
#     jzgd = "" if [JZGD] is None else [JZGD]
#     ldl = "" if [LDL] is None else [LDL]
#     mj = "" if [MJ] is None else [MJ]
#     fjss1 = "" if [FJSS1] is None else [FJSS1]
#     fjss2 = "" if [FJSS2] is None else [FJSS2]
#     return u"地块编号：" + dkbh + '\n' +  u"地块性质：" + dlbm + '\n'+  u"容积率：" + rjl + '\n' + u"建筑密度：" + jzmd + '\n'+ u"建筑高度：" + jzgd + '\n' + u"绿地率：" + ldl + '\n'+  u"用地面积：" + mj + '\n'+ u"配套设施：" + fjss1 + fjss2
if __name__ == "__main__":
    日志类.开启()
    # 工作空间 = r"C:\Users\common\project\F富阳受降控规\受降北_数据库.gdb"
    工作空间 = r"C:\Users\common\project\J江东区临江控规\临江控规_数据库.gdb"
    with 环境管理器类.环境管理器类创建(工作空间):
        入库_规划地块(
            地块要素名称=基本信息.项目信息.YD_用地_规划要素名称,
            单元名称=基本信息.项目信息.单元名称,
            批复时间=基本信息.项目信息.批复时间,
            批复文号=基本信息.项目信息.批复文号,
            不入库设施名称列表=基本信息.项目信息.不入库设施名称列表,
        )
