# -*- coding: utf-8 -*-

import bxarcpy
from typing import Literal
import bxarcpy.工具包 as 工具包
from bxarcpy.要素包 import 要素类
from bxarcpy.游标包 import 游标类
from bxarcpy.数据库包 import 数据库类
from bxarcpy.要素数据集包 import 要素数据集类
from bxarcpy.环境包 import 环境管理器类, 输入输出类
from bxgis.配置 import 基本信息


def 入库_图则(
    单元名称="临江单元",
    批复时间="",
    批复文号="",
    图则线列表=[
        {
            "类型代码": "JZHTX-GC",
            "类型名称": "建筑后退线-高层",
            "要素路径": "TZ_建筑高层后退线",
            "字段映射": [
                ["管控力度", "GKLD"],
                ["备注", "BZ"],
            ],
        },
        {
            "类型代码": "JZHTX-DC",
            "类型名称": "建筑后退线-多层",
            "要素路径": "TZ_建筑多层后退线",
            "字段映射": [
                ["管控力度", "GKLD"],
                ["备注", "BZ"],
            ],
        },
        {
            "类型代码": "JKKD",
            "类型名称": "禁开口段",
            "要素路径": "TZ_禁止机动车开口线",
            "字段映射": [
                ["管控力度", "GKLD"],
                ["备注", "BZ"],
            ],
        },
        {
            "类型代码": "JDCCRK",
            "类型名称": "机动车出入口",
            "要素路径": "TZ_机动车开口符号",
            "字段映射": [
                ["管控力度", "GKLD"],
                ["备注", "BZ"],
            ],
        },
        {
            "类型代码": "JGLDKZX",
            "类型名称": "景观廊道控制线",
            "要素路径": "TZ_景观廊道控制线",
            "字段映射": [
                ["管控力度", "GKLD"],
                ["备注", "BZ"],
            ],
        },
        {
            "类型代码": "ZYJM",
            "类型名称": "重要界面",
            "要素路径": "TZ_重要界面",
            "字段映射": [
                ["管控力度", "GKLD"],
                ["备注", "BZ"],
            ],
        },
        {
            "类型代码": "DKLTD",
            "类型名称": "地块连通道",
            "要素路径": "TZ_地块连通道",
            "字段映射": [
                ["通道宽度", "GKYQ"],
                ["管控力度", "GKLD"],
                ["备注", "BZ"],
            ],
        },
        {
            "类型代码": "QTTZX",
            "类型名称": "其他图则线",
            "要素路径": "TZ_其他图则线",
            "字段映射": [
                ["管控力度", "GKLD"],
                ["备注", "BZ"],
            ],
        },
    ],
    图则面列表=[
        {
            "类型代码": "DKGDFQ",
            "类型名称": "地块高度分区",
            "要素路径": "TZ_地块高度分区",
            "字段映射": [
                ["分区高度", "GKYQ"],
                ["管控力度", "GKLD"],
                ["备注", "BZ"],
            ],
        },
        {
            "类型代码": "GGKCKJ",
            "类型名称": "公共开敞空间",
            "要素路径": "TZ_公共开敞空间",
            "字段映射": [
                ["管控要求", "GKYQ"],
                ["管控力度", "GKLD"],
                ["备注", "BZ"],
            ],
        },
        {
            "类型代码": "DXKJGKM",
            "类型名称": "地下空间管控面",
            "要素路径": "TZ_地下空间管控面",
            "字段映射": [
                ["管控要求", "GKYQ"],
                ["管控力度", "GKLD"],
                ["备注", "BZ"],
            ],
        },
        {
            "类型代码": "QTTZM",
            "类型名称": "其他图则面",
            "要素路径": "TZ_其他图则面",
            "字段映射": [
                ["管控力度", "GKLD"],
                ["备注", "BZ"],
            ],
        },
    ],
    图则点列表=[
        {
            "类型代码": "DBJZ",
            "类型名称": "地标建筑",
            "要素路径": "TZ_地标建筑",
            "字段映射": [
                ["管控力度", "GKLD"],
                ["备注", "BZ"],
            ],
        },
        {
            "类型代码": "ZYSD",
            "类型名称": "重要视点",
            "要素路径": "TZ_重要视点",
            "字段映射": [
                ["管控力度", "GKLD"],
                ["备注", "BZ"],
            ],
        },
        {
            "类型代码": "QTTZD",
            "类型名称": "其他图则点",
            "要素路径": "TZ_其他图则点",
            "字段映射": [
                ["管控力度", "GKLD"],
                ["备注", "BZ"],
            ],
        },
    ],
    输出要素名称字典={"线": "XG_TZX", "面": "XG_TZM", "点": "XG_TZD"},
):
    图则要素列表 = {"线": 图则线列表, "面": 图则面列表, "点": 图则点列表}
    retList = []
    for 图则类型 in ["线", "面", "点"]:
        图则要素 = 要素类.要素创建_通过名称(要素类型=图则类型)

        要素类.字段添加(图则要素, "DYMC", "字符串", 50, "规划编制单元名称")
        要素类.字段添加(图则要素, "PFSJ", "日期", None, "批复时间")
        要素类.字段添加(图则要素, "PFWH", "字符串", 50, "批复文号")

        要素类.字段添加(图则要素, "LXDM", "字符串", 20, f"图则{图则类型}类型代码")
        要素类.字段添加(图则要素, "LXMC", "字符串", 50, f"图则{图则类型}类型名称")

        要素类.字段添加(图则要素, "GKYQ", "字符串", 255, "管控要求")
        要素类.字段添加(图则要素, "GKLD", "字符串", 10, "管控力度")
        # 填写“刚性管控”或“弹性引导”

        要素类.字段添加(图则要素, "BZ", "字符串", 255, "备注")

        图则要素操作字段列表 = ["_形状", "LXDM", "LXMC", "GKYQ", "GKLD", "BZ"]
        with 游标类.游标创建("插入", 图则要素, 图则要素操作字段列表) as 游标_图则:
            for 图则x in 图则要素列表[图则类型]:
                要素名称 = 要素类.要素创建_通过复制(图则x["要素路径"])
                操作字段列表 = [x[0] for x in 图则x["字段映射"]]
                操作字段列表.append("_形状")
                with 游标类.游标创建("查询", 要素名称, 操作字段列表) as 游标:
                    for 游标数据 in 游标类.属性获取_数据_字典形式(游标, 操作字段列表):
                        y = {}
                        y["_形状"] = 游标数据["_形状"]
                        y["LXDM"] = 图则x["类型代码"]
                        y["LXMC"] = 图则x["类型名称"]
                        for i in 图则x["字段映射"]:
                            y[i[1]] = 游标数据[i[0]]
                        y.setdefault("GKLD", "")
                        y.setdefault("GKYQ", "")
                        y.setdefault("BZ", "")
                        游标类.行插入_字典形式(游标_图则, y, 图则要素操作字段列表)

        要素类.字段计算(图则要素, "DYMC", f"'{单元名称}'")
        要素类.字段计算(图则要素, "PFSJ", f"'{批复时间}'")
        要素类.字段计算(图则要素, "PFWH", f"'{批复文号}'")

        要素类.字段删除(图则要素, 保留字段名称列表=["DYMC", "PFSJ", "PFWH", "LXDM", "LXMC", "GKYQ", "GKLD", "BZ"])

        if "XG" not in 数据库类.属性获取_要素数据集名称列表(基本信息.项目信息.工作空间):
            要素数据集 = 要素数据集类.要素数据集创建("XG")
        输出要素 = 要素类.要素创建_通过复制并重命名重名要素(图则要素, f"XG/" + 输出要素名称字典[图则类型])
        retList.append(输出要素)
    return retList


if __name__ == "__main__":
    # 工作空间 = r"C:\Users\common\project\F富阳受降控规\受降北_数据库.gdb"
    工作空间 = r"C:\Users\common\project\J江东区临江控规\临江控规_数据库.gdb"
    with 环境管理器类.环境管理器类创建(工作空间):
        入库_图则(
            单元名称=基本信息.项目信息.单元名称,
            批复时间=基本信息.项目信息.批复时间,
            批复文号=基本信息.项目信息.批复文号,
            图则线列表=[],
            图则面列表=[],
            图则点列表=[],
        )
