# -*- coding: utf-8 -*-
from typing import Union, Literal, Any, List, Dict, Optional, TypedDict

# from pydantic import BaseModel
import bxarcpy
from typing import Literal
import bxarcpy.工具包 as 工具包
from bxpy.日志包 import 日志生成器, 日志处理器
from bxarcpy.要素包 import 要素类
from bxarcpy.游标包 import 游标类
from bxarcpy.数据库包 import 数据库类
from bxarcpy.要素数据集包 import 要素数据集类
from bxarcpy.环境包 import 环境管理器类, 输入输出类
from bxgis.配置.配置包 import 配置类

基本信息 = 配置类.项目信息对象获取()


def 入库_村庄建设边界(
    村庄建设边界要素名称="KZX_村庄建设边界",
    单元名称="临江单元",
    批复时间="",
    批复文号="",
    单元编号="QT12",
    是否融合并多部件变单部件=True,
    管控要求: Optional[str] = "按照“避让底线、引导集聚、单元统筹、预留弹性、界限清晰”的原则进行控制，综合考虑村庄分级分类与建设用地指标安排，引导乡村空间适度集聚",
    输出要素名称="XG_JSBJ",
):
    村庄建设边界要素 = 要素类.要素创建_通过复制(村庄建设边界要素名称)
    if 是否融合并多部件变单部件:
        村庄建设边界要素 = 要素类.要素创建_通过融合(村庄建设边界要素, None, 是否计算面积字段=True)
        村庄建设边界要素 = 要素类.要素创建_通过多部件至单部件(村庄建设边界要素)

    要素类.字段添加(村庄建设边界要素, "DYMC", "字符串", 50, "规划编制单元名称")
    要素类.字段计算(村庄建设边界要素, "DYMC", f"'{单元名称}'")
    要素类.字段添加(村庄建设边界要素, "PFSJ", "日期", None, "批复时间")
    要素类.字段计算(村庄建设边界要素, "PFSJ", f"'{批复时间}'")
    要素类.字段添加(村庄建设边界要素, "PFWH", "字符串", 50, "批复文号")
    要素类.字段计算(村庄建设边界要素, "PFWH", f"'{批复文号}'")

    要素类.字段添加(村庄建设边界要素, "JSBM", "字符串", 20, "建设边界编码")
    with 游标类.游标创建("更新", 村庄建设边界要素, ["JSBM"]) as 游标:
        编号 = 0
        for x in 游标类.属性获取_数据_字典形式(游标, ["JSBM"]):
            编号 += 1
            x["JSBM"] = 单元编号 + "-" + "JSBJ" + str(编号).zfill(2)
            游标类.行更新_字典形式(游标, x)

    要素类.字段添加(村庄建设边界要素, "JSMJ", "双精度", 50, "建设边界面积")
    要素类.字段计算(村庄建设边界要素, "JSMJ", "round(!Shape_Area!/10000, 4)")

    要素类.字段添加(村庄建设边界要素, "GKYQ", "字符串", 255, "管控要求")
    with 游标类.游标创建("更新", 村庄建设边界要素, ["GKYQ"]) as 游标:
        for x in 游标类.属性获取_数据_字典形式(游标, ["GKYQ"]):
            x["GKYQ"] = 管控要求
            游标类.行更新_字典形式(游标, x)

    要素类.字段添加(村庄建设边界要素, "BZ", "字符串", 255, "备注")

    要素类.字段删除(村庄建设边界要素, 保留字段名称列表=["DYMC", "PFSJ", "PFWH", "JSBM", "JSMJ", "GKYQ", "BZ"])

    数据库 = 基本信息.项目信息.工作空间
    if "XG" not in 数据库类.属性获取_要素数据集名称列表(数据库):
        要素数据集 = 要素数据集类.要素数据集创建("XG")

    if "XG_JSBJ" in 数据库类.属性获取_要素名称列表(数据库 + "/XG"):
        from bxgis.属性.属性对比 import 属性对比

        字段名称列表 = 要素类.字段名称列表获取("XG/XG_JSBJ", 含系统字段=False)
        对比字段名称列表 = [[x, x] for x in 字段名称列表]
        属性对比(
            输入要素路径1="XG/XG_JSBJ",
            输入要素路径2=村庄建设边界要素,
            映射字段名称列表=["_面积", "_面积"],
            对比字段名称列表=对比字段名称列表,
        )

    输出要素 = 要素类.要素创建_通过复制并重命名重名要素(村庄建设边界要素, f"XG" + "/" + 输出要素名称)
    return 输出要素


if __name__ == "__main__":
    日志处理器.输出器_文件对象_路径 = r"C:\Users\beixiao\Desktop\debug.txt"
    日志生成器.开启()
    工作空间 = r"C:\Users\common\project\F富阳受降控规\受降北_数据库.gdb"
    # 工作空间 = r"C:\Users\common\project\J江东区临江控规\临江控规_数据库.gdb"
    with 环境管理器类.环境管理器类创建(工作空间):
        入库_村庄建设边界(
            村庄建设边界要素名称="KZX_村庄建设边界",
            单元名称=基本信息.项目信息.单元名称,
            批复时间=基本信息.项目信息.批复时间,
            批复文号=基本信息.项目信息.批复文号,
            单元编号=基本信息.项目信息.单元编号,
            是否融合并多部件变单部件=False,
            管控要求=None,
            输出要素名称="XG_JSBJ1",
        )
