# -*- coding: utf-8 -*-

import bxarcpy
from typing import Literal


def 入库_控制线(
    单元名称="临江单元",
    批复时间="",
    批复文号="",
    道路中线要素名称="DL_道路中线",
    道路边线要素名称="DL_道路边线",
    高架桥要素名称="GZW_高架桥",
    隧道要素名称=None,
    河道边线要素名称="DL_河道边线",
    河道中线要素名称="DL_河道中线",
    地块要素名称="DIST_用地规划图",
    铁路线要素名称="GZW_铁路线",
    输油管要素名称=None,
    原水输水要素名称=None,
    高压线要素名称="GZW_高压线",
    天然气要素名称="GZW_天然气",
    综合管廊要素名称=None,
    市政管线要素名称=None,
    微波通道要素名称=None,
    高度分区要素名称=None,
    共用通道要素名称=None,
    远景道路要素名称=None,
    虚位控制河道要素名称="GZW_虚位控制河道",
    虚位控制道路要素名称="GZW_虚位控制道路",
    绿化控制线要素名称="GZW_绿化控制线",
    景观廊道要素名称=None,
    其他要素名称=None,
    输出要素名称="XG_KZX",
):
    控制线要素 = bxarcpy.要素类.要素创建_通过名称(要素类型="线")

    控制线要素.字段添加("DYMC", "字符串", 50, "规划编制单元名称").字段计算("DYMC", f"'{单元名称}'")
    控制线要素.字段添加("PFSJ", "日期", None, "批复时间").字段计算("PFSJ", f"'{批复时间}'")
    控制线要素.字段添加("PFWH", "字符串", 50, "批复文号").字段计算("PFWH", f"'{批复文号}'")

    控制线要素.字段添加("LXDM", "字符串", 20, "控制线类型代码")
    控制线要素.字段添加("LXMC", "字符串", 50, "控制线类型名称")
    控制线要素.字段添加("MC", "字符串", 50, "对象名称")

    控制线要素.字段添加("ZT", "字符串", 10, "状态")
    控制线要素.字段添加("BZ", "字符串", 255, "备注")

    with bxarcpy.游标类.游标创建_通过名称("插入", 控制线要素.名称, ["_形状", "LXDM", "LXMC", "MC", "ZT", "BZ"]) as 游标1:
        # 道路中线录入
        道路中线要素 = bxarcpy.要素类.要素读取_通过名称(道路中线要素名称).要素创建_通过复制()
        with bxarcpy.游标类.游标创建_通过名称("查询", 道路中线要素.名称, ["_形状", "道路名称", "道路等级", "开发动态", "备注"]) as 游标2:
            for x in 游标2:
                y = {}
                if x["道路等级"] in ["公路"]:
                    y["LXDM"] = "DLZX-GL"
                    y["LXMC"] = "道路中心线-公路"
                elif x["道路等级"] in ["城市快速路"]:
                    y["LXDM"] = "DLZX-KS"
                    y["LXMC"] = "道路中心线-快速路"
                elif x["道路等级"] in ["一级城市主干路", "普通城市主干路", "城市主干路"]:
                    y["LXDM"] = "DLZX-ZG"
                    y["LXMC"] = "道路中心线-主干路"
                elif x["道路等级"] in ["城市次干路"]:
                    y["LXDM"] = "DLZX-CG"
                    y["LXMC"] = "道路中心线-次干路"
                elif x["道路等级"] in ["城市支路"]:
                    y["LXDM"] = "DLZX-ZL"
                    y["LXMC"] = "道路中心线-支路"
                else:
                    bxarcpy.环境.输出消息("未识别到对应的道路等级")
                y["MC"] = x["道路名称"]
                y["ZT"] = x["开发动态"]
                y["BZ"] = x["备注"]
                y["_形状"] = x["_形状"]
                游标1.行插入(y)

        # 道路边线录入
        道路边线要素 = bxarcpy.要素类.要素读取_通过名称(道路边线要素名称).要素创建_通过复制()
        with bxarcpy.游标类.游标创建_通过名称("查询", 道路边线要素.名称, ["_形状", "道路名称", "道路等级", "开发动态", "备注"]) as 游标2:
            for x in 游标2:
                y = {}
                if x["道路等级"] in ["公路"]:
                    y["LXDM"] = "DLBX-GL"
                    y["LXMC"] = "道路边线-公路"
                elif x["道路等级"] in ["城市快速路"]:
                    y["LXDM"] = "DLBX-KS"
                    y["LXMC"] = "道路边线-快速路"
                elif x["道路等级"] in ["一级城市主干路", "普通城市主干路", "城市主干路"]:
                    y["LXDM"] = "DLBX-ZG"
                    y["LXMC"] = "道路边线-主干路"
                elif x["道路等级"] in ["城市次干路"]:
                    y["LXDM"] = "DLBX-CG"
                    y["LXMC"] = "道路边线-次干路"
                elif x["道路等级"] in ["城市支路"]:
                    y["LXDM"] = "DLBX-ZL"
                    y["LXMC"] = "道路边线-支路"
                else:
                    bxarcpy.环境.输出消息("未识别到对应的道路等级")
                y["MC"] = x["道路名称"]
                y["ZT"] = x["开发动态"]
                y["BZ"] = x["备注"]
                y["_形状"] = x["_形状"]
                游标1.行插入(y)

        # 高架边线录入
        if 高架桥要素名称:
            高架桥要素 = bxarcpy.要素类.要素读取_通过名称(高架桥要素名称).要素创建_通过复制()
            with bxarcpy.游标类.游标创建_通过名称("查询", 高架桥要素.名称, ["_形状", "道路名称", "开发动态", "备注"]) as 游标2:
                for x in 游标2:
                    y = {}
                    y["LXDM"] = "DLBX-GJ"
                    y["LXMC"] = "道路边线-高架"
                    y["MC"] = x["道路名称"]
                    y["ZT"] = x["开发动态"]
                    y["BZ"] = x["备注"]
                    y["_形状"] = x["_形状"]
                    游标1.行插入(y)

        # 隧道边线录入
        if 隧道要素名称:
            隧道要素 = bxarcpy.要素类.要素读取_通过名称(隧道要素名称).要素创建_通过复制()
            with bxarcpy.游标类.游标创建_通过名称("查询", 隧道要素.名称, ["_形状", "道路名称", "开发动态", "备注"]) as 游标2:
                for x in 游标2:
                    y = {}
                    y["LXDM"] = "DLBX-SD"
                    y["LXMC"] = "道路边线-隧道"
                    y["MC"] = x["道路名称"]
                    y["ZT"] = x["开发动态"]
                    y["BZ"] = x["备注"]
                    y["_形状"] = x["_形状"]
                    游标1.行插入(y)

        # 河道中线录入
        if 河道中线要素名称:
            河道中线要素 = bxarcpy.要素类.要素读取_通过名称(河道中线要素名称).要素创建_通过复制()
            with bxarcpy.游标类.游标创建_通过名称("查询", 河道中线要素.名称, ["_形状", "河道名称", "开发动态", "备注"]) as 游标2:
                for x in 游标2:
                    y = {}
                    y["LXDM"] = "HDZX"
                    y["LXMC"] = "河道中心线"
                    y["MC"] = x["河道名称"]
                    y["ZT"] = x["开发动态"]
                    y["BZ"] = x["备注"]
                    y["_形状"] = x["_形状"]
                    游标1.行插入(y)

        # 河道边线录入
        if 河道边线要素名称:
            河道边线要素 = bxarcpy.要素类.要素读取_通过名称(河道边线要素名称).要素创建_通过复制()
            with bxarcpy.游标类.游标创建_通过名称("查询", 河道边线要素.名称, ["_形状", "河道名称", "开发动态", "备注"]) as 游标2:
                for x in 游标2:
                    y = {}
                    y["LXDM"] = "HDBX"
                    y["LXMC"] = "河道边线"
                    y["MC"] = x["河道名称"]
                    y["ZT"] = x["开发动态"]
                    y["BZ"] = x["备注"]
                    y["_形状"] = x["_形状"]
                    游标1.行插入(y)

        # 绿化线录入
        地块要素 = bxarcpy.要素类.要素读取_通过名称(地块要素名称).要素创建_通过复制()
        地块要素 = 地块要素.要素创建_通过面转线(是否识别并存储面邻域信息=False)
        with bxarcpy.游标类.游标创建_通过名称("查询", 地块要素.名称, ["_形状", "地类编号", "开发动态", "备注"]) as 游标2:
            from bxpy import 字

            for x in 游标2:
                y = {}
                if 字.匹配正则(x["地类编号"], r".*(1401|1402).*"):
                    y["LXDM"] = "LHX"
                    y["LXMC"] = "绿化线"
                    y["MC"] = ""
                    y["ZT"] = x["开发动态"]
                    y["BZ"] = x["备注"]
                    y["_形状"] = x["_形状"]
                    游标1.行插入(y)

        # 铁路线录入
        # 备注注明设施线还是控制廊道线
        if 铁路线要素名称:
            铁路线要素 = bxarcpy.要素类.要素读取_通过名称(铁路线要素名称).要素创建_通过复制()
            with bxarcpy.游标类.游标创建_通过名称("查询", 铁路线要素.名称, ["_形状", "铁路名称", "开发动态", "备注"]) as 游标2:
                for x in 游标2:
                    y = {}
                    y["LXDM"] = "TL"
                    y["LXMC"] = "铁路"
                    y["MC"] = x["铁路名称"]
                    y["ZT"] = x["开发动态"]
                    y["BZ"] = x["备注"]
                    y["_形状"] = x["_形状"]
                    游标1.行插入(y)

        # 输油管录入
        # 备注注明设施线还是控制廊道线
        if 输油管要素名称:
            输油管要素 = bxarcpy.要素类.要素读取_通过名称(输油管要素名称).要素创建_通过复制()
            with bxarcpy.游标类.游标创建_通过名称("查询", 输油管要素.名称, ["_形状", "备注", "开发动态", "备注"]) as 游标2:
                for x in 游标2:
                    y = {}
                    y["LXDM"] = "SYG"
                    y["LXMC"] = "输油管道设施线"
                    y["MC"] = ""
                    y["ZT"] = x["开发动态"]
                    y["BZ"] = x["备注"]
                    y["_形状"] = x["_形状"]
                    游标1.行插入(y)

        # 原水输水管录入
        # 备注注明设施线还是控制廊道线
        if 原水输水要素名称:
            原水输水要素 = bxarcpy.要素类.要素读取_通过名称(原水输水要素名称).要素创建_通过复制()
            with bxarcpy.游标类.游标创建_通过名称("查询", 原水输水要素.名称, ["_形状", "备注", "开发动态", "备注"]) as 游标2:
                for x in 游标2:
                    y = {}
                    y["LXDM"] = "SYG"
                    y["LXMC"] = "输油管道设施线"
                    y["MC"] = ""
                    y["ZT"] = x["开发动态"]
                    y["BZ"] = x["备注"]
                    y["_形状"] = x["_形状"]
                    游标1.行插入(y)

        # 高压线录入
        # 备注注明设施线还是控制廊道线
        if 高压线要素名称:
            高压线要素 = bxarcpy.要素类.要素读取_通过名称(高压线要素名称).要素创建_通过复制()
            with bxarcpy.游标类.游标创建_通过名称("查询", 高压线要素.名称, ["_形状", "位置", "电压等级", "开发动态", "备注"]) as 游标2:
                for x in 游标2:
                    y = {}
                    if x["位置"] == "架空":
                        y["LXDM"] = "GYX"
                        y["LXMC"] = "高压电力架空线"
                        y["MC"] = x["电压等级"]
                        y["ZT"] = x["开发动态"]
                        y["BZ"] = x["备注"]
                        y["_形状"] = x["_形状"]
                    elif x["位置"] == "地埋":
                        y["LXDM"] = "GYX"
                        y["LXMC"] = "高压电力地埋线"
                        y["MC"] = x["电压等级"]
                        y["ZT"] = x["开发动态"]
                        y["BZ"] = x["备注"]
                        y["_形状"] = x["_形状"]
                    游标1.行插入(y)

        # 燃气线录入
        if 天然气要素名称:
            天然气要素 = bxarcpy.要素类.要素读取_通过名称(天然气要素名称).要素创建_通过复制()
            with bxarcpy.游标类.游标创建_通过名称("查询", 天然气要素.名称, ["_形状", "等级", "开发动态", "备注"]) as 游标2:
                for x in 游标2:
                    y = {}
                    y["LXDM"] = "TRQ"
                    y["LXMC"] = "高压燃气设施线"
                    y["MC"] = x["等级"]
                    y["ZT"] = x["开发动态"]
                    y["BZ"] = x["备注"]
                    y["_形状"] = x["_形状"]
                    游标1.行插入(y)

        # 综合管廊录入
        if 综合管廊要素名称:
            综合管廊要素 = bxarcpy.要素类.要素读取_通过名称(综合管廊要素名称).要素创建_通过复制()
            with bxarcpy.游标类.游标创建_通过名称("查询", 综合管廊要素.名称, ["_形状", "开发动态", "备注"]) as 游标2:
                for x in 游标2:
                    y = {}
                    y["LXDM"] = "ZHGL"
                    y["LXMC"] = "综合管廊"
                    y["MC"] = ""
                    y["ZT"] = x["开发动态"]
                    y["BZ"] = x["备注"]
                    y["_形状"] = x["_形状"]
                    游标1.行插入(y)

        # 市政管线录入
        if 市政管线要素名称:
            市政管线要素 = bxarcpy.要素类.要素读取_通过名称(市政管线要素名称).要素创建_通过复制()
            with bxarcpy.游标类.游标创建_通过名称("查询", 市政管线要素.名称, ["_形状", "类型", "等级", "开发动态", "备注"]) as 游标2:
                for x in 游标2:
                    y = {}
                    if x["类型"] == "给水":
                        y["LXDM"] = "GX-S"
                        y["LXMC"] = "自来水管线"
                        y["MC"] = ""
                        y["ZT"] = x["开发动态"]
                        y["BZ"] = x["备注"]
                        y["_形状"] = x["_形状"]
                    elif x["类型"] == "污水":
                        y["LXDM"] = "GX-W"
                        y["LXMC"] = "污水管线"
                        y["MC"] = ""
                        y["ZT"] = x["开发动态"]
                        y["BZ"] = x["备注"]
                        y["_形状"] = x["_形状"]
                    elif x["类型"] == "雨水":
                        y["LXDM"] = "GX-Y"
                        y["LXMC"] = "雨水管线"
                        y["MC"] = ""
                        y["ZT"] = x["开发动态"]
                        y["BZ"] = x["备注"]
                        y["_形状"] = x["_形状"]
                    elif x["类型"] == "电力":
                        y["LXDM"] = "GX-D"
                        y["LXMC"] = "地下电力管线"
                        y["MC"] = x["等级"]
                        y["ZT"] = x["开发动态"]
                        y["BZ"] = x["备注"]
                        y["_形状"] = x["_形状"]
                    elif x["类型"] == "燃气":
                        y["LXDM"] = "GX-Q"
                        y["LXMC"] = "中压燃气管线"
                        y["MC"] = ""
                        y["ZT"] = x["开发动态"]
                        y["BZ"] = x["备注"]
                        y["_形状"] = x["_形状"]
                    elif x["类型"] == "热力":
                        y["LXDM"] = "RL"
                        y["LXMC"] = "热力管线"
                        y["MC"] = ""
                        y["ZT"] = x["开发动态"]
                        y["BZ"] = x["备注"]
                        y["_形状"] = x["_形状"]
                    elif x["类型"] == "电信":
                        y["LXDM"] = "TX"
                        y["LXMC"] = "通信管线"
                        y["MC"] = ""
                        y["ZT"] = x["开发动态"]
                        y["BZ"] = x["备注"]
                        y["_形状"] = x["_形状"]
                    elif x["类型"] == "防洪":
                        y["LXDM"] = "FH"
                        y["LXMC"] = "防洪（潮）设施控制线"
                        y["MC"] = ""
                        y["ZT"] = x["开发动态"]
                        y["BZ"] = x["备注"]
                        y["_形状"] = x["_形状"]
                    elif x["类型"] == "防灾":
                        y["LXDM"] = "FZ"
                        y["LXMC"] = "综合防灾减灾设施控制线"
                        y["MC"] = ""
                        y["ZT"] = x["开发动态"]
                        y["BZ"] = x["备注"]
                        y["_形状"] = x["_形状"]
                    游标1.行插入(y)

        # 微波通道录入
        if 微波通道要素名称:
            微波通道要素 = bxarcpy.要素类.要素读取_通过名称(微波通道要素名称).要素创建_通过复制()
            with bxarcpy.游标类.游标创建_通过名称("查询", 微波通道要素.名称, ["_形状", "开发动态", "备注"]) as 游标2:
                for x in 游标2:
                    y = {}
                    y["LXDM"] = "WBTD"
                    y["LXMC"] = "微波通道"
                    y["MC"] = ""
                    y["ZT"] = x["开发动态"]
                    y["BZ"] = x["备注"]
                    y["_形状"] = x["_形状"]
                    游标1.行插入(y)

        # 高度分区录入
        if 高度分区要素名称:
            高度分区要素 = bxarcpy.要素类.要素读取_通过名称(高度分区要素名称).要素创建_通过复制()
            with bxarcpy.游标类.游标创建_通过名称("查询", 高度分区要素.名称, ["_形状", "开发动态", "备注"]) as 游标2:
                for x in 游标2:
                    y = {}
                    y["LXDM"] = "GDFQ"
                    y["LXMC"] = "建筑控制高度分区线"
                    y["MC"] = ""
                    y["ZT"] = x["开发动态"]
                    y["BZ"] = x["备注"]
                    y["_形状"] = x["_形状"]
                    游标1.行插入(y)

        # 共用通道录入
        if 共用通道要素名称:
            共用通道要素 = bxarcpy.要素类.要素读取_通过名称(共用通道要素名称).要素创建_通过复制()
            with bxarcpy.游标类.游标创建_通过名称("查询", 共用通道要素.名称, ["_形状", "开发动态", "备注"]) as 游标2:
                for x in 游标2:
                    y = {}
                    y["LXDM"] = "DKJGGTD"
                    y["LXMC"] = "地块间公共通道"
                    y["MC"] = ""
                    y["ZT"] = x["开发动态"]
                    y["BZ"] = x["备注"]
                    y["_形状"] = x["_形状"]
                    游标1.行插入(y)

        # 远景道路录入
        if 远景道路要素名称:
            远景道路要素 = bxarcpy.要素类.要素读取_通过名称(远景道路要素名称).要素创建_通过复制()
            with bxarcpy.游标类.游标创建_通过名称("查询", 远景道路要素.名称, ["_形状", "开发动态", "备注"]) as 游标2:
                for x in 游标2:
                    y = {}
                    y["LXDM"] = "YJDLKZ"
                    y["LXMC"] = "远景道路控制线"
                    y["MC"] = ""
                    y["ZT"] = x["开发动态"]
                    y["BZ"] = x["备注"]
                    y["_形状"] = x["_形状"]
                    游标1.行插入(y)

        # 绿化控制线录入
        if 绿化控制线要素名称:
            绿化控制线要素 = bxarcpy.要素类.要素读取_通过名称(绿化控制线要素名称).要素创建_通过复制()
            with bxarcpy.游标类.游标创建_通过名称("查询", 绿化控制线要素.名称, ["_形状", "开发动态", "备注"]) as 游标2:
                for x in 游标2:
                    y = {}
                    y["LXDM"] = "KZLHX"
                    y["LXMC"] = "控制绿化线"
                    y["MC"] = ""
                    y["ZT"] = x["开发动态"]
                    y["BZ"] = x["备注"]
                    y["_形状"] = x["_形状"]
                    游标1.行插入(y)

        # 虚位控制河道录入
        if 虚位控制河道要素名称:
            虚位控制河道要素 = bxarcpy.要素类.要素读取_通过名称(虚位控制河道要素名称).要素创建_通过复制()
            with bxarcpy.游标类.游标创建_通过名称("查询", 虚位控制河道要素.名称, ["_形状", "开发动态", "备注"]) as 游标2:
                for x in 游标2:
                    y = {}
                    y["LXDM"] = "XWKZHD"
                    y["LXMC"] = "虚位控制河道"
                    y["MC"] = ""
                    y["ZT"] = x["开发动态"]
                    y["BZ"] = x["备注"]
                    y["_形状"] = x["_形状"]
                    游标1.行插入(y)

        # 虚位控制道路录入
        if 虚位控制道路要素名称:
            虚位控制道路要素 = bxarcpy.要素类.要素读取_通过名称(虚位控制道路要素名称).要素创建_通过复制()
            with bxarcpy.游标类.游标创建_通过名称("查询", 虚位控制道路要素.名称, ["_形状", "开发动态", "备注"]) as 游标2:
                for x in 游标2:
                    y = {}
                    y["LXDM"] = "XWKZDL"
                    y["LXMC"] = "虚位控制道路"
                    y["MC"] = ""
                    y["ZT"] = x["开发动态"]
                    y["BZ"] = x["备注"]
                    y["_形状"] = x["_形状"]
                    游标1.行插入(y)

        # 景观廊道录入
        if 景观廊道要素名称:
            景观廊道要素 = bxarcpy.要素类.要素读取_通过名称(景观廊道要素名称).要素创建_通过复制()
            with bxarcpy.游标类.游标创建_通过名称("查询", 景观廊道要素.名称, ["_形状", "开发动态", "备注"]) as 游标2:
                for x in 游标2:
                    y = {}
                    y["LXDM"] = "JGKZLD"
                    y["LXMC"] = "景观控制廊道线"
                    y["MC"] = ""
                    y["ZT"] = x["开发动态"]
                    y["BZ"] = x["备注"]
                    y["_形状"] = x["_形状"]
                    游标1.行插入(y)

        # 其他要素录入
        if 其他要素名称:
            其他要素 = bxarcpy.要素类.要素读取_通过名称(其他要素名称).要素创建_通过复制()
            with bxarcpy.游标类.游标创建_通过名称("查询", 其他要素.名称, ["_形状", "名称", "开发动态", "备注"]) as 游标2:
                for x in 游标2:
                    y = {}
                    y["LXDM"] = "QT"
                    y["LXMC"] = "其他控制线"
                    y["MC"] = x["名称"]
                    y["ZT"] = x["开发动态"]
                    y["BZ"] = x["备注"]
                    y["_形状"] = x["_形状"]
                    游标1.行插入(y)

    控制线要素.字段删除(保留字段名称列表=["DYMC", "PFSJ", "PFWH", "LXDM", "LXMC", "MC", "ZT", "BZ"])

    数据库 = bxarcpy.数据库类.数据库读取_通过路径(bxarcpy.配置.当前工作空间)
    if "入库材料" not in 数据库.要素数据集名称列表获取():
        要素数据集 = bxarcpy.要素数据集类.要素数据集创建("入库材料")
    输出要素 = 控制线要素.要素创建_通过复制并重命名重名要素(f"入库材料/" + 输出要素名称)
    return 输出要素


if __name__ == "__main__":
    # 工作空间 = r"C:\Users\common\project\F富阳受降控规\受降北_数据库.gdb"
    工作空间 = r"C:\Users\common\project\J江东区临江控规\临江控规_数据库.gdb"
    with bxarcpy.环境.环境管理器(工作空间):
        入库_控制线(单元名称="临江单元", 批复时间="", 批复文号="", 道路中线要素名称="DL_道路中线", 道路边线要素名称="DL_道路边线", 高架桥要素名称="GZW_高架桥", 隧道要素名称=None, 河道边线要素名称="DL_河道边线", 河道中线要素名称="DL_河道中线", 地块要素名称="DIST_用地规划图", 铁路线要素名称="GZW_铁路线", 输油管要素名称=None, 原水输水要素名称=None, 高压线要素名称="GZW_高压线", 天然气要素名称="GZW_天然气", 综合管廊要素名称=None, 市政管线要素名称=None, 微波通道要素名称=None, 高度分区要素名称=None, 共用通道要素名称=None, 远景道路要素名称=None, 虚位控制河道要素名称="GZW_虚位控制河道", 虚位控制道路要素名称="GZW_虚位控制道路", 绿化控制线要素名称="GZW_绿化控制线", 景观廊道要素名称=None, 其他要素名称=None)
