import bxarcpy
import bxarcpy.工具包 as 工具包
from bxarcpy.要素包 import 要素类
from bxarcpy.游标包 import 游标类
from bxarcpy.数据库包 import 数据库类
from bxarcpy.要素数据集包 import 要素数据集类
from bxarcpy.环境包 import 环境管理器类, 输入输出类
from bxgis.配置 import 基本信息


def 用地创建_生成用地调整图(调整前要素名称="DIST_用地现状图", 调整后要素名称="DIST_用地规划图", 输出要素名称="in_memory\\AA_用地调整图"):
    if 输出要素名称 == "in_memory\\AA_用地调整图":
        输出要素名称 = 输出要素名称 + "_" + 工具包.生成短GUID()

    调整前要素 = 要素类.要素创建_通过复制(调整前要素名称)
    调整后要素 = 要素类.要素创建_通过复制(调整后要素名称)
    联合后要素 = 要素类.要素创建_通过联合([调整前要素, 调整后要素])
    要素类.字段修改(联合后要素, "地类编号", "地类编号_现状")
    要素类.字段修改(联合后要素, "地类编号_1", "地类编号_规划")
    要素类.字段添加(联合后要素, "调整类型")
    要素类.字段添加(联合后要素, "地类差异")
    with 游标类.游标创建("更新", 联合后要素, ["地类编号_现状", "地类编号_规划", "地类差异", "调整类型", "所属三区三线", "开发动态"]) as 游标:
        for x in 游标类.游标迭代器转换_字典形式(游标, ["地类编号_现状", "地类编号_规划", "地类差异", "调整类型", "所属三区三线", "开发动态"]):
            if x["地类编号_现状"] != x["地类编号_规划"]:
                x["地类差异"] = f'{x["地类编号_现状"]} -> {x["地类编号_规划"]}'
            游标类.行更新_字典形式(游标, x)
            输出要素 = 要素类.要素创建_通过复制并重命名重名要素(联合后要素, 输出要素名称)
    return 输出要素


if __name__ == "__main__":
    # 工作空间 = r"C:\Users\common\project\F富阳受降控规\受降北_数据库.gdb"
    工作空间 = r"C:\Users\common\project\J江东区临江控规\临江控规_数据库.gdb"
    with 环境管理器类.环境管理器类创建(工作空间):
        用地创建_生成用地调整图(调整前要素名称="DIST_用地现状图", 调整后要素名称="DIST_用地规划图", 输出要素名称="in_memory\\AA_用地调整图")
