# -*- coding: utf-8 -*-

import bxarcpy
from typing import Literal


def 入库_工业片区(区域要素名称="JX_工业片区范围线", 单元名称="临江单元", 区域编号字段名称="区域编号", 区域名称字段名称="区域名称", 总工业用地面积字段名称="总工业用地面积", 总工业建筑面积字段名称="总工业建筑面积", 区域主导属性字段名称="区域主导属性", 配套设施汇总字段名称="配套设施汇总", 交通设施汇总字段名称="交通设施汇总", 市政设施汇总字段名称="市政设施汇总"):
    区域要素 = bxarcpy.要素类.要素读取_通过名称(区域要素名称).要素创建_通过复制()

    区域要素.字段添加("DYMC", "字符串", 50, "规划编制单元名称").字段计算("DYMC", f"'{单元名称}'")
    区域要素.字段添加("PQBM", "字符串", 20, "工业片区编码").字段计算("PQBM", f"!{区域编号字段名称}!")
    区域要素.字段添加("PQMC", "字符串", 50, "工业片区名称").字段计算("PQMC", f"!{区域名称字段名称}!")
    区域要素.字段添加("PQMJ", "双精度", 50, "片区面积").字段计算("PQMJ", "round(!Shape_Area!/10000, 4)")
    区域要素.字段添加("YDZL", "双精度", 50, "工业用地总量").字段计算("YDZL", f"round(float(!{总工业用地面积字段名称}!)/10000, 4)")
    区域要素.字段添加("JZZL", "双精度", 50, "工业建筑总量").字段计算("JZZL", f"round(float(!{总工业建筑面积字段名称}!)/10000, 4)")
    区域要素.字段添加("ZDGN", "字符串", 255, "产业主导功能").字段计算("ZDGN", f"!{区域主导属性字段名称}!")

    区域要素.字段添加("PTSS", "字符串", 255, "配套设施").字段计算("PTSS", f"!{配套设施汇总字段名称+'1'}!")
    区域要素.字段添加("PTSS2", "字符串", 255, "配套设施2").字段计算("PTSS2", f"!{配套设施汇总字段名称+'2'}!")
    区域要素.字段添加("PTSS3", "字符串", 255, "配套设施3").字段计算("PTSS3", f"!{配套设施汇总字段名称+'3'}!")
    区域要素.字段添加("JTSS", "字符串", 255, "道路与交通设施").字段计算("JTSS", f"!{交通设施汇总字段名称+'1'}!")
    区域要素.字段添加("JTSS2", "字符串", 255, "道路与交通设施2").字段计算("JTSS2", f"!{交通设施汇总字段名称+'2'}!")
    区域要素.字段添加("JTSS3", "字符串", 255, "道路与交通设施3").字段计算("JTSS3", f"!{交通设施汇总字段名称+'3'}!")
    区域要素.字段添加("SZSS", "字符串", 255, "市政设施").字段计算("SZSS", f"!{市政设施汇总字段名称+'1'}!")
    区域要素.字段添加("SZSS2", "字符串", 255, "市政设施2").字段计算("SZSS2", f"!{市政设施汇总字段名称+'2'}!")
    区域要素.字段添加("SZSS3", "字符串", 255, "市政设施3").字段计算("SZSS3", f"!{市政设施汇总字段名称+'3'}!")

    区域要素.字段添加("BZ", "字符串", 255, "备注")

    区域要素.字段删除(保留字段名称列表=["DYMC", "PQBM", "PQMC", "PQMJ", "YDZL", "JZZL", "ZDGN", "PTSS", "PTSS2", "PTSS3", "JTSS", "JTSS2", "JTSS3", "SZSS", "SZSS2", "SZSS3", "BZ"])

    数据库 = bxarcpy.数据库类.数据库读取_通过路径(bxarcpy.配置.当前工作空间)
    if "入库材料" not in 数据库.要素数据集名称列表获取():
        要素数据集 = bxarcpy.要素数据集类.要素数据集创建("入库材料")
    区域要素.要素创建_通过复制并重命名重名要素("入库材料/XG_GYPQ")


if __name__ == "__main__":
    # 工作空间 = r"C:\Users\common\project\F富阳受降控规\受降北_数据库.gdb"
    工作空间 = r"C:\Users\common\project\J江东区临江控规\临江控规_数据库.gdb"
    with bxarcpy.环境.环境管理器(工作空间):
        入库_工业片区(区域要素名称="JX_工业片区范围线", 单元名称="临江单元", 区域编号字段名称="区域编号", 区域名称字段名称="区域名称", 总工业用地面积字段名称="总工业用地面积", 总工业建筑面积字段名称="总工业建筑面积", 区域主导属性字段名称="区域主导属性", 配套设施汇总字段名称="配套设施汇总", 交通设施汇总字段名称="交通设施汇总", 市政设施汇总字段名称="市政设施汇总")
